Repository: authselect/authselect
Catalog: src/man/po/authselect-migration.7.adoc.*.po
Languages: ca, it, pt_br

source: [domain/default] id_provider = ldap auth_provider = krb5 ldap_uri = _srv_ krb5_server = _srv_ krb5_realm = MYREALM dns_discovery_domain = myrealm
pt_br: [domain/default] id_provider = ldap auth_provider = krb5 ldap_uri = _srv_ krb5_server = _srv_ krb5_realm = MEUREALM dns_discovery_domain = meurealm

source: If you want to configure SSSD for an IPA or Active Directory domain, use the `realm` tool. This will perform an initial setup which involves creating a Kerberos keytab and generating basic SSSD configuration. You can then tune it up by modifying {sysconfdir}/sssd/sssd.conf.
ca: Si voleu configurar SSSD per a un domini IPA o Active Directory, utilitzeu l'eina `realm`. Això realitzarà una configuració inicial que implica crear una clau de Kerberos i generar una configuració bàsica de SSSD. Llavors podeu afinar-lo modificant {sysconfdir}/sssd/sssd.conf.
it: Se si desidera configurare SSSD per un dominio IPA o Active Directory, utilizzare lo strumento `realm`. Questo eseguirà una configurazione iniziale che prevede la creazione di un keytab Kerberos e la generazione della configurazione SSSD di base. È quindi possibile ottimizzarla modificando {sysconfdir}/sssd/sssd.conf.
pt_br: Se você quiser configurar o SSSD para um domínio IPA ou Active Directory, use a ferramenta `realm`. Isso executará uma configuração inicial que envolve a criação de um keytab Kerberos e a geração da configuração básica do SSSD. Você pode então ajustá-lo modificando {sysconfdir}/sssd/sssd.conf.

source: If you want to configure the machine to use Winbind, use `realm`. This will perform an initial setup which involves creating a Kerberos keytab and running `adcli` to join the domain. It also makes changes to `smb.conf`. You can then tune it up by modifying {sysconfdir}/samba/smb.conf.
ca: Si voleu configurar la màquina per usar Winbind, utilitzeu `realm`. Això realitzarà una configuració inicial que implica crear una clau de Kerberos i executar `adcli` per unir-se al domini. També fa canvis a `smb.conf`. Després podeu afinar-lo modificant {sysconfdir}/samba/smb.conf.
it: Se si desidera configurare la macchina per utilizzare Winbind, utilizzare `realm`. Questo eseguirà una configurazione iniziale che prevede la creazione di una keytab Kerberos e l'esecuzione di `adcli` per unirsi al dominio. Apporta anche modifiche a `smb.conf`. È quindi possibile ottimizzarlo modificando {sysconfdir}/samba/smb.conf.
pt_br: Se quiser configurar a máquina para usar o Winbind, use `realm`. Isso executará uma configuração inicial que envolve a criação de um keytab de Kerberos e a execução de `adcli` para ingressar no domínio. Também fará alterações em `smb.conf`. Você pode então ajustá-lo modificando {sysconfdir}/samba/smb.conf.

source: There are several places that needs to be configured in order to make NIS authentication work. First, you need to set NIS domain and optionally also NIS server in {sysconfdir}/yp.conf.
ca: Hi ha diversos llocs que cal configurar per tal de fer que l'autenticació NIS funcioni. Primer, heu d'establir el domini NIS i opcionalment també el servidor NIS a {sysconfdir}/yp.conf.
it: Ci sono diversi punti da configurare per far funzionare l'autenticazione NIS. Innanzitutto, è necessario impostare il dominio NIS e, facoltativamente, anche il server NIS in {sysconfdir}/yp.conf.
pt_br: Há vários locais que precisam ser configurados para que a autenticação NIS funcione. Primeiro, você precisa definir o domínio NIS e, opcionalmente, também o servidor NIS em {sysconfdir}/yp.conf.

source: domain mydomain broadcast # or # domain mydomain server myserver
ca: domain mydomain broadcast # o # domain mydomain server myserver
it: dominio miodominio trasmesso # o # dominio miodominio server mioserver
pt_br: domain meudominio broadcast # ou # domain meudominio server meuservidor

source: NIS domain must be also set in system network configuration.
ca: El domini NIS també s'ha d'establir a la configuració de la xarxa del sistema.
it: Il dominio NIS deve essere impostato anche nella configurazione di rete del sistema.
pt_br: O domínio NIS também deve ser definido na configuração de rede do sistema.

source: NISDOMAIN=mydomain
it: NISDOMAIN=miodominio
pt_br: NISDOMAIN=meudominio

source: Now, you can set the domain name with command line so there is no need to reboot your system. Additionaly, it may be necessary to enable NIS in selinux.
ca: Ara, podeu establir el nom de domini amb la línia de comandes, de manera que no hi ha necessitat de reiniciar el vostre sistema. A més, pot ser necessari habilitar NIS en selinux.
it: Ora puoi impostare il nome di dominio tramite riga di comando, senza dover riavviare il sistema. Inoltre, potrebbe essere necessario abilitare NIS in selinux.
pt_br: Agora, você pode definir o nome de domínio via linha de comando, sem precisar reinicializar o sistema. Além disso, pode ser necessário habilitar o NIS no SELinux.

source: $ domainname mydomain $ setsebool -P allow_ypbind 1
it: \$ domainname miodominio \$ setsebool -P allow\_ypbind 1
pt_br: $ domainname meudominio $ setsebool -P allow_ypbind 1

source: PASSWORD QUALITY
ca: QUALITAT DE LA CONTRASENYA
it: QUALITÀ DELLA PASSWORD
pt_br: QUALIDADE DE SENHA

source: Authselect enables `pam_pwquality` module to enforce password quality restrictions. This module is enabled only for local users. Remote users should use the password policy that is enforced by the respective remote server.
ca: Authselect habilita el mòdul `pam_pwquality` per a aplicar restriccions de qualitat de contrasenya. Aquest mòdul només està habilitat per a usuaris locals. Els usuaris remots han d'utilitzar la política de contrasenya que aplica el servidor remot respectiu.
it: Authselect abilita il modulo `pam_pwquality` per applicare restrizioni sulla qualità delle password. Questo modulo è abilitato solo per gli utenti locali. Gli utenti remoti devono utilizzare la policy sulle password applicata dal rispettivo server remoto.
pt_br: O Authselect habilita o módulo `pam_pwquality` para aplicar restrições de qualidade de senha. Este módulo é habilitado apenas para usuários locais. Usuários remotos devem usar a política de senha aplicada pelo respectivo servidor remoto.

source: The `pam_pwquality` module can be configured in {sysconfdir}/security/pwquality.conf. See pam_pwquality(8) to see its configuration options and defaults.
ca: El mòdul `pam_pwquality` es pot configurar a {sysconfdir}/security/pwquality.conf. Vegeu pam_pwquality(8) per veure les seves opcions de configuració i els valors predeterminats.
it: Il modulo `pam_pwquality` può essere configurato in {sysconfdir}/security/pwquality.conf. Consultare pam_pwquality(8) per vedere le sue opzioni di configurazione e i valori predefiniti.
pt_br: O módulo `pam_pwquality` pode ser configurado em {sysconfdir}/security/pwquality.conf. Consulte pam_pwquality(8) para ver suas opções de configuração e padrões.

source: STARTING SERVICES
ca: INICIANT SERVEIS
it: AVVIO SERVIZI
pt_br: INICIANDO SERVIÇOS

source: Depending on your configuration, you need to start required services manually with systemd.
ca: Depenent de la configuració, heu d'iniciar els serveis requerits manualment amb systemd.
it: A seconda della configurazione, è necessario avviare manualmente i servizi richiesti con systemd.
pt_br: Dependendo da sua configuração, você precisa iniciar os serviços necessários manualmente com o systemd.

source: If mkhomedir feature is enabled
ca: Si la característica mkhomedir està activada
it: Se la funzione mkhomedir è abilitata
pt_br: Se o recurso mkhomedir estiver habilitado

source: AUTHCONFIG TOOLS
ca: EINES D'AUTHCONFIG
it: STRUMENTI AUTHCONFIG
pt_br: FERRAMENTAS DO AUTHCONFIG

source: Authconfig shipped a tool called _cacertdir_rehash_. If you depend on this tool, please switch to native _openssl_ command: *openssl rehash <directory>* that serves the same purpose.
ca: Authconfig incloïa una eina anomenada _cacertdir_rehash_. Si depeneu d'aquesta eina, canvieu a la comanda nativa _openssl_: *openssl rehash <directori>* que serveix al mateix propòsit.
it: Authconfig ha fornito uno strumento chiamato _cacertdir_rehash_. Se dipendi da questo strumento, passa al comando nativo _openssl_: *openssl rehash <directory>* che ha lo stesso scopo.
pt_br: A authconfig enviou uma ferramenta chamada _cacertdir_rehash_. Se você depende dessa ferramenta, mude para o comando nativo do _openssl_: *openssl rehash <diretório>* que serve ao mesmo propósito.

source: SEE ALSO
ca: VEGEU TAMBÉ
it: VEDI ANCHE
pt_br: VEJA TAMBÉM

source: authselect-migration(7)
it: migrazione di authselect(7)

source: authconfig --enableldap --enableldapauth --enablefaillock --updateall authselect select sssd with-faillock
it: authconfig --enableldap --enableldapauth --enablefaillock --aggiornatutto authselect seleziona sssd con-faillock

source: authconfig --enablesssd --enablesssdauth --enablesmartcard --smartcardmodule=sssd --updateall authselect select sssd with-smartcard
it: authconfig --enablesssd --enablesssdauth --enablesmartcard --smartcardmodule=sssd --aggiornatutto authselect seleziona sssd con-smartcard

source: authconfig --enableecryptfs --enablepamaccess --updateall authselect select sssd with-ecryptfs with-pamaccess
it: authconfig --enableecryptfs --enablepamaccess --aggiornatutto authselect seleziona sssd con-ecryptfs con-pamaccess

source: systemctl enable sssd.service ; systemctl start sssd.service
it: systemctl abilita sssd.service ; systemctl avvia sssd.service
