Repository: authselect/authselect
Catalog: src/man/po/authselect.8.adoc.*.po
Languages: ca, es, fi, id, ka, pt_br

source: NAME
ca: NOM
es: NOMBRE
fi: NIMI
id: NAMA
ka: სახელი
pt_br: NOME

source: authselect - select system identity and authentication sources.
ca: authselect - selecciona la identitat del sistema i les fonts d'autenticació.
es: authselect - selección de orígenes de identidad y autenticación.
fi: authselect - valitse järjestelmän identiteetti ja todennuslähteet.
id: authselect - memilih sumber identitas sistem dan autentikasi.
ka: authselect - აირჩიეთ სისტემის იდენტიფიკაციის და ავთენტიკაციის წყაროები.
pt_br: authselect - selecionar identidade do sistema e fontes de autenticação.

source: SYNOPSIS
ca: SINOPSI
es: SINOPSIS
id: SINOPSIS
ka: მოკლე აღწერა
pt_br: SINOPSE

source: authselect [--debug] [--trace] [--warn] command [command options]
ca: authselect [--debug] [--trace] [--warn] comanda [opcions de la comanda]
es: authselect [--debug] [--trace] [--warn] comando [opciones del comando]
fi: authselect [--debug] [--trace] [--warn] komento [komennon valitsimet]
id: authselect [--debug] [--trace] [--warn] perintah [opsi perintah]
ka: authselect [--debug] [--trace] [--warn] ბრძანება [ბრძანების პარამეტრები]
pt_br: authselect [--debug] [--trace] [--warn] comando [opções do comando]

source: DESCRIPTION
ca: DESCRIPCIÓ
es: DESCRIPCIÓN
fi: KUVAUS
id: DESKRIPSI
ka: აღწერა
pt_br: DESCRIÇÃO

source: *Authselect* is a tool to configure system identity and authentication sources and providers by selecting a specific profile. Profile is a set of files that describes how the resulting system configuration will look like. When a profile is selected, *authselect* will create nsswitch.conf(5) and PAM(8) stack to use identity and authentication sources defined by the profile.
ca: *Authselect* és una eina per configurar la identitat del sistema i les fonts d'autenticació i els proveïdors seleccionant un perfil específic. El perfil és un conjunt de fitxers que descriu com serà la configuració del sistema resultant. Quan es selecciona un perfil *authselect* crearà la pila nsswitch.conf(5) i PAM(8) per utilitzar les fonts d'identitat i autenticació definides pel perfil.
es: *Authselect* es una herramienta para configurar las fuentes y proveedores de identificación y autenticación en el sistema mediante la selección de perfiles. Un perfil es un conjunto de archivos que describe cómo debe quedar la configuración. Al elegir un perfil *authselect* se encarga de generar los archivos nsswitch.conf(5) y la configuración de PAM(8) para que funcionen según define el perfil.
ka: Authselect არის პროგრამა სისტემის იდენტობისა და ავთენტიკაციის წყაროებისა და მომწოდებლების მოსარგებად კონკრეტული პროფილის არჩევის გზით. პროფილი არის ფაილების ნაკრები, რომელიც აღწერს, თუ როგორი იქნება სისტემის საბოლოო კონფიგურაცია. როდესაც პროფილი არჩეულია, authselect შექმნის nsswitch.conf(5) და PAM(8) სტეკს, რათა გამოიყენოს პროფილის მიერ განსაზღვრული იდენტობისა და ავთენტიკაციის წყაროები.
pt_br: *Authselect* é uma ferramenta para configurar a identidade do sistema e fontes de autenticação e provedores selecionando um perfil específico. Perfil é um conjunto de arquivos que descreve como a configuração resultante do sistema será. Quando um perfil é selecionado, *authselect* irá criar nsswitch.conf (5) e pilhas PAM (8) para usar a identidade e as fontes de autenticação definidas pelo perfil.

source: If the provided profile set is not sufficient, the administrator may create a custom profile by putting it in a special profile directory ({AUTHSELECT_CUSTOM_DIR}). By doing so, the profile is immediately usable by *authselect*. See _authselect-profiles(5)_ for more information on extending existing profiles.
ca: Si el conjunt de perfils proporcionat no és suficient, l'administrador pot crear un perfil personalitzat posant-lo en un directori de perfils especial ({AUTHSELECT_CUSTOM_DIR}). En fer-ho, el perfil és immediatament utilitzable per *authselect*. Vegeu _authselect-profiles(5)_ per obtenir més informació sobre com estendre els perfils existents.
es: Si el conjunto de perfiles existente no es suficiente, el administrador puede un crear uno personalizado poniéndolo en {AUTHSELECT_CUSTOM_DIR}. Con ello se puede usar inmediatamente desde *authselect*. Consulte _authselect-profiles(5)_ para saber más sobre cómo extender los perfiles existentes.
fi: Jos annettu profiilisarja ei riitä, järjestelmänvalvoja voi luoda mukautetun profiilin sijoittamalla sen erityiseen profiilihakemistoon ({AUTHSELECT_CUSTOM_DIR}). Näin tekemällä profiili on välittömästi *authselectin* käytettävissä. Katso _authselect-profiles(5)_ saadaksesi lisätietoja olemassa olevien profiilien laajentamisesta.
id: Jika set profil yang disediakan tidak memadai, administrator dapat membuat profil khusus dengan menempatkannya di direktori profil khusus ({AUTHSELECT_CUSTOM_DIR}). Dengan melakukan hal tersebut, profil tersebut dapat segera digunakan oleh *authselect*. Lihat _authselect-profiles(5)_ untuk informasi lebih lanjut tentang memperluas profil yang ada.
ka: თუ შემოთავაზებული პროფილების ნაკრები არ არის საკმარისი, ადმინისტრატორს შეუძლია შექმნას მორგებული პროფილი სპეციალურ საქაღალდეში ({AUTHSELECT_CUSTOM_DIR}). ამის გაკეთებისთანავე, პროფილი მყისიერად გამოსაყენებელი გახდება authselect-ისთვის. იხილეთ _authselect-profiles(5) დამატებითი ინფორმაციისთვის არსებული პროფილების გაფართოების შესახებ.
pt_br: Se o conjunto de perfis disponível não é suficiente, o administrador pode criar um perfil customizado colocando-o em diretório especial ({AUTHSELECT_CUSTOM_DIR}). Ao fazê-lo, o perfil torna-se imediatamente usável pelo *authselect* Veja _authselect-profiles(5)_ para mais informações sobre a extensão de perfis existentes.

source: OPT-IN TO AUTHSELECT
ca: OPTAR PER AUTHSELECT
es: OPT-IN A AUTHSELECT
fi: OLE MUKANA AUTHSELECTIIN
id: IKUT SERA (OPT-IN) KE AUTHSELECT
ka: AUTHSELECT-ის გამოწერა
pt_br: ATIVAR O AUTHSELECT

source: Authselect will not touch your existing configuration unless it has already been created by it. If you want to start using authselect to configure your system authentication, please call *authselect select* with *--force* parameter first (e.g. *authselect select sssd --force*). The *--force* parameter tells authselect that it is all right to overwrite existing non-authselect configuration (see description below). Using the *--force* parameter will automatically generate a backup of your current configuration so if you wish to go back you can restore it with *authselect backup-restore* command (see description below).
ca: Authselect no tocarà la vostra configuració existent tret que ja hagi estat creada per ella. Si voleu començar a utilitzar authselect per configurar l'autenticació del vostre sistema, si us plau, crideu primer *authselect select* amb el paràmetre *--force* (p. ex. *authselect select sssd --force*). El paràmetre *--force* indica a authselect que està bé sobreescriure la configuració existent que no sigui d'authselect (vegeu la descripció a continuació). L'ús del paràmetre *--force* generarà automàticament una còpia de seguretat de la vostra configuració actual, de manera que si voleu tornar enrere podeu restaurar-la amb la comanda *authselect backup-restore* (vegeu la descripció a continuació).
es: Authselect no modificará su configuración existente a no ser que la haya creado. Si quiere comenzar a utilizar authselect para configurar la autentificación de su sistema, por favor invoque *authselect select* con el parámetro *--force* primero (ej. *authselect select sssd --force*). El parámetro *--force* dice a authselect que se puede sobrescribir configuraciones ya existentes que no son de authselect (ver descripción debajo). Usar el parámetro *--force* generará automáticamente una copia de seguridad de su configuración actual, así que si desea revertir los cambios puede restaurarla con el comando *authselect backup-restore* (ver descripción debajo).
fi: Authselect ei koske olemassa olevaan kokoonpanon, ellei se ole jo luonut sitä. Jos haluat alkaa käyttää authselectiä järjestelmän todennuksen määrittämiseen, soita 'authselect select' '--force'-parametrilla ensin (esim. 'authselect select sssd --force'). Parametri '--force' kertoo authselectille, että olemassa olevat ei-authselect-kokoonpanot voidaan korvata (katso kuvaus alla). Parametrin '--force' käyttäminen luo automaattisesti varmuuskopion nykyisestä kokoonpanostasi, joten jos haluat palata takaisin, voit palauttaa sen 'authselect backup-restore' -komennolla (katso kuvaus alla).
id: Authselect tidak akan menyentuh konfigurasi Anda yang sudah ada kecuali jika konfigurasi tersebut telah dibuat olehnya. Jika Anda ingin mulai menggunakan authselect untuk mengonfigurasi autentikasi sistem Anda, silakan panggil *authselect select* dengan parameter *--force* terlebih dahulu (misalnya *authselect select sssd --force*). Parameter *--force* memberi tahu authselect bahwa tidak apa-apa untuk menimpa konfigurasi non-authselect yang ada (lihat deskripsi di bawah). Menggunakan parameter *--force* akan secara otomatis menghasilkan cadangan (backup) konfigurasi Anda saat ini, sehingga jika Anda ingin kembali, Anda dapat memulihkannya dengan perintah *authselect backup-restore* (lihat deskripsi di bawah).
ka: Authselect არ შეეხება თქვენს არსებულ კონფიგურაციას, თუ იგი უკვე არაა მისი შექმნილი. თუ გსურთ, დაიწყოთ authselect-ის გამოყენება თქვენი სისტემის ავთენტიკაციის მოსარგებად, გთხოვთ, ჯერ გამოიძახეთ ბრძანება authselect select პარამეტრით --force (მაგ. authselect select sssd --force). --force პარამეტრი ეუბნება authselect-ს, რომ დასაშვებია არსებული, არა-authselect კონფიგურაციის თავზე გადაწერა (იხილეთ აღწერა ქვემოთ). --force პარამეტრის გამოყენება ავტომატურად შექმნის თქვენი მიმდინარე კონფიგურაციის მარქაფს, ასე რომ, თუ დაბრუნება მოგინდებათ, შეგიძლიათ აღადგინოთ იგი authselect backup-restore ბრძანებით (იხილეთ აღწერა ქვემოთ).
pt_br: Authselect não mudará sua configuração atual exceto se for criada por ele. Se você quiser começar a usar o authselect para configurar a autenticação do seu sistema, chame *authselect select* com o parâmetro *--force* antes (i.e. *authselect select sssd --force*) O parâmetro *--force* diz ao authselect que é autorizado sobrescrever configurações existentes e não criadas por ele (veja a descrição abaixo). Usar o parâmetro *--force* vai automaticamente gerar uma cópia da sua configuração corrente para caso você queira retornar a ela, podes restaurá-la com o comando * authselect backup-restore* (veja a descrição abaixo).

source: AVAILABLE COMMANDS
ca: COMANDES DISPONIBLES
es: COMANDOS DISPONIBLES
fi: SAATAVILLA OLEVAT KOMENNOT
id: PERINTAH YANG TERSEDIA
ka: ხელმისაწვდომი ბრძანებები
pt_br: COMANDOS DISPONÍVEIS

source: To list all available commands run *authselect* without any parameters. To print help for the selected command run *authselect COMMAND --help*.
ca: Per llistar totes les comandes disponibles executeu *authselect* sense cap paràmetre. Per imprimir l'ajuda per a la comanda seleccionada executeu *authselect COMMAND --help*.
es: Para obtener una lista de todos los comandos disponibles ejecute *authselect* sin parámetros. Para mostrar ayuda de uno en concreto use *authselect COMANDO --help*.
fi: Luetellaksesi kaikki käytettävissä olevat komennot, suorita 'authselect' ilman parametreja. Tulosta valitun komennon ohje suorittamalla 'authselect KOMENTO --help'.
id: Untuk melihat daftar semua perintah yang tersedia, jalankan *authselect* tanpa parameter apa pun. Untuk mencetak bantuan untuk perintah yang dipilih, jalankan *authselect PERINTAH --help*.
ka: ხელმისაწვდომი ბრძანებების ჩამოსათვლელად "authselect" პარამეტრების გარეშე გაუშვით. სასურველი ბრძანების შესახებ დახმარების გამოსატანად გაუშვით "authselect ბრძანება --help".
pt_br: Pata listar todos os comandos disponíveis execute *authselect* sem parâmetros. Para mostrar ajuda para o comando selecionado execute *authselect COMANDO --help*.

source: *select* profile_id [features] [-f, --force] [-q, --quiet] [-b] [--backup=NAME]
ca: *select* id_perfil [funcionalitats] [-f, --force] [-q, --quiet] [-b] [--backup=NOM]
es: *select* profile_id [opciones] [-f, --force] [-q, --quiet] [-b] [--backup=NOMBRE]
fi: *select* profiilitunnus [ominaisuudet] [-f, --force] [-q, --quiet] [-b] [--backup=NIMI]
id: *select* profile_id [fitur] [-f, --force] [-q, --quiet] [-b] [--backup=NAMA]
ka: *select* პროფილის_id [features] [-f, --force] [-q, --quiet] [-b] [--backup=სახელი]
pt_br: *select* profile_id [features] [-f, --force] [-q, --quiet] [-b] [--backup=NOME]

source: Activate desired profile. See profile description with *show* command, to list profile specific optional features.
ca: Activeu el perfil desitjat. Vegeu la descripció del perfil amb la comanda *show*, per llistar les funcionalitats opcionals específiques del perfil.
es: Activa el perfil. Consulte la descripción del perfil con *show* para ver las características opcionales específicas de ese perfil.
fi: Aktivoi haluamasi profiili. Katso profiilin kuvaus *show*-komennolla listataksesi profiilikohtaisia valinnaisia ominaisuuksia.
id: Mengaktifkan profil yang diinginkan. Lihat deskripsi profil dengan perintah *show*, untuk mencantumkan fitur opsional spesifik profil.
ka: სასურველი პროფილის გააქტიურება. იხილეთ პროფილის აღწერა ბრძანებით "show" პროფილის სპეციფიკური, არასავალდებულო ფუნქციების ჩამოსათვლელად.
pt_br: Ativa o perfil desejado. Veja sua descrição com o comando *show* para listar recursos opcionais específicos do perfil.

source: Write changes even if the previous configuration was not created by authselect but by other tool or by manual changes. This option will automatically backup system files before writing any change unless *--nobackup* option is set.
ca: Escriu els canvis fins i tot si la configuració anterior no va ser creada per authselect sinó per una altra eina o per canvis manuals. Aquesta opció farà automàticament una còpia de seguretat dels fitxers del sistema abans d'escriure qualsevol canvi tret que s'estableixi l'opció *--nobackup*.
es: Realizar los cambios incluso si la configuración anterior no venía de authselect, sino de otra herramienta o de cambios manuales. Se hará automáticamente una copia de seguridad de los archivos de sistema a no ser que se indique la opción *--nobackup*.
fi: Kirjoita muutokset, vaikka edellinen kokoonpano ei olisi luotu authselectillä, vaan muulla työkalulla tai manuaalisilla muutoksilla. Tämä vaihtoehto varmuuskopioi järjestelmätiedostot automaattisesti ennen muutosten kirjoittamista, ellei *--nobackup*-vaihtoehtoa ole asetettu.
id: Menulis perubahan meskipun konfigurasi sebelumnya tidak dibuat oleh authselect melainkan oleh alat lain atau melalui perubahan manual. Opsi ini akan secara otomatis mencadangkan berkas sistem sebelum menulis perubahan apa pun kecuali opsi *--nobackup* ditetapkan.
ka: ცვლილებების ჩაწერა მაშინაც კი, თუ წინა კონფიგურაცია authselect-ის მაგიერ სხვა პროგრამით, ან ხელით იქნა შეცვლილი. ეს პარამეტრი ავტომატურად დაამარქაფებს სისტემურ ფაილებს ცვლილებების შეტანამდე იმ შემთხვევის გარდა, როცა მითითებულია პარამეტრი *--nobackup*.
pt_br: Escreve as mudanças mesmo se a configuração prévia não foi criada pelo authselect, mas por outra ferramenta ou mudanças manuais. Essa opção vai automaticamente fazer backup dos arquivos do sistemas antes de fazer quaisquer mudanças exceto se a opção *--nobackup* for definida.

source: Backup system files before activating the selected profile. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name of the backup. This is a shortcut for *--backup=*.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'activar el perfil seleccionat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom de la còpia de seguretat. Aquesta és una drecera per a *--backup=*.
es: Haz un respaldo de archivos antes de activar el perfil seleccionado. El respaldo será almacenado en {AUTH_SELECT_BACKUP_DIR}/NAME. Se utilizará como nombre una cadena de caracteres única con la hora y día actual de la copia. Esto es un atajo para *--backup=*.
fi: Varmuuskopioi järjestelmätiedostot ennen valitun profiilin aktivointia. Varmuuskopio tallennetaan osoitteeseen {AUTHSELECT_BACKUP_DIR}/NAME. Varmuuskopion nimenä käytetään nykyistä aikaa ainutlaatuisella merkkijonolla. Tämä on pikanäppäin *--backup=*:lle.
id: Mencadangkan berkas sistem sebelum mengaktifkan profil yang dipilih. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama cadangan. Ini adalah pintasan untuk *--backup=*.
ka: დაამარქაფეთ სისტემური ფაილები მონიშნული პროფილის გააქტიურებამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი. ეს მოკლე ვარიანტია პარამეტრისთვის *--backup=*.
pt_br: Faz backup dos arquivos do sistema antes de ativar o perfil selecionado. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. Hora atual com linha única é usada como nome do backup. Esse é um atalho para *--backup=*.

source: *--backup=NAME*
ca: *--backup=NOM*
es: *--backup=NOMBRE*
fi: *--backup=NIMI*
id: *--backup=NAMA*
ka: *--backup=სახელი*
pt_br: *--backup=NOME*

source: Backup system files before activating the selected profile. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name if no value is provided.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'activar el perfil seleccionat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom si no es proporciona cap valor.
es: Haz una respaldo de los archivos de sistema antes de activar el perfil seleccionado. El respaldo será almacenado en {AUTHSELECT_BACKUP_DIR}/NAME. Si no se indica ningún valor se usará la cadena única de día y hora actual.
fi: Varmuuskopioi järjestelmätiedostot ennen valitun profiilin aktivointia. Varmuuskopio tallennetaan osoitteeseen {AUTHSELECT_BACKUP_DIR}/NIMI. Nykyistä aikaa ainutlaatuisella merkkijonolla käytetään nimenä, jos arvoa ei anneta.
id: Mencadangkan berkas sistem sebelum mengaktifkan profil yang dipilih. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama jika tidak ada nilai yang diberikan.
ka: დაამარქაფეთ სისტემური ფაილები არჩეული პროფილის გააქტიურებამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი.
pt_br: Faz backup dos arquivos do sistema antes de ativar o perfil selecionado. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. Hora atual com linha única é usada como nome se nenhum valor for dado.

source: Do not backup system configuration even if *--force* is set.
ca: No facis còpia de seguretat de la configuració del sistema fins i tot si s'estableix *--force*.
es: No hacer copia de seguridad de la configuración de sistema incluso cuando se indica *--force*.
fi: Älä varmuuskopioi järjestelmän kokoonpanoa, vaikka *--force* olisi asetettu.
id: Jangan mencadangkan konfigurasi sistem meskipun *--force* ditetapkan.
ka: სისტემის კონფიგურაციის მარქაფი არ შესრულება მაშინაც კი, თუ მითითებულია "--force".
pt_br: Não faz backup dos arquivos do sistema mesmo se *--forcce* estiver ativa.

source: The command will not print any informational message such as additional profile requirements or backup location. Errors are still being print.
ca: La comanda no imprimirà cap missatge informatiu com ara requisits addicionals del perfil o la ubicació de la còpia de seguretat. Els errors encara s'imprimeixen.
es: El comando no mostrará mensajes de información como requisitos de perfil adicionales o lugar donde se guardan las copias. Los errores seguirán saliendo.
fi: Komento ei tulosta tiedottavaa viestiä kuten profiilin lisävaatimukset tai varmuuskopion sijainti. Virheet tulostetaan edelleen.
id: Perintah tidak akan mencetak pesan informasi apa pun seperti persyaratan profil tambahan atau lokasi cadangan. Kesalahan (errors) tetap dicetak.
ka: ბრძანება არ გამოიტანს არანაირ საინფორმაციო შეტყობინებას, როგორიცაა პროფილის დამატებითი მოთხოვნები, ან მარქაფის მდებარეობა. შეცდომები კვლავ დაიბეჭდება.
pt_br: O comando não mostrará nenhuma mensagem informacional, tal como requisitos adicionais de perfil ou local do backup. Erros ainda estão sendo mostrados.

source: *apply-changes* [-b] [--backup=NAME]
ca: *apply-changes* [-b] [--backup=NOM]
es: *apply-changes* [-b] [--backup=NOMBRE]
fi: *apply-changes* [-b] [--backup=NIMI]
id: *apply-changes* [-b] [--backup=NAMA]
ka: *apply-changes* [-b] [--backup=სახელი]
pt_br: *apply-changes* [-b] [--backup=NOME]

source: Re-apply currently selected profile. If the profile templates were updated this command can be used to regenerate current system configuration in order to apply these changes on the system. This command will only re-apply the changes if the existing configuration is a valid authselect configuration, otherwise an error is returned.
ca: Torna a aplicar el perfil seleccionat actualment. Si les plantilles de perfil s'han actualitzat, aquesta comanda es pot utilitzar per regenerar la configuració actual del sistema per tal d'aplicar aquests canvis al sistema. Aquesta comanda només tornarà a aplicar els canvis si la configuració existent és una configuració d'authselect vàlida; en cas contrari, es retornarà un error.
es: Volver a aplicar el perfil. Se usa para volver a generar la configuración de sistema cuando se ha modificado el perfil. Sólo aplicará los cambios si la configuración actual es una configuración válida de authselect, en caso contrario devolverá error.
fi: Sovella uudelleen tällä hetkellä valittua profiilia. Jos profiilimallit päivitettiin, tätä komentoa voidaan käyttää nykyisen järjestelmäkokoonpanon luomiseen uudelleen, jotta nämä muutokset voidaan ottaa käyttöön järjestelmässä. Tämä komento ottaa muutokset käyttöön uudelleen vain, jos olemassa oleva kokoonpano on kelvollinen authselect-kokoonpano, muuten palautetaan virhe.
id: Menerapkan ulang profil yang saat ini dipilih. Jika templat profil diperbarui, perintah ini dapat digunakan untuk membuat ulang konfigurasi sistem saat ini guna menerapkan perubahan tersebut pada sistem. Perintah ini hanya akan menerapkan ulang perubahan jika konfigurasi yang ada adalah konfigurasi authselect yang valid, jika tidak, kesalahan akan dikembalikan.
ka: ამჟამად არჩეული პროფილის თავიდან გადატარება. თუ პროფილის შაბლონები განახლდა, ეს ბრძანება შეიძლება გამოყენებულ იქნას სისტემის მიმდინარე კონფიგურაციის ხელახლა დასაგენერირებლად, რათა ეს ცვლილებები სისტემაზე აისახოს. ეს ბრძანება ცვლილებებს, მხოლოდ, იმ შემთხვევაში გამოიყენებს, თუ არსებული კონფიგურაცია სწორი authselect-ის კონფიგურაციაა. წინააღმდეგ შემთხვევაში შეცდომა დაბრუნდება.
pt_br: Reaplica o perfil atualmente selecionado. Se os leiautes do perfil foram atualizados esse comando pode ser usado para regenerar a configuração do sistema para permitir a aplicação dessas mudanças no sistemas. Esse comando só reaplicará as modificações se a configuração existente for uma configuração authselect válida. Caso não, um erro é mostrado.
