Repository: authselect/authselect
Catalog: src/man/po/authselect-profiles.5.adoc.*.po
Languages: ca, id, it, ka, pt_br

source: authselect-profiles(5)
it: profili di authselect(5)

source: NAME
ca: NOM
id: NAMA
it: NOME
ka: სახელი
pt_br: NOME

source: authselect-profiles - how to extend authselect profiles.
ca: authselect-profiles - com estendre authselect profiles.
id: authselect-profiles - cara memperluas profil authselect.
it: authselect-profiles - come estendere i profili delle autentiche.
ka: authselect-profiles - როგორ დავამატოთ ფუნქციები authselect-ის პროფილებს.
pt_br: authselect-profiles - como estender perfile do authselect.

source: DESCRIPTION
ca: DESCRIPCIÓ
id: DESKRIPSI
it: DESCRIZIONE
ka: აღწერა
pt_br: DESCRIÇÃO

source: This manual page explains how are authselect profiles organized and how to create new profiles.
ca: Aquesta pàgina del manual explica com s'organitzen els perfils d'authselect i com crear perfils nous.
id: Halaman manual ini menjelaskan bagaimana profil authselect diatur dan cara membuat profil baru.
it: Questa pagina manuale spiega come sono organizzati i profili delle autentiche e come creare nuovi profili.
ka: ეს სახელმძღვანელოს გვერდი აგიხსნით, როგორ ხდება authselect-ის პროფილების ორგანიზაცია და როგორ შექმნათ ახალი პროფილები.
pt_br: Essa página do manual explica como os perfis do authselect são organizados e como criar novos perfis.

source: PROFILE DIRECTORIES
ca: DIRECTORIS DE PERFIL
id: DIREKTORI PROFIL
it: DIRECTORY DEL PROFILO
ka: პროფილის საქაღალდეები
pt_br: DIRETÓRIOS DE PERFIS

source: Profiles can be found in one of three directories.
ca: Els perfils es poden trobar en un dels tres directoris.
id: Profil dapat ditemukan di salah satu dari tiga direktori.
it: I profili possono essere trovati in una delle tre directory.
ka: პროფილები შეგიძლიათ იპოვოთ ერთ-ერთში ამ საქაღალდეებიდან.
pt_br: Perfis podem ser encontrados em um de três diretórios.

source: *{AUTHSELECT_PROFILE_DIR}*
it: *{AUTHSELECT_PROFILO_DIR}*

source: Read-only directory containing profiles shipped together with authselect.
ca: Directori de només lectura que conté perfils enviats juntament amb authselect.
id: Direktori baca-saja (read-only) yang berisi profil yang disertakan bersama dengan authselect.
it: Directory di sola lettura contenente profili spediti insieme ad Authelect.
ka: authselect-თან ერთად გავრცელებული მხოლოდ წაკითხვადი პროფილების შემცველი საქაღალდე.
pt_br: Diretório somente leitura contendo perfis enviados junto com o authselect.

source: Read-only directory for vendor-specific profiles that can override the ones in _default_ directory.
ca: Directori de només lectura per a perfils específics del proveïdor que pot anul·lar els del directori predeterminat.
id: Direktori baca-saja untuk profil khusus vendor yang dapat menimpa profil di direktori _default_.
it: Directory di sola lettura per profili specifici del fornitore che possono sovrascrivere quelli nella directory _default_.
ka: მხოლოდ წაკითხვადი საქაღალდე მომწოდებლის სპეციფიკური პროფილებისთვის, რომლებსაც შეუძლიათ _default_ საქაღალდეში არსებული პროფილების გადაფარვა.
pt_br: Diretório somente leitura para perfis específicos do fornecedor que podem substituir aqueles no diretório _padrão_.

source: *{AUTHSELECT_CUSTOM_DIR}*
it: *{AUTHSELECT_PERSONALIZZATO_DIR}*

source: Place for administrator-defined profiles.
ca: Lloc per a perfils definits per l'administrador.
id: Tempat untuk profil yang ditentukan oleh administrator.
it: Luogo per profili definiti dall'amministratore.
ka: მდებარეობა ადმინისტრატორის მიერ აღწერილი პროფილებისთვის.
pt_br: Local para perfis definidos pelo administrador.

source: PROFILE FILES
ca: FITXERS DE PERFIL
id: BERKAS PROFIL
it: FILES DI PROFILO
ka: პროფილის ფაილები
pt_br: ARQUIVOS DE PERFIL

source: Each profile consists of one or more of these files which provide a mandatory profile description and describe the changes that are done to the system.
ca: Cada perfil consta d'un o més d'aquests fitxers que proporcionen una descripció de perfil obligatòria i descriuen els canvis que es fan al sistema.
id: Setiap profil terdiri dari satu atau lebih berkas berikut yang memberikan deskripsi profil wajib dan menjelaskan perubahan yang dilakukan pada sistem.
it: Ogni profilo è costituito da uno o più di questi file che forniscono una descrizione obbligatoria del profilo e descrivono le modifiche apportate al sistema.
ka: თითოეული პროფილი შედგება ამ ერთი, ან მეტი ფაილისგან, რომლებიც მოგაწვდით აუცილებელ პროფილის აღწერას და აღწერს ცვლილებებს, რომლებიც სისტემაში მოხდება.
pt_br: Cada perfil consiste em um ou mais desses arquivos, que contém uma descrição de perfil mandatória e descreve as mudanças feitas no sistema de arquivos.

source: *README*
it: *LEGGIMI*

source: Description of the profile. The first line must be a name of the profile.
ca: Descripció del perfil. La primera línia ha de ser un nom del perfil.
id: Deskripsi profil. Baris pertama harus berupa nama profil.
it: Descrizione del profilo. La prima riga deve essere un nome del profilo.
ka: პროფილის აღწერა. პირველი ხაზი პროფილის სახელი უნდა იყოს.
pt_br: Descrição do perfil. A primeira linha deve ser o nome do perfil.

source: *system-auth*
ca: *system-aut*
it: *autenticazione-sistema*

source: PAM stack that is included from nearly all individual service configuration files.
ca: Pila PAM que s'inclou des de gairebé tots els fitxers de configuració de servei individuals.
id: Tumpukan PAM yang disertakan dari hampir semua berkas konfigurasi layanan individual.
it: PAM stack incluso da quasi tutti i singoli file di configurazione del servizio.
ka: PAM სტეკი, რომელიც ჩასმულია თითქმის ყველა ინდივიდუალური სერვისის კონფიგურაციის ფაილში.
pt_br: A pilha PAM incluída em quase todos os arquivos de configuração de serviço individuais.

source: *password-auth*, *smartcard-auth*, *fingerprint-auth*
it: *autenticazione-password*, *autenticazione-smartcard*, *autenticazione-impronta-digitale*

source: These PAM stacks are for applications which handle authentication from different types of devices via simultaneously running individual conversations instead of one aggregate conversation.
ca: Aquestes piles de PAM són per a aplicacions que manegen l'autenticació de diferents tipus de dispositius mitjançant l'execució simultània de converses individuals en lloc d'una conversa agregada.
id: Tumpukan PAM ini ditujukan untuk aplikasi yang menangani autentikasi dari berbagai jenis perangkat melalui percakapan individual yang berjalan bersamaan alih-alih satu percakapan agregat.
it: Questi stack PAM sono per applicazioni che gestiscono l'autenticazione da diversi tipi di dispositivi tramite contemporaneamente conversazioni individuali anziché una conversazione aggregata.
ka: ეს PAM სტეკები განკუთვნილია იმ აპლიკაციებისთვის, რომლებიც ავთენტიკაციას სხვადასხვა ტიპის მოწყობილობებიდან ერთდროულად გაშვებული ინდივიდუალური საუბრების მეშვეობით ამუშავებენ, ნაცვლად ერთი აგრეგირებული საუბრისა.
pt_br: Essas pilhas de PAM são para aplicativos que lidam com autenticação de diferentes tipos de dispositivos por meio da execução simultânea de conversas individuais em vez de uma conversa agregada.

source: *postlogin*
it: *postaccesso*

source: The purpose of this PAM stack is to provide a common place for all PAM modules which should be called after the stack configured in system-auth or the other common PAM configuration files. It is included from all individual service configuration files that provide login service with shell or file access. _NOTE: the modules in the postlogin configuration file are executed regardless of the success or failure of the modules in the system-auth configuration file._
ca: El propòsit d'aquesta pila PAM és proporcionar un lloc comú per a tots els mòduls PAM que s'haurien de cridar després de la pila configurada en system-auth o els altres fitxers de configuració PAM comuns. S'inclou des de tots els fitxers de configuració de servei individuals que proporcionen servei d'inici de sessió amb shell o accés a fitxers. _NOTA: els mòduls del fitxer de configuració postlogin s'executen independentment de l'èxit o la fallada dels mòduls del fitxer de configuració system-auth._
id: Tujuan dari tumpukan PAM ini adalah untuk menyediakan tempat umum bagi semua modul PAM yang harus dipanggil setelah tumpukan yang dikonfigurasi dalam system-auth atau berkas konfigurasi PAM umum lainnya. Ini disertakan dari semua berkas konfigurasi layanan individual yang menyediakan layanan login dengan akses shell atau berkas. _CATATAN: modul dalam berkas konfigurasi postlogin dijalankan tanpa memandang keberhasilan atau kegagalan modul dalam berkas konfigurasi system-auth._
it: Lo scopo di questo stack PAM è quello di fornire un luogo comune per tutti i moduli PAM che dovrebbero essere chiamati dopo lo stack configurato in System-Auth o negli altri file di configurazione PAM comuni. È incluso da tutti i singoli file di configurazione del servizio che forniscono un servizio di accesso con Shell o File Access. _Note: i moduli nel file di configurazione postlogin vengono eseguiti indipendentemente dal successo o dal fallimento dei moduli nel file di configurazione System-Auth._
ka: ამ PAM სტეკის მიზანია უზრუნველყოს ერთიანი ადგილი ყველა იმ PAM მოდულისთვის, რომლებიც უნდა გამოიძახონ system-auth-ში ან სხვა საერთო PAM კონფიგურაციის ფაილებში გამართული სტეკის შემდეგ. იგი ჩართულია ყველა ინდივიდუალური სერვისის კონფიგურაციის ფაილში, რომელიც უზრუნველყოფს შესვლის (login) სერვისს შელით (shell) ან ფაილებზე წვდომით. შენიშვნა: postlogin კონფიგურაციის ფაილში არსებული მოდულები სრულდება იმის მიუხედავად, წარმატებით დასრულდა თუ არა system-auth კონფიგურაციის ფაილში არსებული მოდულები._
pt_br: O objetivo desta pilha PAM é fornecer um local comum para todos os módulos PAM que devem ser chamados após a pilha configurada em system-auth ou em outros arquivos de configuração PAM comuns. Ela está incluída em todos os arquivos de configuração de serviço individuais que fornecem serviço de login com acesso a shell ou arquivo. _NOTA: os módulos no arquivo de configuração postlogin são executados independentemente do sucesso ou falha dos módulos no arquivo de configuração system-auth._

source: Name Service Switch configuration file.
ca: Nom del fitxer de configuració del commutador de serveis.
id: Berkas konfigurasi Name Service Switch.
it: File di configurazione del Name Service Switch.
pt_br: Arquivo de configuração do Name Service Switch.

source: Changes to dconf database. The main uses case of this file is to set changes for gnome login screen in order to enable or disable smartcard and fingerprint authentication.
ca: Canvis a la base de dades dconf. El cas d'ús principal d'aquest fitxer és establir canvis per a la pantalla d'inici de sessió del gnome per tal d'habilitar o desactivar l'autenticació de targetes intel·ligents i empremtes digitals.
id: Perubahan pada basis data dconf. Kasus penggunaan utama dari berkas ini adalah untuk menetapkan perubahan pada layar login gnome guna mengaktifkan atau menonaktifkan autentikasi smartcard dan sidik jari.
it: Modifiche al database DCONF. Il caso principale utilizza di questo file è impostare le modifiche per la schermata di accesso GNOME al fine di abilitare o disabilitare l'autenticazione SmartCard e delle impronte digitali.
ka: ცვლილებები dconf მონაცემთა ბაზაში. ამ ფაილის გამოყენების ძირითადი შემთხვევაა gnome-ის შესვლის ეკრანის პარამეტრების შეცვლა, რომ ჩაირთოს, ან გამოირთოს სმარტ ბარათითა და თითის ანაბეჭდით ავთენტიკაცია.
pt_br: Mudanças no banco de dados dconf. O principal uso deste arquivo é definir alterações na tela de login do GNOME para habilitar ou desabilitar a autenticação por cartão inteligente e impressão digital.

source: This file define locks on values set in dconf database.
ca: Aquest fitxer defineix els bloqueigs en els valors establerts a la base de dades dconf.
id: Berkas ini menentukan kunci (locks) pada nilai yang ditetapkan dalam basis data dconf.
it: Questo file definisce i blocchi sui valori impostati nel database dconf.
ka: ეს ფაილი განსაზღვრავს ბლოკებს მნიშვნელობების ნაკრებებზე dconf-ის მონაცემთა ბაზაში.
pt_br: Este arquivo define bloqueios em valores definidos no banco de dados dconf.

source: CONDITIONAL LINES
ca: LÍNIES CONDICIONALS
id: BARIS BERSYARAT
it: LINEE CONDIZIONATE
ka: პირობის ხაზები
pt_br: LINHAS CONDICIONAIS

source: Each of these files serves as a template. A template is a plain text file with optional usage of several operators that can be used to provide some optional profile features.
ca: Cadascun d'aquests fitxers serveix com a plantilla. Una plantilla és un fitxer de text pla amb ús opcional de diversos operadors que es pot utilitzar per proporcionar algunes característiques de perfil opcionals.
id: Setiap berkas ini berfungsi sebagai templat. Templat adalah berkas teks biasa dengan penggunaan opsional dari beberapa operator yang dapat digunakan untuk menyediakan beberapa fitur profil opsional.
it: Ognuno di questi file funge da modello. Un modello è un file di testo semplice con un utilizzo opzionale di diversi operatori che possono essere utilizzati per fornire alcune funzionalità del profilo opzionali.
ka: თითოეული ეს ფაილი ნიმუშად გამოიყენება. ნიმუში უბრალო ტექსტური ფაილია რამდენიმე ოპერატორის არასავალდებულო გამოყენებით, რომელიც შეიძლება, გამოყენებული იქნეს ზოგიერთი არასავალდებულო პროფილის თვისებების მოსაწოდებლად.
pt_br: Cada um desses arquivos serve como um modelo. Um modelo é um arquivo de texto simples com uso opcional de vários operadores que podem ser usados para fornecer alguns recursos de perfil opcionais.

source: *{continue if "feature"}*
it: *{continua se "feature"}*
ka: *{continue if "თვისება"}*
pt_br: *{continue if "recurso"}*

source: Immediately stop processing of the file unless "feature" is defined (the rest of the file content will be removed). If "feature" is defined, the whole line with this operator will be removed and the rest of the template will be processed.
ca: Atura immediatament el processament del fitxer llevat que es defineixi "funcionalitat" (s'eliminarà la resta del contingut del fitxer). Si es defineix "funció", s'eliminarà tota la línia amb aquest operador i es processarà la resta de la plantilla.
id: Segera hentikan pemrosesan berkas kecuali "feature" ditentukan (sisa konten berkas akan dihapus). Jika "feature" ditentukan, seluruh baris dengan operator ini akan dihapus dan sisa templat akan diproses.
it: Interrompere immediatamente l'elaborazione del file a meno che non sia definita "funzione" (il resto del contenuto del file verrà rimosso). Se è definita la "funzione", l'intera linea con questo operatore verrà rimossa e il resto del modello verrà elaborato.
ka: დაუყოვნებლივ შეწყვიტეთ ფაილის დამუშავება, გარდა იმ შემთხვევისა, თუ „ფუნქცია“ აღწერილია (ფაილის დანარჩენი შიგთავსი წაიშლება). თუ „ფუნქცია“ აღწერილია, ამ ოპერატორის შემცველი მთლიანი ხაზი წაიშლება, ხოლო შაბლონის დანარჩენი ნაწილი დამუშავდება.
pt_br: Interrompe imediatamente o processamento do arquivo, a menos que "recurso" seja definido (o restante do conteúdo do arquivo será removido). Se "recurso" for definido, toda a linha com este operador será removida e o restante do modelo será processado.

source: *{stop if "feature"}*
it: *{stop se "feature"}*
ka: *{stop if "თვისება"}*
pt_br: *{stop if "recurso"}*

source: Opposite of "continue if". Immediately stop processing of the file if "feature" is defined (the rest of the file content will be removed). If "feature" is not defined, the whole line with this operator will be removed and the rest of the template will be processed.
ca: Davant de "continuar si". Atura immediatament el processament del fitxer si es defineix "funcionalitat" (s'eliminarà la resta del contingut del fitxer). Si no es defineix "funció", s'eliminarà tota la línia amb aquest operador i es processarà la resta de la plantilla.
id: Kebalikan dari "continue if". Segera hentikan pemrosesan berkas jika "feature" ditentukan (sisa konten berkas akan dihapus). Jika "feature" tidak ditentukan, seluruh baris dengan operator ini akan dihapus dan sisa templat akan diproses.
it: Di fronte a "continua se". Interrompere immediatamente l'elaborazione del file se viene definita "funzione" (il resto del contenuto del file verrà rimosso). Se la "funzione" non è definita, l'intera linea con questo operatore verrà rimossa e il resto del modello verrà elaborato.
ka: „continue-if“-ის საპირისპირო ოპერატორი. ფაილის დამუშავება დაუყოვნებლივ შეწყდება, თუ „ფუნქცია“ აღწერილია (ფაილის დანარჩენი შიგთავსი წაიშლება). თუ „ფუნქცია“ აღწერილი არაა, ამ ოპერატორის შემცველი მთლიანი ხაზი წაიშლება, ხოლო შაბლონის დანარჩენი ნაწილი დამუშავდება.
pt_br: Oposto de "continue if". Interrompe imediatamente o processamento do arquivo se "recurso" estiver definido (o restante do conteúdo do arquivo será removido). Se "recurso" não estiver definido, toda a linha com este operador será removida e o restante do modelo será processado.

source: Include the line where this operator is placed only if "feature" is defined.
ca: Inclou la línia on es col·loca aquest operador només si es defineix «feature».
id: Sertakan baris tempat operator ini diletakkan hanya jika "feature" ditentukan.
it: Includi la linea in cui questo operatore è posizionato solo se è definita "funzione".
ka: ამ ოპერატორის შემცველი ხაზის ჩასმა, მხოლოდ, თუ "ფუნქცია" აღწერილია.
pt_br: Inclui a linha onde este operador é colocado somente se "recurso" estiver definido.

source: Opposite to "include-if". Include the line where this operator is placed only if "feature" is not defined.
ca: Al contrari de «include-if». Inclou la línia on es col·loca aquest operador només si no es defineix «feature».
id: Kebalikan dari "include-if". Sertakan baris tempat operator ini diletakkan hanya jika "feature" tidak ditentukan.
it: Di fronte a "Include-if". Includi la linea in cui questo operatore è posizionato solo se la "funzione" non è definita.
ka: "include-if'-ის საპირისპირო. ჩასვამს ფაილს, სადაც ეს ოპერატორია მოთავსებული, მხოლოდ, თუ "ფუნქცია" აღწერილი არაა.
pt_br: Oposto de "include-if". Inclui a linha onde este operador é colocado somente se "recurso" não estiver definido.

source: *{imply "implied-feature" if "feature"}*
it: *{implica "implied-feature" se "feature"}*
ka: *{imply "implied-feature" if "თვისება"}*
pt_br: *{imply "recurso-implícito" if "recurso"}*

source: Enable feature "implied-feature" if feature "feature" is enabled. The whole line with this operator is removed, thus it is not possible to add anything else around this operator at the same line.
ca: Habilita la característica «implied-feature» si la característica «feature» està activada. S'elimina tota la línia amb aquest operador, de manera que no és possible afegir res més al voltant d'aquest operador a la mateixa línia.
id: Aktifkan fitur "implied-feature" jika fitur "feature" diaktifkan. Seluruh baris dengan operator ini dihapus, sehingga tidak mungkin untuk menambahkan hal lain di sekitar operator ini pada baris yang sama.
it: Abilita la funzionalità "implied-feature" se la funzionalità "feature" è abilitata. L'intera riga con questo operatore viene rimossa, quindi non è possibile aggiungere altro attorno a questo operatore sulla stessa riga.
ka: ფუნქციის „implied-feature“ ჩართვა, თუ ჩართულია ფუნქცია „feature“. ამ ოპერატორის შემცველი მთლიანი ხაზი წაიშლება, შესაბამისად, ამავე ხაზზე სხვა რამის დამატება შეუძლებელია.
pt_br: Habilite o recurso "recurso-implícito" se o recurso "recurso" estiver habilitado. Toda a linha com este operador é removida, portanto, não é possível adicionar mais nada ao redor deste operador na mesma linha.

source: *{if "feature":true|false}*
it: *{se "feature":true|false}*
pt_br: *{if "recurso":true|false}*

source: If "feature" is defined, replace this operator with string "true", otherwise with string "false".
ca: Si es defineix «feature», substituïu aquest operador amb la cadena «true», en cas contrari amb la cadena «false».
id: Jika "feature" ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string "false".
it: Se è definito "feature", sostituire questo operatore con la stringa "true", altrimenti con la stringa "false".
ka: თუ "ფუნქცია" აღწერილია, შეცვალეთ ეს ოპერატორი სტრიქონით "true". წინააღმდეგ შემთხვევაში კი სტრიქონით "false".
pt_br: Se "recurso" estiver definido, substitua este operador pela string "true", caso contrário, pela string "false".

source: *{if "feature":true}*
it: *{se "feature":true}*
pt_br: *{if "recurso":true}*

source: If "feature" is defined, replace this operator with string "true", otherwise with an empty string.
ca: Si es defineix «feature», substituïu aquest operador amb la cadena «true», en cas contrari amb una cadena buida.
id: Jika "feature" ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string kosong.
it: Se è definita "funzione", sostituire questo operatore con stringa "true", altrimenti con una stringa vuota.
ka: თუ "თვისება" აღწერილია, შეცვალეთ ეს ოპერატორი სტრიქონით "true", თუ არა - ცარიელი სტრიქონით.
pt_br: Se "recurso" estiver definido, substitua este operador pela string "true", caso contrário, por uma string vazia.

source: It is also possible to use logical expression in conditional line instead of specifying single feature name. In this case the expression will evaluate to true or false and the conditional operator will act upon the result.
ca: També és possible utilitzar l'expressió lògica en la línia condicional en lloc d'especificar un sol nom de característica. En aquest cas l'expressió s'avaluarà a veritable o fals i l'operador condicional actuarà sobre el resultat.
id: Dimungkinkan juga untuk menggunakan ekspresi logika dalam baris bersyarat alih-alih menentukan satu nama fitur. Dalam hal ini ekspresi akan bernilai benar (true) atau salah (false) dan operator bersyarat akan bertindak berdasarkan hasilnya.
it: È anche possibile utilizzare l'espressione logica nella linea condizionale invece di specificare il nome di singola funzionalità. In questo caso l'espressione valuterà al vero o falso e l'operatore condizionale agirà al risultato.
ka: ასევე შესაძლებელია პირობით ხაზებში ლოგიკური გამოსახულების გამოყენება ერთი კონკრეტული ფუნქციის სახელის მითითების ნაცვლად. ამ შემთხვევაში, გამოსახულება შეფასდება როგორც ჭეშმარიტი (true) ან მცდარი (false) და პირობითი ოპერატორი იმოქმედებს მიღებული შედეგის შესაბამისად.
pt_br: Também é possível usar uma expressão lógica na linha condicional em vez de especificar um único nome de recurso. Nesse caso, a expressão será avaliada como verdadeira ou falsa e o operador condicional atuará de acordo com o resultado.
