Repository: authselect/authselect
Catalog: src/man/po/authselect.8.adoc.*.po
Languages: ca, es, fi, id, ka, pt_br

source: Backup system files before applying changes. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name of the backup. This is a shortcut for *--backup=*.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'aplicar els canvis. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom de la còpia de seguretat. Aquesta és una drecera per a *--backup=*.
es: Respalda archivos del sistema antes de aplicar los cambios. El respaldo se guardara en {AUTHSELECT_BACKUP_DIR}/NAME. La hora y día actual junto con una cadena de caracteres única serán utilizadas como un nombre del respaldo. Esto es un atajo para *--backup=*.
fi: Varmuuskopioi järjestelmätiedostot ennen muutosten käyttöönottoa. Varmuuskopio tallennetaan osoitteeseen {AUTHSELECT_BACKUP_DIR}/NIMI. Varmuuskopion nimenä käytetään nykyistä aikaa ainutlaatuisella merkkijonolla. Tämä on pikanäppäin *--backup=*:lle.
id: Mencadangkan berkas sistem sebelum menerapkan perubahan. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama cadangan. Ini adalah pintasan untuk *--backup=*.
ka: დაამარქაფეთ სისტემური ფაილები ცვლილებების გადატარებამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი. ეს მოკლე ვარიანტია პარამეტრისთვის *--backup=*.
pt_br: Faz backup dos arquivos do sistema antes de aplicar as mudanças. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. Hora atual com linha única é usada como nome do backup. Isso é um atalho para *--backup=*

source: Backup system files before applying changes. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name if no value is provided.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'aplicar els canvis. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom si no es proporciona cap valor.
es: Haz un respaldo de los archivos del sistema antes de aplicar los cambios. Los respaldos serán almacenados en {AUTHSELECT_BACKUP_DIR}/NOMBRE. Si no es proporcionado ningún valor se utilizará el tiempo de hora y día actual.
fi: Varmuuskopioi järjestelmätiedostot ennen muutosten käyttöönottoa. Varmuuskopio tallennetaan osoitteeseen {AUTHSELECT_BACKUP_DIR}/NIMI. Nykyistä aikaa ainutlaatuisella merkkijonolla käytetään nimenä, jos arvoa ei anneta.
id: Mencadangkan berkas sistem sebelum menerapkan perubahan. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama jika tidak ada nilai yang diberikan.
ka: დაამარქაფეთ სისტემური ფაილები ცვლილებების შეტანამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი.
pt_br: Faz backup dos arquivos do sistema antes de aplicar as alterações. O backup será armazenado em {AUTHSELECT_BACKUP_DIR}/NOME. A hora atual com uma string exclusiva será usada como nome se nenhum valor for fornecido.

source: List available profiles.
ca: Llista els perfils disponibles.
es: Enumera perfiles disponibles.
fi: Luettele saattavilla olevat profiilit.
id: Menampilkan daftar profil yang tersedia.
ka: ხელმისაწვდომი პროფილების სია.
pt_br: Lista perfis disponíveis.

source: *list-features* profile_id
ca: *list-features* id_perfil
es: *listado-capacidades* profile_id
fi: *list-features* profiilitunnus
ka: *list-features* პროფილის_id
pt_br: *list-features* id_perfil

source: List all features available in given profile. _Note:_ This will only list the features without any description. Please, read the profile documentation with *show* to see what the features do.
ca: Llista totes les funcionalitats disponibles en el perfil donat. _Nota:_ Això només llistarà les funcionalitats sense cap descripció. Si us plau, llegiu la documentació del perfil amb *show* per veure què fan les funcionalitats.
es: Enumera todas las características disponibles en el perfil proporcionado. _Nota:_ Esto solo listará las habilidades sin ninguna descripción. Lea la documentación del perfil con *show* para ver qué hacen las habilidades.
fi: Listaa kaikki tietyssä profiilissa saatavilla olevat ominaisuudet. _Huomautus:_ Tämä luettelee vain ominaisuudet ilman kuvausta. Ole hyvä ja lue profiilin dokumentaatio *show*:lla nähdäksesi, mitä ominaisuudet tekevät.
id: Daftar semua fitur yang tersedia dalam profil yang diberikan. _Catatan:_ Ini hanya akan mencantumkan fitur tanpa deskripsi apa pun. Harap baca dokumentasi profil dengan *show* untuk melihat apa yang dilakukan fitur tersebut.
ka: მითითებულ პროფილში ხელმისაწვდომი ყველა ფუნქციის ჩამონათვალი. _შენიშვნა_: ეს, მხოლოდ, ჩამოთვლის ფუნქციებს, აღწერის გარეშე. იმისათვის, რომ გაიგოთ, რას აკეთებენ ეს ფუნქციები, წაიკითხეთ პროფილის დოკუმენტაცია ბრძანებით *show*.
pt_br: Lista todos os recursos disponíveis no perfil fornecido. _Observação:_ Isso listará apenas os recursos, sem nenhuma descrição. Leia a documentação do perfil com *mostrar* para ver o que os recursos fazem.

source: *show* profile_id
ca: *show* id_perfil
es: *show* id_perfil
fi: *show* profiilitunnus
ka: *show* პროფილის_id
pt_br: *show* id_perfil

source: Print information about the profile.
ca: Imprimeix informació sobre el perfil.
es: Declara información sobre el perfil.
fi: Tulosta tiedot profiilista.
id: Cetak informasi tentang profil.
ka: ინფორმაციის გამოტანა პროფილის შესახებ.
pt_br: Imprime informações sobre o perfil.

source: *requirements* profile_id [features]
ca: *requirements* id_perfil [funcionalitats]
es: *requirements* id_perfil [características]
fi: *requirements* profiilitunnus [ominaisuudet]
id: *requirements* profile_id [fitur]
ka: *requirements* პროფილის_id [თვისებები]
pt_br: *requirements* id_perfil [recursos]

source: Print information about profile requirements.
ca: Imprimeix informació sobre els requisits del perfil.
es: Mostrar información sobre los requisitos del perfil.
fi: Tulosta tiedot profiilivaatimuksista.
id: Cetak informasi tentang persyaratan profil.
ka: ინფორმაციის გამოტანა პროფილის მოთხოვნების შესახებ.
pt_br: Imprime informações sobre os requisitos do perfil.

source: *current* [-r, --raw]
es: *actual* [-r, --raw]

source: Print information about currently selected profiles. If *--raw* option is specified, the command will print raw parameters as they were passed to *select* command instead of formatted output.
ca: Imprimeix informació sobre els perfils seleccionats actualment. Si s'especifica l'opció *--raw*, la comanda imprimirà paràmetres en cru tal com es van passar a la comanda *select* en lloc de la sortida formatada.
es: Declara información sobre los perfiles seleccionados actualmente. Si está especificada la opción *--raw*, la orden declarará parámetros tal y como se pasaron al comando *select* en lugar de formatear la salida.
fi: Tulosta tiedot valituista profiileista. Jos *--raw* on määritetty, komento tulostaa raakaparametrit sellaisina kuin ne välitettiin *select*-komennolle muotoillun tulosteen sijaan.
id: Cetak informasi tentang profil yang saat ini dipilih. Jika opsi *--raw* ditentukan, perintah akan mencetak parameter mentah seperti saat diteruskan ke perintah *select* alih-alih keluaran terformat.
ka: ინფორმაციის გამოტანა ამჟამად არჩეული პროფილების შესახებ. თუ მითითებულია პარამეტრი --raw, ბრძანება დააფორმატებული გამონატანის ნაცვლად დაბეჭდავს დაუმუშავებელ პარამეტრებს ისე, როგორც ისინი გადაეცა select ბრძანებას.
pt_br: Imprime informações sobre os perfis selecionados no momento. Se a opção *--raw* for especificada, o comando imprimirá os parâmetros brutos conforme foram passados para o comando *select*, em vez da saída formatada.

source: *check*
es: *comprobar*

source: Check if the current configuration is valid (it was either created by *authselect* or there are no leftovers from previous authselect configuration).
ca: Comprova si la configuració actual és vàlida (o bé va ser creada per *authselect* o no hi ha restes de l'anterior configuració d'authselect).
es: Comprobar si la configuración actual es válida (se creó con *authselect* o bien no quedan restos de la configuración de authselect anterior).
fi: Tarkista, onko nykyinen määritys kelvollinen (sen luotiin joko *authselect*-ohjelmalla tai aiemmasta authselect-kokoonpanosta ei ole jäämiä).
id: Periksa apakah konfigurasi saat ini valid (baik yang dibuat oleh *authselect* atau tidak ada sisa dari konfigurasi authselect sebelumnya).
ka: შემოწმება, სწორია თუ არა მიმდინარე კონფიგურაცია (იყო, თუ არა ის შექმნილი "authselect"-ით და ხომ არაა ნარჩენები authselect-ით შექმნილი წინა კონფიგურაციებიდან).
pt_br: Verifica se a configuração atual é válida (foi criada pelo *authselect* ou não há sobras da configuração anterior do authselect).

source: *test* profile_id [options] [features]
ca: *test* id_perfil [opcions] [funcionalitats]
es: *test* profile_id [opciones] [capacidades]
fi: *test* profiilitunnus [valitsimet] [ominaisuudet]
id: *test* profile_id [opsi] [fitur]
ka: *test* პროფილის_id [პარამეტრები] [თვისებები]
pt_br: *test* id_perfil [opções] [recursos]

source: Print content of files generated by *authselect* without actually writing anything to system configuration.
ca: Imprimeix el contingut dels fitxers generats per *authselect* sense escriure res a la configuració del sistema.
es: Mostrar el contenido de los archivos generados por *authselect* sin escribir nada en la configuración del sistema.
fi: Tulosta *authselectin* luomien tiedostojen sisältö kirjoittamatta mitään järjestelmän kokoonpanoon.
id: Cetak konten berkas yang dihasilkan oleh *authselect* tanpa benar-benar menulis apa pun ke konfigurasi sistem.
ka: *authselect*-ის მიერ შექმნილი ფაილების შემცველობის გამოტანა სისტემურ კონფიგურაციაში ცვლილებების შეტანის გარეშე.
pt_br: Imprime o conteúdo dos arquivos gerados por *authselect* sem realmente gravar nada na configuração do sistema.

source: Print content of all files.
ca: Imprimeix el contingut de tots els fitxers.
es: Declara contenido de todos los archivos.
fi: Tulosta kaikkien tiedostojen sisällöt.
id: Cetak konten semua berkas.
ka: ყველა ფაილის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de todos os arquivos.

source: Print nsswitch.conf content.
ca: Imprimeix el contingut de nsswitch.conf.
es: Declara el contenido de nsswitch.conf.
fi: Tulosta nsswitch.conf-sisältö.
id: Cetak konten nsswitch.conf.
ka: nsswitch.conf-ის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de nsswitch.conf.

source: Print system-auth content.
ca: Imprimeix el contingut de system-auth.
es: Declara el contenido de system-auth.
fi: Tulosta järjestelmätodennussisältö.
id: Cetak konten system-auth.
ka: system-auth-ის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de system-auth.

source: Print password-auth content.
ca: Imprimeix el contingut de password-auth.
es: Declara el contenido de password-auth.
fi: Tulosta salasanatodennuksen sisältö.
id: Cetak konten password-auth.
ka: password-auth-ის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de password-auth.

source: Print smartcard-auth content.
ca: Imprimeix el contingut de smartcard-auth.
es: Declara el contenido de smartcard-auth.
fi: Tulosta älykorttitodennuksen sisältö.
id: Cetak konten smartcard-auth.
ka: smartcard-auth-ის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de smartcard-auth.

source: Print fingerprint-auth content.
ca: Imprimeix el contingut de fingerprint-auth.
es: Declara el contenido de fingerprint-auth.
fi: Tulosta sormenjälkitunnistuksen sisältö.
id: Cetak konten fingerprint-auth.
ka: fingerprint-auth-ის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de fingerprint-auth.

source: Print postlogin content.
ca: Imprimeix el contingut de postlogin.
es: Declara el contenido de postlogin.
fi: Tulosta sisäänkirjautumisen jälkeinen sisältö.
id: Cetak konten postlogin.
ka: postlogin-ის შემცველობის ჩვენება.
pt_br: Imprime o conteúdo de postlogin.

source: Print dconf database content.
ca: Imprimeix el contingut de la base de dades de dconf.
es: Declara el contenido de la base de datos dconf.
fi: Tulosta dconf-tietokannan sisältö.
id: Cetak konten basis data dconf.
ka: dconf-ის მონაცემთა ბაზის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de banco de dados de dconf;

source: Print dconf lock content.
ca: Imprimeix el contingut del bloqueig de dconf.
es: Declara el contenido del bloqueo de dconf.
fi: Tulosta dconfin lukituksen sisältö.
id: Cetak konten kunci dconf.
ka: dconf-ის ბლოკის შემცველობის გამოტანა.
pt_br: Imprime o conteúdo de bloqueio de dconf.

source: *enable-feature* feature [-b] [--backup=NAME] [-q, --quiet]
ca: *enable-feature* funcionalitat [-b] [--backup=NOM] [-q, --quiet]
es: Característica *enable-feature* [-b] [--backup=NOMBRE] [-q, --quiet]
fi: *enable-feature* feature [-b] [--backup=NIMI] [-q, --quiet]
id: *enable-feature* fitur [-b] [--backup=NAMA] [-q, --quiet]
ka: *enable-feature* თვისება [-b] [--backup=სახელი] [-q, --quiet]
pt_br: *enable-feature* recurso [-b] [--backup=NOME] [-q, --quiet]

source: Enable feature in the currently selected profile.
ca: Habilita la funcionalitat al perfil seleccionat actualment.
es: Activar la característica en el perfil seleccionado actualmente.
fi: Ota ominaisuus käyttöön nykyisessä valitussa profiilissa.
id: Aktifkan fitur dalam profil yang saat ini dipilih.
ka: თვისების ჩართვა ამჟამად არჩეულ პროფილში.
pt_br: Habilita o recurso no perfil selecionado no momento.

source: Backup system files before enabling feature. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name of the backup. This is a shortcut for *--backup=*.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'habilitar la funcionalitat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom de la còpia de seguretat. Aquesta és una drecera per a *--backup=*.
es: Respalda los archivos del sistema antes de activar la característica. El respaldo se guardara en {AUTHSELECT_BACKUP_DIR}/NAME. La hora y día actual única se utiliza como un nombre del respaldo. Esto es un atajo para *--backup=*.
fi: Varmuuskopioi järjestelmätiedostot ennen ominaisuuden käyttöönottoa. Varmuuskopio tallennetaan osoitteeseen {AUTHSELECT_BACKUP_DIR}/NIMI. Varmuuskopion nimenä käytetään nykyistä aikaa ainutlaatuisella merkkijonolla. Tämä on pikanäppäin *--backup=*:lle.
id: Cadangkan berkas sistem sebelum mengaktifkan fitur. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama cadangan. Ini adalah pintasan untuk *--backup=*.
ka: დაამარქაფეთ სისტემური ფაილები ფუნქციის ჩართვამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი. ეს მოკლე ვარიანტია პარამეტრისთვის *--backup=*.
pt_br: Faz backup dos arquivos do sistema antes de habilitar o recurso. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. A hora atual com uma linha exclusiva é usada como nome do backup. Este é um atalho para *--backup=*.

source: Backup system files before enabling feature. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name if no value is provided.
ca: Feu una còpia de seguretat dels fitxers del sistema abans d'habilitar la funcionalitat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom si no es proporciona cap valor.
es: Respalda archivos del sistema antes de activar característica. El respaldo será almacenado en {AUTHSELECT_BACKUP_DIR}/NAME. La hora y día actual con cadena única es utilizada como un nombre si no se proporciona ningún valor.
fi: Varmuuskopioi järjestelmätiedostot ennen ominaisuuden käyttöönottoa. Varmuuskopio tallennetaan {AUTHSELECT_BACKUP_DIR}/NIMI:in. Nykyistä aikaa ainutlaatuisella merkkijonolla käytetään nimenä, jos arvoa ei anneta.
id: Cadangkan berkas sistem sebelum mengaktifkan fitur. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama jika tidak ada nilai yang diberikan.
ka: დაამარქაფეთ სისტემური ფაილები თვისების ჩართვამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ მნიშვნელობას არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო უნიკალური სტრიქონით.
pt_br: Faz backup dos arquivos do sistema antes de habilitar o recurso. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. A hora atual com uma linha exclusiva é usada como nome se nenhum valor for fornecido.

source: *disable-feature* feature [-b] [--backup=NAME]
ca: *disable-feature* funcionalitat [-b] [--backup=NOM]
es: característica *disable-feature* [-b] [--backup=NOMBRE]
fi: *disable-feature* ominaisuus [-b] [--backup=NIMI]
id: *disable-feature* fitur [-b] [--backup=NAMA]
ka: *disable-feature* თვისება [-b] [--backup=სახელი]
pt_br: *disable-feature* recurso [-b] [--backup=NOME]

source: Disable feature in the currently selected profile.
ca: Deshabilita la funcionalitat al perfil seleccionat actualment.
es: Desactivar la característica en el perfil seleccionado actualmente.
fi: Poista ominaisuus käytöstä nykyisessä valitussa profiilissa.
id: Nonaktifkan fitur dalam profil yang saat ini dipilih.
ka: თვისების გამორთვა ამჟამად არჩეულ პროფილში.
pt_br: Desabilita o recurso no perfil selecionado no momento.

source: Backup system files before disabling feature. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name of the backup. This is a shortcut for *--backup=*.
ca: Feu una còpia de seguretat dels fitxers del sistema abans de deshabilitar la funcionalitat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom de la còpia de seguretat. Aquesta és una drecera per a *--backup=*.
es: Respalda archivos del sistema antes de desactivar característica. El respaldo será almacenado en {AUTH_SELECT_BACKUP_DIR}/NAME. La hora y día actual junto con una cadena de caracteres única serán usadas como nombre del respaldo. Esto es un atajo para *--backup=*.
fi: Varmuuskopioi järjestelmätiedostot ennen ominaisuuden poistamista käytöstä. Varmuuskopio tallennetaan {AUTHSELECT_BACKUP_DIR}/NIMI:in. Varmuuskopion nimenä käytetään nykyistä aikaa ainutlaatuisella merkkijonolla. Tämä on pikanäppäin *--backup=*:lle.
id: Cadangkan berkas sistem sebelum menonaktifkan fitur. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama cadangan. Ini adalah pintasan untuk *--backup=*.
ka: დაამარქაფეთ სისტემური ფაილები ფუნქციის გამორთვამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო და უნიკალური სტრიქონი. ეს მოკლე ვარიანტია პარამეტრისთვის *--backup=*.
pt_br: Faz backup dos arquivos do sistema antes de desabilitar o recurso. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. A hora atual com uma linha exclusiva é usada como nome do backup. Este é um atalho para *--backup=*.

source: Backup system files before disabling feature. The backup will be stored at {AUTHSELECT_BACKUP_DIR}/NAME. Current time with unique string is used as a name if no value is provided.
ca: Feu una còpia de seguretat dels fitxers del sistema abans de deshabilitar la funcionalitat. La còpia de seguretat s'emmagatzemarà a {AUTHSELECT_BACKUP_DIR}/NOM. L'hora actual amb una cadena única s'utilitza com a nom si no es proporciona cap valor.
es: Respalda los archivos de sistema antes de desactivar el perfil. El respaldo será almacenado en {AUTHSELECT_BACKUP_DIR}/NOMBRE. Se utiliza la hora y día con la cadena única como un nombre si no se proporciona ningún valor.
fi: Varmuuskopioi järjestelmätiedostot ennen ominaisuuden poistamista käytöstä. Varmuuskopio tallennetaan {AUTHSELECT_BACKUP_DIR}/NIMI:in. Nykyistä aikaa ainutlaatuisella merkkijonolla käytetään nimenä, jos arvoa ei anneta.
id: Cadangkan berkas sistem sebelum menonaktifkan fitur. Cadangan akan disimpan di {AUTHSELECT_BACKUP_DIR}/NAMA. Waktu saat ini dengan string unik digunakan sebagai nama jika tidak ada nilai yang diberikan.
ka: დაამარქაფეთ სისტემური ფაილები თვისების გამორთვამდე. მარქაფი შენახული იქნება საქაღალდეში {AUTHSELECT_BACKUP_DIR}/სახელი. თუ მნიშვნელობას არ მიუთითებთ, სახელად გამოყენებული იქნება მიმდინარე დრო უნიკალური სტრიქონით.
pt_br: Faz backup dos arquivos do sistema antes de desabilitar o recurso. O backup será guardado em {AUTHSELECT_BACKUP_DIR}/NOME. A hora atual com uma linha exclusiva é usada como nome se nenhum valor for fornecido.

source: *create-profile* NAME [--vendor,-v] [options]
ca: *create-profile* NOM [--vendor,-v] [opcions]
es: *create-profile* NOMBRE [--custom,-c|--vendor,-v] [opciones]
fi: *create-profile* NIMI [-v, --vendor] [valitsimet]
id: *create-profile* NAMA [--vendor,-v] [opsi]
ka: *create-profile* სახელი [--vendor,-v] [პარამეტრები]
pt_br: *create-profile* NOME [--vendor,-v] [opções]

source: Create a new custom profile named _NAME_. The profile can be based on an existing profile in which case the new profile templates are either copied from the base profile or symbolic links to these files are created if such option is selected.
ca: Crea un nou perfil personalitzat anomenat _NOM_. El perfil es pot basar en un perfil existent; en aquest cas, les noves plantilles de perfil es copien del perfil base o es creen enllaços simbòlics a aquests fitxers si se selecciona aquesta opció.
es: Crear un nuevo perfil de nombre _NOMBRE_. Se puede basar en uno existente, en cuyo caso las plantillas se copian del original o se enlazan al mismo si así se indica.
fi: Luo uusi muokattu profiili nimeltä _NIMI_. Profiili voi perustua olemassa olevaan profiiliin, jolloin uudet profiilimallipohjat joko kopioidaan perusprofiilista tai luodaan symbolisia linkkejä näihin tiedostoihin, jos tällainen valitsin valitaan.
id: Buat profil kustom baru bernama _NAMA_. Profil dapat didasarkan pada profil yang sudah ada di mana templat profil baru disalin dari profil dasar atau tautan simbolik ke berkas-berkas ini dibuat jika opsi tersebut dipilih.
ka: ახალი მორგებული პროფილის შექმნა სახელით _სახელი_. პროფილი, შეიძლება, დაეფუძნოს არსებულ პროფილს; ამ შემთხვევაში, ახალი პროფილის შაბლონები ან კოპირდება საბაზისო პროფილიდან, ან იქმნება ამ ფაილების სიმბმულები, თუ შესაბამისი პარამეტრი იქნება არჩეული.
pt_br: Cria um novo perfil personalizado chamado _NOME_. O perfil pode ser baseado em um perfil existente, caso em que os novos modelos de perfil serão copiados do perfil base ou links simbólicos para esses arquivos serão criados, se essa opção for selecionada.
