Repository: authselect/authselect
Catalog: src/man/po/authselect.8.adoc.*.po
Languages: ca, es, fi, id, ka, pt_br

source: The new profile is a vendor profile instead of a custom profile. See _authselect-profiles(5)_ for more information on profile types.
ca: El nou perfil és un perfil de proveïdor en lloc d'un perfil personalitzat. Vegeu _authselect-profiles(5)_ per obtenir més informació sobre els tipus de perfil.
es: El perfil nuevo es un perfil de proveedor en lugar de uno personal. Consulte _authselect-profiles(5)_ para obtener más información sobre los tipos de perfiles.
fi: Uusi profiili on toimittajaprofiili mukautetun profiilin sijaan. Katso _authselect-profiles(5)_ saadaksesi lisätietoja profiilityypeistä.
id: Profil baru adalah profil vendor alih-alih profil kustom. Lihat _authselect-profiles(5)_ untuk informasi lebih lanjut tentang tipe profil.
ka: ახალი პროფილი მორგებული პროფილის მაგიერ მომწოდებლის პროფილია. პროფილის ტიპების შესახებ მეტი ინფორმაციისთვის იხილეთ _authselect-profiles(5)_.
pt_br: O novo perfil é um perfil de fornecedor em vez de um perfil personalizado. Consulte _authselect-profiles(5)_ para obter mais informações sobre os tipos de perfil.

source: *--base-on=BASE-ID, -b=BASE-ID*
ca: *--base-on=ID-BASE, -b=ID-BASE*
es: *--base-on=ID-BASE, -b=ID-BASE*
fi: *--base-on=PERUSTUNNUS, -b=PERUSTUNNUS*
pt_br: *--base-on=ID-BASE, -b=ID-BASE*

source: The new profile will be based on a profile named _BASE-ID_. The base profile location is determined with these steps:
ca: El nou perfil es basarà en un perfil anomenat _ID-BASE_. La ubicació del perfil base es determina amb aquests passos:
es: El perfil nuevo utilizará el de nombre _ID-BASE_ como base. El perfil original se obtiene siguiendo este orden:
fi: Uusi profiili perustuu profiiliin nimeltä _PERUSTUNNUS_. Perusprofiilin sijainti määritetään seuraavilla vaiheilla:
id: Profil baru akan didasarkan pada profil bernama _BASE-ID_. Lokasi profil dasar ditentukan dengan langkah-langkah berikut:
ka: ახალი პროფილი ბაზირებული იქნება პროფილზე სახელით _საბაზისო-ID_. საბაზისო პროფილის მდებარეობის განსაზღვრა ხდება შემდეგი ნაბიჯებით:
pt_br: O novo perfil será baseado em um perfil denominado _ID-BASE_. O local do perfil base é determinada através das seguintes etapas:

source: If _BASE-ID_ starts with prefix _custom/_ it is a custom profile.
ca: Si _ID-BASE_ comença amb el prefix _custom/_ és un perfil personalitzat.
es: Si ID-BASE comienza por _custom/_, se trata de un perfil personalizado.
fi: Jos _PERUSTUNNUS_ alkaa etuliitteellä _custom/_, se on mukautettu profiili.
id: Jika _BASE-ID_ dimulai dengan awalan _custom/_ maka itu adalah profil kustom.
ka: თუ _საბაზისო-ID_ იწყება პრეფიქსით_custom/_ , ის მომხმარებლის პროფილია.
pt_br: Se _ID-BASE_ começar com o prefixo _custom/_, é um perfil personalizado.

source: Try if _BASE-ID_ is found in vendor profiles.
ca: Prova si _ID-BASE_ es troba als perfils de proveïdor.
es: Se busca ID-BASE en los perfiles del proveedor.
fi: Kokeile löytyykö _PERUSTUNNUS_ toimittajaprofiileista.
id: Coba jika _BASE-ID_ ditemukan di profil vendor.
ka: ცდა, არის თუ არა თუ_საბაზისო-ID_აღმოჩენილია მომწოდებლის პროფილებში.
pt_br: Verifica se _ID-BASE_ é encontrado nos perfis dos fornecedores.

source: Try if _BASE-ID_ is found in default profiles.
ca: Prova si _ID-BASE_ es troba als perfils per defecte.
es: Se busca ID-BASE en los perfiles predeterminados.
fi: Kokeile löytyykö _PERUSTUNNUS_ oletusprofiileista.
id: Coba jika _BASE-ID_ ditemukan di profil bawaan (default).
ka: ცდა, არის თუ არა თუ_საბაზისო_id_არის აღმოჩენილი ნაგულისხმევ პროფილებში.
pt_br: Verifica se _ID-BASE_ é encontrado nos perfis padrões.

source: Return an error.
ca: Retorna un error.
es: Devuelve un error.
fi: Palautti virheen.
id: Kembalikan galat (error).
ka: შეცდომის დაბრუნება.
pt_br: Retorna um erro.

source: The base profile is a default profile even if it is found also within vendor profiles.
ca: El perfil base és un perfil per defecte fins i tot si es troba també dins dels perfils de proveïdor.
es: Usar de base un perfil predeterminado incluso si se encuentra también entre los del proveedor.
fi: Perusprofiili on oletusprofiili, vaikka se löytyisi myös toimittajaprofiileista.
id: Profil dasar adalah profil bawaan (default) meskipun ditemukan juga di dalam profil vendor.
ka: საბაზისო პროფილი ნაგულისხმევი პროფილია მაშინაც კი, თუ ის ასევე არსებობს მომწოდებლის პროფილებში.
pt_br: O perfil base é um perfil padrão, mesmo que também seja encontrado em perfis de fornecedores.

source: Meta files, such as _README_ and _REQUIREMENTS_ will be symbolic links to the origin profile files instead of their copy.
ca: Els fitxers meta, com ara _README_ i _REQUIREMENTS_ seran enllaços simbòlics als fitxers del perfil original en lloc de la seva còpia.
es: Los archivos informativos (como _README_ y _REQUIREMENTS_) serán enaces simbólicos a los del perfil original en lugar de una copia.
fi: Metatiedostot, kuten _README_ ja _REQUIREMENTS_, ovat symbolisia linkkejä alkuperäprofiilitiedostoihin niiden kopion sijaan.
id: Berkas meta, seperti _README_ dan _REQUIREMENTS_ akan berupa tautan simbolik ke berkas profil asal alih-alih salinannya.
ka: მეტაფაილები, როგორიცაა _README_ და _REQUIREMENTS_, სიმბმულები იქნება წყარო პროფილთან და არა მათი ასლი.
pt_br: Meta-arquivos, como _README_ e _REQUIREMENTS_, serão links simbólicos para os arquivos de perfil de origem, em vez de suas cópias.

source: _nsswitch.conf_ template will be symbolic link to the origin profile file instead of its copy.
ca: La plantilla _nsswitch.conf_ serà un enllaç simbòlic al fitxer del perfil original en lloc de la seva còpia.
es: La plantilla _nsswitch.conf_ será un enlace a la del perfil original en lugar de una copia.
fi: _nsswitch.conf_-malli on symbolinen linkki alkuperäprofiilitiedostoon sen kopion sijaan.
id: Templat _nsswitch.conf_ akan menjadi tautan simbolik ke berkas profil asal alih-alih salinannya.
ka: ნიმუში _nsswitch.conf_ წყარო პროფილამდე სიმბმული იქნება მისი ასლის შექმნის მაგიერ.
pt_br: O modelo _nsswitch.conf_ será um link simbólico para o arquivo de perfil de origem em vez de sua cópia.

source: _PAM_ templates will be symbolic links to the origin profile files instead of their copy.
ca: Les plantilles _PAM_ seran enllaços simbòlics als fitxers del perfil original en lloc de la seva còpia.
es: Las plantillas _PAM_ serán enlaces a las del perfil original en lugar de copias.
fi: _PAM_-mallit ovat symbolisia linkkejä alkuperäprofiilitiedostoihin kopioiden sijaan.
id: Templat _PAM_ akan menjadi tautan simbolik ke berkas profil asal alih-alih salinannya.
ka: _PAM_ ნიმუშები სიმბმული იქნება წყარო პროფილის ფაილებამდე მათი ასლის შექმნის მაგიერ.
pt_br: Os modelos _PAM_ serão links simbólicos para os arquivos de perfil de origem em vez de suas cópias.

source: _dconf_ templates will be symbolic links to the origin profile files instead of their copy.
ca: Les plantilles _dconf_ seran enllaços simbòlics als fitxers del perfil original en lloc de la seva còpia.
es: Las plantillas _dconf_ serán enlaces a las del perfil original en lugar de copias.
fi: _dconf_-mallit ovat symbolisia linkkejä alkuperäprofiilitiedostoihin niiden kopion sijaan.
id: Templat _dconf_ akan menjadi tautan simbolik ke berkas profil asal alih-alih salinannya.
ka: _dconf_ ნიმუშები სიმბმული იქნება წყარო ფაილებამდე მათი ასლის შექმნის მაგიერ.
pt_br: Os modelos _dconf_ serão links simbólicos para os arquivos de perfil de origem em vez de suas cópias.

source: *--symlink=FILE,-s=FILE*
ca: *--symlink=FITXER,-s=FITXER*
es: *--symlink=ARCHIVO,-s=ARCHIVO*
fi: *--symlink=TIEDOSTO,-s=TIEDOSTO*
pt_br: *--symlink=ARQUIVO,-s=ARQUIVO*

source: Create a symbolic link for a template file _FILE_ instead of creating its copy. This option can be passed multiple times.
ca: Crea un enllaç simbòlic per a un fitxer de plantilla _FITXER_ en lloc de crear la seva còpia. Aquesta opció es pot passar diverses vegades.
es: Crea un enlace simbólico para un archivo plantilla _FILE_ en vez de crear su copia. Esta opción se puede incluir varias veces.
fi: Luo symbolinen linkki mallitiedostolle _TIEDOSTO_ sen kopion luomisen sijaan. Tämä vaihtoehto voidaan ohittaa useita kertoja.
id: Buat tautan simbolik untuk berkas templat _FILE_ alih-alih membuat salinannya. Opsi ini dapat diberikan beberapa kali.
ka: სიმბმულის შექმნა ნიმუშის ფაილისთვის _FILE_ მისი ასლის შექმნის მაგიერ. ეს პარამეტრი ერთზე მეტჯერაც შეგიძლიათ, გამოიყენოთ.
pt_br: Cria um link simbólico para um arquivo de modelo _FILE_ em vez de criar sua cópia. Esta opção pode ser passada várias vezes.

source: BACKUP COMMANDS
ca: COMANDES DE CÒPIA DE SEGURETAT
es: ORDENES DE RESPALDO
fi: VARMUUSKOMENNOT
id: PERINTAH CADANGAN (BACKUP)
ka: მარქაფის ბრძანებები
pt_br: COMANDOS DE BACKUP

source: These commands can be used to manage backed up configurations.
ca: Aquestes comandes es poden utilitzar per gestionar configuracions amb còpia de seguretat.
es: Estas órdenes pueden ser utilizadas para gestionar configuraciones de respaldo.
fi: Näitä komentoja voidaan käyttää varmuuskopioitujen kokoonpanojen hallintaan.
id: Perintah-perintah ini dapat digunakan untuk mengelola konfigurasi yang dicadangkan.
ka: დამარქაფებული კონფიგურაციების სამართავად ეს ბრძანებები შეგიძლიათ, გამოიყენოთ.
pt_br: Esses comandos podem ser usados para gerenciar configurações de backup.

source: *backup-list* [-r, --raw]
es: *listado-respaldo* [-r, --raw]

source: Print available backups. If *--raw* option is specified, the command will print only backup names without any formatting and additional information.
ca: Imprimeix les còpies de seguretat disponibles. Si s'especifica l'opció *--raw*, la comanda només imprimirà els noms de les còpies de seguretat sense cap format ni informació addicional.
es: Declara respaldos disponibles. Si está especificada la opción *--raw*, la orden declarará solo nombres de respaldo sin ningún formato e información adicional.
fi: Tulosta saatavilla olevat varmuuskopiot. Jos *--raw* on määritetty, komento tulostaa vain varmuuskopioiden nimet ilman muotoiluja ja lisätietoja.
id: Cetak cadangan yang tersedia. Jika opsi *--raw* ditentukan, perintah hanya akan mencetak nama cadangan tanpa pemformatan dan informasi tambahan apa pun.
ka: ხელმისაწვდომი მარქაფების გამოტანა. თუ მითითებულია პარამეტრი "--raw", ბრძანება მარქაფების, მხოლოდ, სახელებს გამოიტანს, დაფორმატებისა და დამატებითი ინფორმაციის გარეშე.
pt_br: Imprime os backups disponíveis. Se a opção *--raw* for especificada, o comando imprimirá apenas os nomes dos backups, sem qualquer formatação ou informação adicional.

source: *backup-remove* BACKUP
ca: *backup-remove* CÒPIA_SEGURETAT
es: *backup-remove* RESPALDO
fi: *backup-remove* VARMUUSKOPIO
ka: *backup-remove* მარქაფი

source: Permanently delete backup named _BACKUP_.
ca: Suprimeix permanentment la còpia de seguretat anomenada _CÒPIA_SEGURETAT_.
es: Borra permanentemente respaldos con el nombre _RESPALDO_.
fi: Poista pysyvästi varmuuskopio nimeltä _VARMUUSKOPIO_.
id: Hapus cadangan bernama _BACKUP_ secara permanen.
ka: _BACKUP_სახელის მქონე მარქაფის შეუქცევადად წაშლა.
pt_br: Exclui permanentemente o backup chamado _BACKUP_.

source: *backup-restore* BACKUP
ca: *backup-restore* CÒPIA_SEGURETAT
es: *backup-restore* RESPALDO
fi: *backup-restore* VARMUUSKOPIO
ka: *backup-restore* მარქაფი

source: Restore configuration from backup named _BACKUP_. *Note:* this will overwrite current configuration.
ca: Restaura la configuració des de la còpia de seguretat anomenada _CÒPIA_SEGURETAT_. *Nota:* això sobreescriurà la configuració actual.
es: Configuración de respaldo desde respaldo nombrado coo _RESPALDO_. *Nota:* esto sobrescribirá la configuración actual.
fi: Palauta määritykset varmuuskopiosta nimeltä _VARMUUSKOPIO_. *Huomaa:* tämä korvaa nykyisen kokoonpanon.
id: Pulihkan konfigurasi dari cadangan bernama _BACKUP_. *Catatan:* ini akan menimpa konfigurasi saat ini.
ka: კონფიგურაციის აღდგენა მარქაფიდან სახელით _BACKUP_. *შენიშვნა* ეს მიმდინარე კონფიგურაციას თავზე გადააწერს.
pt_br: Restaura a configuração do backup chamado _BACKUP_. *Observação:* isso substituirá a configuração atual.

source: COMMON OPTIONS
ca: OPCIONS COMUNES
es: OPCIONES COMUNES
fi: YLEISET VAIHTOEHDOT
id: OPSI UMUM
ka: საერთო პარამეტრები
pt_br: OPÇÕES COMUNS

source: These options are available with all commands.
ca: Aquestes opcions estan disponibles amb totes les comandes.
es: Estas opciones están disponibles para todos los comandos.
fi: Nämä vaihtoehdot ovat käytettävissä kaikkien komentojen kanssa.
id: Opsi-opsi ini tersedia untuk semua perintah.
ka: ეს პარამეტრები ხელმისაწვდომია ყველა ბრძანებისთვის.
pt_br: Essas opções estão disponíveis com todos os comandos.

source: Print debugging information and error messages.
ca: Imprimeix informació de depuració i missatges d'error.
es: Declara información de depuración y mensajes de error.
fi: Tulosta viankorjaustiedot ja virheviestit.
id: Cetak informasi debugging dan pesan galat.
ka: გამართვის ინფორმაციის და შეცდომის შეტყობინებების გამოტანა.
pt_br: Imprime informações de depuração e mensagens de erro.

source: Print information about what the tool is doing.
ca: Imprimeix informació sobre què està fent l'eina.
es: Mostrar qué está haciendo la herramienta.
fi: Tulosta tiedot siitä, mitä työkalu tekee.
id: Cetak informasi tentang apa yang sedang dilakukan oleh alat tersebut.
ka: ინფორმაციის გამოტანა იმის შესახებ, რას აკეთებს ეს პროგრამა.
pt_br: Imprime informações sobre o que a ferramenta está fazendo.

source: Print information about unexpected situations that do not affect the program execution but may indicate some undesired situations (e.g. unexpected file in a profile directory).
ca: Imprimeix informació sobre situacions inesperades que no afecten l'execució del programa però que poden indicar situacions no desitjades (per exemple, un fitxer inesperat en un directori de perfil).
es: Declara información sobre situaciones que no afectan a la ejecución del programa pero pueden indicar algún problema (p.ej., un archivo inesperado en el directorio de perfiles).
fi: Tulosta tietoja odottamattomista tilanteista, jotka eivät vaikuta ohjelman suorittamiseen, mutta voivat viitata joihinkin ei-toivottuihin tilanteisiin (esim. odottamaton tiedosto profiilihakemistossa).
id: Cetak informasi tentang situasi tak terduga yang tidak memengaruhi eksekusi program tetapi mungkin mengindikasikan beberapa situasi yang tidak diinginkan (misalnya berkas tak terduga di direktori profil).
ka: ინფორმაციის გამოტანა მოულოდნელი სიტუაციების შესახებ, რომლებიც გავლენას არ ახდენენ პროგრამის შესრულებაზე, მაგრამ, შესაძლოა, მიუთითებდნენ გარკვეულ არასასურველ გარემოებებზე (მაგ. მოულოდნელი ფაილი პროფილის საქაღალდეში).
pt_br: Imprime informações sobre situações inesperadas que não afetam a execução do programa, mas podem indicar algumas situações indesejadas (por exemplo, arquivo inesperado em um diretório de perfil).

source: NSSWITCH.CONF MANAGEMENT
es: GESTIÓN DE NSSWITCH.CONF
ka: NSSWITCH.CONF-ის მართვა
pt_br: GERENCIAMENTO DE NSSWITCH.CONF

source: Authselect generates {AUTHSELECT_NSSWITCH_CONF} and does not allow any user changes to this file. Such changes are detected and authselect will refuse to write any system configuration unless a *--force* option is provided to the *select* command. This mechanism prevents authselect from overwriting anything that does not match any available profile.
es: Authselect genera {AUTHSELECT_NSSWITCH_CONF} y no permite cambios de ningún usuario en este fichero. Si se hacen cambios se detecta esa circunstancia y authselect no guardará ninguna configuración de sistema si no se usa la opción *--force* en el comando *select*. De esta forma authselect evitará sobrescribir configuraciones que no coincidan con ningún perfil disponible.
ka: Authselect აგენერირებს {AUTHSELECT_NSSWITCH_CONF} ფაილს და არ უშვებს მომხმარებლის მიერ მასში რაიმე ცვლილების შეტანას. ასეთი ცვლილებები აღმოჩენილი იქნება და authselect უარს იტყვის სისტემის ნებისმიერი კონფიგურაციის ჩაწერაზე, თუ select ბრძანებას არ დაემატება პარამეტრი --force. ეს მექანიზმი იცავს სისტემას იმისგან, რომ authselect-მა არ გადააწეროს შიგთავსი ისეთ ფაილს, რომელიც არ შეესაბამება არცერთ ხელმისაწვდომ პროფილს.
pt_br: O Authselect gera {AUTHSELECT_NSSWITCH_CONF} e não permite nenhuma alteração do usuário neste arquivo. Tais alterações são detectadas e o authselect se recusará a gravar qualquer configuração do sistema, a menos que a opção *--force* seja fornecida ao comando *select*. Esse mecanismo impede que o authselect sobrescreva qualquer coisa que não corresponda a nenhum perfil disponível.

source: Any user changes to nsswitch maps must be done in file {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf. When authselect generates new _nsswitch.conf_ it reads this file and combines it with configuration from selected profile. The profile configuration takes always precedence. In other words, profiles do not have to set all nsswitch maps but can set only those that are relevant to the profile. If a map is set within a profile, it always overwrites the same map from _user-nsswitch.conf_.
es: Los cambios de usuario a las asignaciones de nsswitch deben hacerse en el archivo {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf. Cuando authselect genera un _nsswitch.conf_ nuevo, lee ese archivo y lo combina con el del perfil seleccionado. La configuración del perfil siempre tiene prioridad. Los perfiles no necesitan incluir todas las asignaciones, se usarán las que tengan y se podrán recoger otras de _user-nsswitch.conf_.
ka: ნებისმიერი ცვლილება, რომელსაც მომხმარებელი შეიტანს nsswitch-ის ასახვებში, უნდა განხორციელდეს {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf ფაილში. როდესაც authselect აგენერირებს ახალ nsswitch.conf-ს, იგი კითხულობს ამ ფაილს და აერთიანებს მას არჩეული პროფილის კონფიგურაციასთან. პროფილის კონფიგურაციას ყოველთვის აქვს პრიორიტეტი. სხვა სიტყვებით რომ ვთქვათ, პროფილებს არ მოეთხოვებათ ყველა nsswitch map-ის დაყენება, მათ შეუძლიათ დააყენონ მხოლოდ ისინია, რომლებიც პროფილისთვის არის რელევანტური. თუ map განსაზღვრულია პროფილში, იგი ყოველთვის გადააწერს იმავე map-ს user-nsswitch.conf ფაილიდან.
pt_br: Quaisquer alterações do usuário nos mapas nsswitch devem ser feitas no arquivo {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf. Quando o authselect gera um novo _nsswitch.conf_, ele lê este arquivo e o combina com a configuração do perfil selecionado. A configuração do perfil sempre tem precedência. Em outras palavras, os perfis não precisam definir todos os mapas nsswitch, mas podem definir apenas aqueles que são relevantes para o perfil. Se um mapa for definido dentro de um perfil, ele sempre sobrescreve o mesmo mapa de _user-nsswitch.conf_.

source: Example 1
es: Ejemplo 1
ka: მაგალითი 1
pt_br: Exemplo 1

source: # "sssd" profile $ cat {AUTHSELECT_PROFILE_DIR}/sssd/nsswitch.conf passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss {include if "with-sudo"}
es: # perfil "sssd" $ cat {AUTHSELECT_PROFILE_DIR}/sssd/nsswitch.conf passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss {include if "with-sudo"}
ka: # პროფილი "sssd" $ cat {AUTHSELECT_PROFILE_DIR}/sssd/nsswitch.conf passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss {include if "with-sudo"}
pt_br: # Perfil "sssd" $ cat {AUTHSELECT_PROFILE_DIR}/sssd/nsswitch.conf passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss {include if "with-sudo"}

source: $ cat {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf passwd: files sss group: files sss hosts: files dns myhostname sudoers: files
es: $ cat {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf passwd: files sss group: files sss hosts: files dns nombredemiservidor sudoers: files
pt_br: $ cat {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf passwd: files sss group: files sss hosts: files dns nombredemiservidor sudoers: files

source: # passwd and group maps from user-nsswitch.conf are ignored $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files hosts: files dns myhostname sudoers: files
es: # se descartan los datos de user-nsswitch.conf para passwd y group $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files hosts: files dns nombredemiservidor sudoers: files
ka: # პაროლის და ჯგუფის ასახვები ფაილიდან user-nsswitch.conf გამოტოვებულია $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files hosts: files dns myhostname sudoers: files
pt_br: # mapeamentos de passwd e group do user-nsswitch.conf são ignorados $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files hosts: files dns meuhostname sudoers: files

source: # passwd, group and sudoers maps from user-nsswitch.conf are ignored $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss hosts: files dns myhostname
es: # se descartan los datos de user-nsswitch.conf para passwd, group y sudoers $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss hosts: files dns minombredeservidor
ka: # პაროლის, ჯგუფის და sudoers-ის ასახვები ფაილიდან user-nsswitch.conf გამოტოვებულია $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss hosts: files dns myhostname
pt_br: # mapeamentos de passwd, group e sudoers do user-nsswitch.conf são ignorados $ cat {AUTHSELECT_NSSWITCH_CONF} passwd: sss files systemd group: sss files systemd netgroup: sss files automount: sss files services: sss files sudoers: files sss hosts: files dns myhostname

source: TROUBLESHOOTING
ca: RESOLUCIÓ DE PROBLEMES
es: SOLUCIONES
fi: VIANMÄÄRITTÄMINEN
id: PEMECAHAN MASALAH
ka: პრობლემების გადაჭრა
pt_br: RESOLVENDO PROBLEMAS

source: How can I tell if my system is using authselect?
ca: Com puc saber si el meu sistema utilitza authselect?
es: ¿Cómo puede llamar si mi sistema está utilizando authselect?
fi: Kuinka voin selvittää, käyttääkö järjestelmäni authselectiä?
id: Bagaimana saya bisa tahu jika sistem saya menggunakan authselect?
ka: როგორ უნდა გავიგო, იყენებს თუ არა ჩემი სისტემა authselect-ს?
pt_br: Como posso saber se meu sistema está usando authselect?
