Repository: authselect/authselect
Catalog: src/man/po/authselect.8.adoc.*.po
Languages: ca, es, fi, id, ka, pt_br

source: Use *authselect check*. The output will tell you if you have 1) configuration generated by authselect 2) non-authselect configuration or 3) configuration that was generated by authselect but modified manually at some point.
ca: Utilitzeu *authselect check*. La sortida us dirà si teniu 1) configuració generada per authselect 2) configuració que no és d'authselect o 3) configuració generada per authselect però modificada manualment en algun moment.
es: Utilice *authselect check*. La salida le deirá si tiene 1) la configuración generada por authselect 2) configuración no auth-seleccionada o 3) configuración que fue generada por authselect pero modificada manualmente en algún punto.
fi: Käytä *authselect check*:iä. Tulos kertoo, onko sinulla 1) authselectin luoma konfiguraatio 2) ei-authselect-määritys vai 3) konfiguraatio, joka on luotu authselectillä, mutta jota on jossain vaiheessa muokattu manuaalisesti.
id: Gunakan *authselect check*. Outputnya akan memberi tahu Anda jika Anda memiliki 1) konfigurasi yang dihasilkan oleh authselect 2) konfigurasi non-authselect atau 3) konfigurasi yang dihasilkan oleh authselect tetapi dimodifikasi secara manual pada suatu titik.
ka: გამოიყენეთ *authselect check*. გამონატანი გეტყვით, გაქვთ თუ არა 1) authselect-ის მიერ დაგენერირებული კონფიგურაცია 2) არა-authselect კონფიგურაცია ან 3) კონფიგურაცია, რომელიც დაგენერირებული იყო authselect-ის მიერ, მაგრამ რომელიღაც ეტაპზე ხელით შეიცვალა.
pt_br: Use *authselect check*. A saída informará se você tem 1) configuração gerada pelo authselect, 2) configuração não-authselect ou 3) configuração gerada pelo authselect, mas modificada manualmente em algum momento.

source: Is nsswitch.conf supposed to be a symbolic link now?
ca: El fitxer nsswitch.conf ha de ser ara un enllaç simbòlic?
es: ¿Se supone nsswitch.conf sea un enlace simbólico ahora?
fi: Onko nsswitch.conf nyt tarkoitus olla symbolinen linkki?
id: Apakah nsswitch.conf seharusnya menjadi tautan simbolik sekarang?
ka: ახლა nsswitch.conf უკვე სიმბმული უნდა იყოს?
pt_br: O nsswitch.conf deveria ser um link simbólico agora?

source: Authselect generates your system configuration from scratch and stores it at {AUTHSELECT_CONFIG_DIR}. System files are then created as symbolic links to this directory. Symbolic links are used to make it clear that authselect is now owning your configuration and should be used instead of any manual modification.
ca: Authselect genera la configuració del vostre sistema des de zero i l'emmagatzema a {AUTHSELECT_CONFIG_DIR}. Els fitxers del sistema es creen llavors com a enllaços simbòlics a aquest directori. Els enllaços simbòlics s'utilitzen per deixar clar que authselect és ara propietari de la vostra configuració i s'hauria d'utilitzar en lloc de qualsevol modificació manual.
es: Authselect genera su configuración del sistema desde cero y la almacena en {AUTHSELECT_CONFIG_DIR}. Los archivos del sistema entonces se crean como enlaces simbólicos a este directorio. Los enlaces simbólicos se utilizan para hacerlo claro que authselect no está poseyendo su configuración y sería utilizado en su lugar de cualquier modificación manual.
fi: Authselect luo järjestelmäkokoonpanosi alusta alkaen ja tallentaa se {AUTHSELECT_CONFIG_DIR}:iin. Järjestelmätiedostot luodaan sitten symbolisiksi linkeiksi tähän hakemistoon. Symbolisia linkkejä käytetään tekemään selväksi, että authselect omistaa nyt kokoonpanosi ja että sitä tulisi käyttää manuaalisen muutoksen sijaan.
id: Authselect menghasilkan konfigurasi sistem Anda dari nol dan menyimpannya di {AUTHSELECT_CONFIG_DIR}. Berkas sistem kemudian dibuat sebagai tautan simbolik ke direktori ini. Tautan simbolik digunakan untuk memperjelas bahwa authselect sekarang memiliki konfigurasi Anda dan harus digunakan alih-alih modifikasi manual apa pun.
ka: Authselect თქვენი სისტემის კონფიგურაციას ნულიდან აგენერირებს და მას საქაღალდეში {AUTHSELECT_CONFIG_DIR} ინახავს. ამის შემდეგ, სისტემური ფაილები იქმნება, როგორც ამ საქაღალდეზე მიბმული სიმბმულები. სიმბმულები გამოიყენება იმის ხაზგასასმელად, რომ authselect ახლა თავად ფლობს თქვენს კონფიგურაციას და ნებისმიერი ხელით ცვლილების ნაცვლად, სწორედ ის უნდა იქნას გამოყენებული.
pt_br: O authselect gera a configuração do seu sistema do zero e a armazena em {AUTHSELECT_CONFIG_DIR}. Os arquivos do sistema são então criados como links simbólicos para este diretório. Links simbólicos são usados para deixar claro que o authselect agora é o proprietário da sua configuração e deve ser usado em vez de qualquer modificação manual.

source: Error: Unexpected changes to the configuration were detected.
ca: Error: S'han detectat canvis inesperats a la configuració.
es: Error: fueron detectados cambios inesperados en la configuración.
fi: Virhe: Odottamattomia muutoksia kokoonpanoon havaittiin.
id: Galat (Error): Perubahan tak terduga pada konfigurasi terdeteksi.
ka: შეცდომა: აღმოჩენილია კონფიგურაციის მოულოდნელი ცვლილებები.
pt_br: Erro: Mudanças inesperadas na configuração foram detectadas.

source: For example:
ca: Per exemple:
es: Por ejemplo:
fi: Esimerkiksi:
id: Sebagai contoh:
ka: მაგალითად:
pt_br: Por exemplo:

source: [error] [/etc/authselect/nsswitch.conf] does not exist! [error] [/etc/nsswitch.conf] is not a symbolic link! [error] [/etc/nsswitch.conf] was not created by authselect! [error] Unexpected changes to the configuration were detected. [error] Refusing to activate profile unless those changes are removed or overwrite is requested.
ca: [error] [/etc/authselect/nsswitch.conf] no existeix! [error] [/etc/nsswitch.conf] no és un enllaç simbòlic! [error] [/etc/nsswitch.conf] no ha estat creat per authselect! [error] S'han detectat canvis inesperats a la configuració. [error] Es refusa a activar el perfil tret que s'eliminin aquests canvis o se sol·liciti la sobreescriptura.
es: [error] [/etc/authselect/nsswitch.conf] no existe. [error] [/etc/nsswitch.conf] no es un enlace simbólico. [error] [/etc/nsswitch.conf] no fue creado por authselect. [error] Se han detectados cambios inesperados para la configuración. [error] Rechazando activación de perfil a no ser que esos cambios sean solicitados a eliminar o sobrescribir.
fi: [virhe] [/etc/authselect/nsswitch.conf] ei ole olemassa! [virhe] [/etc/nsswitch.conf] ei ole symbolinen linkki! [virhe] [/etc/nsswitch.conf] ei ole luonut authselect! [virhe] Odottamattomia muutoksia kokoonpanoon havaittiin. [virhe] Kieltäydytään aktivoimasta profiilia, ellei näitä muutoksia poisteta tai niitä ei pyydetä korvaamaan.
id: [error] [/etc/authselect/nsswitch.conf] tidak ada! [error] [/etc/nsswitch.conf] bukan tautan simbolik! [error] [/etc/nsswitch.conf] tidak dibuat oleh authselect! [error] Perubahan tak terduga pada konfigurasi terdeteksi. [error] Menolak untuk mengaktifkan profil kecuali perubahan tersebut dihapus atau penimpaan diminta.
ka: [შეცდომა] [/etc/authselect/nsswitch.conf] არ არსებობს! [შეცდომა] [/etc/nsswitch.conf] სიმბმული არაა! [შეცდომა] [/etc/nsswitch.conf] არ შექმნილა authselect-ის მიერ! [შეცდომა] აღმოჩენილია კონფიგურაციის მოულოდნელი ცვლილებები. [შეცდომა] პროფილის გააქტიურება უარყოფილია, სანამ იმ ცვლილებებს არ მოაცილებთ, ან არ მოითხოვთ თავზე გადაწერას.
pt_br: [error] [/etc/authselect/nsswitch.conf] não existe! [error] [/etc/nsswitch.conf] não é um link simbólico! [error] [/etc/nsswitch.conf] não foi criado por authselect! [error] Mudanças inesperadas na configuração foram detectadas. [error] Recusando-se a ativar o perfil, a menos que essas alterações sejam removidas ou sobrescreva-se.

source: This means that your configuration is unknown to authselect and as such it will not be modified. To fix this, please call *authselect select* with *--force* parameter to say that it is all right to overwrite it.
ca: Això significa que la vostra configuració és desconeguda per a authselect i com a tal no es modificarà. Per solucionar-ho, si us plau, crideu *authselect select* amb el paràmetre *--force* per dir que està bé sobreescriure-la.
es: Esto quiere decir que su configuración es desconocida para authselect y por lo tanto no será modificada. Para solucionar esto, invoque *authselect select* con el parámetro *--force* para decir que es correcto sobrescribirlo.
fi: Tämä tarkoittaa, että määrityksiäsi ei tiedetä todentaa varten, joten sitä ei muuteta. Korjataksesi tämän, kutsu *authselect select* *--force*-parametrin kanssa ilmoittaaksesi, että se voidaan korvata.
id: Ini berarti konfigurasi Anda tidak dikenal oleh authselect sehingga tidak akan dimodifikasi. Untuk memperbaikinya, silakan panggil *authselect select* dengan parameter *--force* untuk menyatakan bahwa tidak apa-apa untuk menimpanya.
ka: ეს ნიშნავს, რომ თქვენი კონფიგურაცია უცნობია authselect-ისთვის და ამიტომ, ის არ შეიცვლება. იმისათვის, რომ ეს გაასწოროთ, გაუშვით *authselect select* პარამეტრით --force, რომ უთხრათ, რომ ფაილების თავზე გადაწერა დაშვებულია.
pt_br: Isso significa que sua configuração é desconhecida para authselect e, portanto, não será modificada. Para corrigir isso, chame *authselect select* com o parâmetro *--force* para indicar que não há problema em sobrescrevê-la.

source: RETURN CODES
ca: CODIS DE RETORN
es: CÓDIGOS DEVUELTOS
fi: PALAUTUSKOODIT
id: KODE KEMBALI (RETURN CODES)
ka: დაბრუნების კოდები
pt_br: CÓDIGOS DE RETORNO

source: The *authselect* can return these exit codes:
ca: L'*authselect* pot retornar aquests codis de sortida:
es: El *authselect* puede devolver estos códigos de salida:
fi: *authselect* voi palauttaa nämä poistumiskoodit:
id: *authselect* dapat mengembalikan kode keluar berikut:
ka: "authselect"-მა შეიძლება დააბრუნოს შემდეგი გასვლის კოდები:
pt_br: O *authselect* pode retornar estes códigos de saída:

source: 0: Success.
ca: 0: Èxit.
es: 0: Logrado.
fi: 0: Onnistui.
id: 0: Berhasil.
ka: 0: წარმატება.
pt_br: 0: Sucesso.

source: 1: Generic error.
ca: 1: Error genèric.
es: 1: Error genérico.
fi: 1: Yleinen virhe.
id: 1: Galat umum.
ka: 1: ზოგადი შეცდომა.
pt_br: 1: Erro genérico.

source: 2: Profile or configuration was not found or the system was not configured with authselect.
ca: 2: No s'ha trobat el perfil o la configuració o el sistema no s'ha configurat amb authselect.
es: 2. Perfil o configuración no fue encontrado o el sistema no fue configurado con authselect.
fi: 2: Profiilia tai kokoonpanoa ei löytynyt tai järjestelmää ei ole määritetty authselectin kanssa.
id: 2: Profil atau konfigurasi tidak ditemukan atau sistem tidak dikonfigurasi dengan authselect.
ka: 2: პროფილი, ან კონფიგურაცია აღმოჩენილი არაა, ან სისტემის მორგება authselect-ით არ მომხდარა.
pt_br: 2: Não foi possível encontrar o perfil ou a configuração, ou o sistema não foi configurado com authselect.

source: 3: Current configuration is not valid, it was edited without authselect.
ca: 3: La configuració actual no és vàlida, s'ha editat sense authselect.
es: 3: La configuración actual no es válida, fue editada sin authselect.
fi: 3: Nykyinen kokoonpano ei ole kelvollinen, sitä on muokattu ilman authselectiä.
id: 3: Konfigurasi saat ini tidak valid, ia telah diedit tanpa authselect.
ka: 3: მიმდინარე კონფიგურაცია არასწორია. ის authselect-ის გარეშე იყო ჩასწორებული.
pt_br: 3: A configuração atual não é válida, ela foi editada sem authselect.

source: 4: System configuration must be overwritten to activate an authselect profile, --force parameter is needed.
ca: 4: La configuració del sistema s'ha de sobreescriure per activar un perfil d'authselect, es necessita el paràmetre --force.
es: 4: Se debe sobrescribir la configuración del sistema para activar el perfil de authselect, el parámetro --force es necesario.
fi: 4: Järjestelmän kokoonpano on korvattava, jotta authselect-profiili voidaan aktivoida; '--force'-parametri tarvitaan.
id: 4: Konfigurasi sistem harus ditimpa untuk mengaktifkan profil authselect, parameter --force diperlukan.
ka: 4: authselect-ის პროფილის გასააქტიურებლად სისტემის კონფიგურაციას თავზე უნდა გადავაწერო. საჭიროა პარამეტრი --force.
pt_br: 4: A configuração do sistema deve ser substituída para ativar um perfil authselect, o parâmetro --force é necessário.

source: 5: Executed command must be run as root.
ca: 5: La comanda executada s'ha d'executar com a root.
es: 5: La instrucción ejecutada se debe ejecutar como root.
fi: 5: Suoritettu komento on suoritettava rootina.
id: 5: Perintah yang dieksekusi harus dijalankan sebagai root.
ka: 5: შესრულებული ბრძანება root-ით უნდა გაეშვას.
pt_br: 5: O comando executado deve ser executado como root.

source: GENERATED FILES
ca: FITXERS GENERATS
es: ARCHIVOS GENERADOS
fi: LUODUT TIEDOSTOT
id: BERKAS YANG DIHASILKAN
ka: გენერირებული ფაილები
pt_br: ARQUIVOS GERADOS

source: Authselect creates and maintains the following files to configure system identity and authentication providers properly.
ca: Authselect crea i manté els fitxers següents per configurar correctament la identitat del sistema i els proveïdors d'autenticació.
es: Authselect crea y mantiene los siguientes archivos para configurar la identidad y la autenticación en el sistema.
fi: Authselect luo ja ylläpitää seuraavia tiedostoja määrittääkseen järjestelmän identiteetin ja todennuspalveluntarjoajat oikein.
id: Authselect membuat dan memelihara berkas berikut untuk mengonfigurasi identitas sistem dan penyedia autentikasi dengan benar.
ka: Authselect სისტემის იდენტიფიკაციისა და ავთენტიკაციის მომწოდებლების სწორად მოსარგებად ქმნის და ინახავს შემდეგ ფაილებს.
pt_br: O authselect cria e mantém os seguintes arquivos para configurar corretamente os provedores de identidade e autenticação do sistema.

source: Name Service Switch configuration file.
ca: Nom del fitxer de configuració del commutador de serveis.
es: Archivo de configuración de Intercambio de Servicio de Nombre.
fi: Name Service Switch -määritystiedosto.
id: Berkas konfigurasi Name Service Switch.
ka: სახელის სერვისის გადართვის (NSS) კონფიგურაციის ფაილი.
pt_br: Arquivo de configuração do Name Service Switch.

source: PAM stack that is included from nearly all individual service configuration files.
ca: Pila PAM que s'inclou des de gairebé tots els fitxers de configuració de servei individuals.
es: Pila PAM incluida desde casi todos los archivos de configuración individual de cada servicio.
fi: PAM-pino, joka sisältyy lähes kaikkiin yksittäisiin palvelun kokoonpanotiedostoihin.
id: Tumpukan PAM yang disertakan dari hampir semua berkas konfigurasi layanan individual.
ka: PAM სტეკი, რომელიც ჩასმულია თითქმის ყველა ინდივიდუალური სერვისის კონფიგურაციის ფაილში.
pt_br: A pilha PAM incluída em quase todos os arquivos de configuração de serviço individuais.

source: These PAM stacks are for applications which handle authentication from different types of devices via simultaneously running individual conversations instead of one aggregate conversation.
ca: Aquestes piles de PAM són per a aplicacions que manegen l'autenticació de diferents tipus de dispositius mitjançant l'execució simultània de converses individuals en lloc d'una conversa agregada.
es: Pilas PAM para aplicaciones que gestionan la autenticación desde diferentes tipos de dispositivos mediante conversaciones individuales en lugar de una agregada.
fi: Nämä PAM-pinot on tarkoitettu sovelluksille, jotka käsittelevät todennusta eri tyyppisistä laitteista suorittamalla samanaikaisesti yksittäisiä keskusteluja yhden yhteiskeskustelun sijaan.
id: Tumpukan PAM ini ditujukan untuk aplikasi yang menangani autentikasi dari berbagai jenis perangkat melalui percakapan individual yang berjalan bersamaan alih-alih satu percakapan agregat.
ka: ეს PAM სტეკები განკუთვნილია იმ აპლიკაციებისთვის, რომლებიც ავთენტიკაციას სხვადასხვა ტიპის მოწყობილობებიდან ერთდროულად გაშვებული ინდივიდუალური საუბრების მეშვეობით ამუშავებენ, ნაცვლად ერთი აგრეგირებული საუბრისა.
pt_br: Essas pilhas de PAM são para aplicativos que lidam com autenticação de diferentes tipos de dispositivos por meio da execução simultânea de conversas individuais em vez de uma conversa agregada.

source: The purpose of this PAM stack is to provide a common place for all PAM modules which should be called after the stack configured in system-auth or the other common PAM configuration files. It is included from all individual service configuration files that provide login service with shell or file access. _NOTE: the modules in the postlogin configuration file are executed regardless of the success or failure of the modules in the system-auth configuration file._
ca: El propòsit d'aquesta pila PAM és proporcionar un lloc comú per a tots els mòduls PAM que s'haurien de cridar després de la pila configurada en system-auth o els altres fitxers de configuració PAM comuns. S'inclou des de tots els fitxers de configuració de servei individuals que proporcionen servei d'inici de sessió amb shell o accés a fitxers. _NOTA: els mòduls del fitxer de configuració postlogin s'executen independentment de l'èxit o la fallada dels mòduls del fitxer de configuració system-auth._
es: Esta pila PAM proporciona un lugar común para los módulos a los que se tiene que llamar después de la de system-auth o alguno de los otros comunes. Se incluye en los servicios de entrada al sistema con acceso a intérprete o a archivos. _NOTA: los módulos del archivo postlogin se ejecutan independientemente de que los de system-auth indiquen éxito o no._
fi: Tämän PAM-pinon tarkoitus on tarjota yhteinen paikka kaikille PAM-moduuleille, jotka tulee kutsua system-auth-tiedostossa määritetyn pinon tai muiden yleisten PAM-määritystiedostojen jälkeen. Se sisältyy kaikkiin yksittäisiin palvelun määritystiedostoihin, jotka tarjoavat kirjautumispalvelun komentotulkin tai tiedostojen käyttöoikeuksilla. _HUOMAUTUS: kirjautumisen jälkeisen määritystiedoston moduulit suoritetaan riippumatta siitä, onnistuvatko moduulit system-authin kokoonpanotiedostossa._
id: Tujuan dari tumpukan PAM ini adalah untuk menyediakan tempat umum bagi semua modul PAM yang harus dipanggil setelah tumpukan yang dikonfigurasi dalam system-auth atau berkas konfigurasi PAM umum lainnya. Ini disertakan dari semua berkas konfigurasi layanan individual yang menyediakan layanan login dengan akses shell atau berkas. _CATATAN: modul dalam berkas konfigurasi postlogin dijalankan tanpa memandang keberhasilan atau kegagalan modul dalam berkas konfigurasi system-auth._
ka: ამ PAM სტეკის მიზანია უზრუნველყოს ერთიანი ადგილი ყველა იმ PAM მოდულისთვის, რომლებიც უნდა გამოიძახონ system-auth-ში ან სხვა საერთო PAM კონფიგურაციის ფაილებში გამართული სტეკის შემდეგ. იგი ჩართულია ყველა ინდივიდუალური სერვისის კონფიგურაციის ფაილში, რომელიც უზრუნველყოფს შესვლის (login) სერვისს შელით (shell) ან ფაილებზე წვდომით. შენიშვნა: postlogin კონფიგურაციის ფაილში არსებული მოდულები სრულდება იმის მიუხედავად, წარმატებით დასრულდა თუ არა system-auth კონფიგურაციის ფაილში არსებული მოდულები._
pt_br: O objetivo desta pilha PAM é fornecer um local comum para todos os módulos PAM que devem ser chamados após a pilha configurada em system-auth ou em outros arquivos de configuração PAM comuns. Ela está incluída em todos os arquivos de configuração de serviço individuais que fornecem serviço de login com acesso a shell ou arquivo. _NOTA: os módulos no arquivo de configuração postlogin são executados independentemente do sucesso ou falha dos módulos no arquivo de configuração system-auth._

source: Changes to dconf database. The main uses case of this file is to set changes for gnome login screen in order to enable or disable smartcard and fingerprint authentication.
ca: Canvis a la base de dades dconf. El cas d'ús principal d'aquest fitxer és establir canvis per a la pantalla d'inici de sessió del gnome per tal d'habilitar o desactivar l'autenticació de targetes intel·ligents i empremtes digitals.
es: Cambios en a base de datos dconf. El uso principal sería el de cambiar la pantalla de inicio de sesión de gnome para activar o desactivar la autenticación mediante tarjeta inteligente o lector de huellas.
fi: Muutokset dconf-tietokantaan. Tämän tiedoston pääasiallinen käyttötapa on tehdä muutoksia Gnome-kirjautumisnäytölle, jotta älykortti- ja sormenjälkitunnistus voidaan ottaa käyttöön tai poistaa käytöstä.
id: Perubahan pada basis data dconf. Kasus penggunaan utama dari berkas ini adalah untuk menetapkan perubahan pada layar login gnome guna mengaktifkan atau menonaktifkan autentikasi smartcard dan sidik jari.
ka: ცვლილებები dconf მონაცემთა ბაზაში. ამ ფაილის გამოყენების ძირითადი შემთხვევაა gnome-ის შესვლის ეკრანის პარამეტრების შეცვლა, რომ ჩაირთოს, ან გამოირთოს სმარტ ბარათითა და თითის ანაბეჭდით ავთენტიკაცია.
pt_br: Mudanças no banco de dados dconf. O principal uso deste arquivo é definir alterações na tela de login do GNOME para habilitar ou desabilitar a autenticação por cartão inteligente e impressão digital.

source: This file define locks on values set in dconf database.
ca: Aquest fitxer defineix els bloqueigs en els valors establerts a la base de dades dconf.
es: Este archivo define bloqueos de valores de la base de datos dconf.
fi: Tämä tiedosto määrittää lukot dconf-tietokannassa asetettuihin arvoihin.
id: Berkas ini menentukan kunci (locks) pada nilai yang ditetapkan dalam basis data dconf.
ka: ეს ფაილი განსაზღვრავს ბლოკებს მნიშვნელობების ნაკრებებზე dconf-ის მონაცემთა ბაზაში.
pt_br: Este arquivo define bloqueios em valores definidos no banco de dados dconf.

source: SEE ALSO
ca: VEGEU TAMBÉ
es: CONSULTE TAMBIÉN
fi: KATSO MYÖS
id: LIHAT JUGA
ka: ასევე იხილეთ
pt_br: VEJA TAMBÉM

source: *Authselect* is a tool to configure system identity and authentication sources and providers by selecting a specific profile. Profile is a set of files that describes how the resulting system configuration will look like. When a profile is selected, *authselect* will create nsswitch.conf(5) and PAM(8) stack to use identity and authentication sources defined by the profile.
fi: *Authselect* on työkalu järjestelmän identiteetti- ja todennuslähteiden ja -palveluntarjoajien määrittämiseen valitsemalla tietty profiili. Profiili on tiedostojoukko, joka kuvaa, miltä tuloksena oleva järjestelmäkokoonpano näyttää. Kun profiili valitaan, *authselect* luo nsswitch.conf(5)- ja PAM(8)-pinon profiilin määrittämien identiteetti- ja todennuslähteiden käyttämiseksi.

source: OPT-OUT FROM AUTHSELECT
ca: DESACTIVAR AUTHSELECT
fi: POISTU AUTHSELECTILTA

source: To stop authselect from managing your configuration, run *authselect opt-out*. This will remove all authselect configuration from your system and you can then modify your configuration manually.
ca: Per deixar que authselect deixi de gestionar la vostra configuració, executeu *authselect opt-out*. Això eliminarà tota la configuració d'authselect del vostre sistema i llavors podreu modificar la vostra configuració manualment.
fi: Jos haluat estää authselectiä hallitsemasta määrityksiäsi, suorita 'authselect opt-out'. Tämä poistaa kaikki authselect-määritykset järjestelmästäsi ja voit sitten muokata määrityksiäsi käsin.

source: *is-feature-enabled* feature
fi: *is-feature-enabled* ominaisuus

source: Check if feature is currently enabled in the selected profile.
fi: Tarkista, onko ominaisuus otettu käyttöön nykyisessä valitussa profiilissa.

source: OTHER COMMANDS
ca: ALTRES COMANDES
fi: MUUT KOMENNOT

source: Remove authselect configuration. This will restore nsswitch and PAM configuration under its system location and authselect will no longer manage it. Run *authselect select* to opt-in again.
ca: Elimina la configuració d'authselect. Això restaurarà la configuració nsswitch i PAM a la seva ubicació del sistema i authselect ja no la gestionarà. Executeu *authselect select* per tornar a optar-hi.
fi: Poista todennusvalinnan määritykset. Tämä palauttaa nsswitch- ja PAM-määritykset sen järjestelmäsijaintiin, eikä authselect enää hallitse sitä. Ota käyttöön uudelleen suorittamalla *authselect select*.

source: 6: No configuration was detected.
ca: 6: No s'ha detectat cap configuració.
fi: 6: Kokoonpanoa ei havaittu.
