Repository: authselect/authselect
Catalog: src/man/po/authselect-migration.7.adoc.*.po
Languages: ca, it, pt_br

source: NAME
ca: NOM
it: NOME
pt_br: NOME

source: authselect-migration - A guide how to migrate from authconfig to authselect.
ca: authselect-migration - Una guia de com migrar des d'authconfig a authselect.
it: authselect-migration - Una guida su come migrare da authconfig ad authselect.
pt_br: authselect-migration - Um guia sobre como migrar do authconfig para authselect.

source: DESCRIPTION
ca: DESCRIPCIÓ
it: DESCRIZIONE
pt_br: DESCRIÇÃO

source: This manual page explains the main differences between authconfig, the previous tool to configure system authentication and identity sources, and authselect which replaces it. It also explains what actions need to be done in order to migrate from authconfig to authselect.
ca: Aquest manual explica les principals diferències entre authconfig, l'eina anterior per a configurar les fonts d'autenticació i identitat del sistema, i authselect el que el substitueix. També explica quines accions cal fer per migrar des d'authconfig a authselect.
it: Questa pagina di manuale illustra le principali differenze tra authconfig, il precedente strumento per configurare l'autenticazione di sistema e le fonti di identità, e authselect, che lo sostituisce. Spiega inoltre quali azioni devono essere eseguite per migrare da authconfig ad authselect.
pt_br: Esta página de manual explica as principais diferenças entre o authconfig, a ferramenta anterior para configurar a autenticação do sistema e as fontes de identidade, e o authselect que o substitui. Ele também explica quais ações precisam ser executadas para migrar do authconfig para o authselect.

source: MAIN DIFFERENCES
ca: DIFERÈNCIES PRINCIPALS
it: PRINCIPALI DIFFERENZE
pt_br: PRINCIPAIS DIFERENÇAS

source: Authselect takes a completely different approach to system configuration than the previous tool authconfig.
ca: Authselect té un enfocament completament diferent de la configuració del sistema que l'eina anterior authconfig.
it: Authselect adotta un approccio alla configurazione del sistema completamente diverso rispetto al precedente strumento authconfig.
pt_br: O authselect adota uma abordagem completamente diferente da configuração do sistema que a ferramenta anterior authconfig.

source: Authconfig tries its best to keep users's manual changes to the files it generates. It generates not only PAM configuration files and nsswitch.conf (to setup authentication modules and identity sources) but it also generates simple configuration files for several services such as LDAP and Kerberos.
ca: Authconfig intenta mantenir els canvis manuals dels usuaris als fitxers que genera. Genera no només fitxers de configuració PAM i nsswitch.conf (per configurar mòduls d'autenticació i fonts d'identitat) sinó que també genera fitxers de configuració senzills per a diversos serveis com LDAP i Kerberos.
it: Authconfig fa del suo meglio per conservare le modifiche manuali degli utenti nei file che genera. Genera non solo file di configurazione PAM e nsswitch.conf (per configurare i moduli di autenticazione e le fonti di identità), ma anche semplici file di configurazione per diversi servizi come LDAP e Kerberos.
pt_br: O authconfig faz o possível para manter as alterações manuais dos usuários nos arquivos que gera. Ele gera não apenas arquivos de configuração PAM e nsswitch.conf (para configurar módulos de autenticação e fontes de identidade), mas também arquivos de configuração simples para diversos serviços, como LDAP e Kerberos.

source: Authselect does no such things. It does not generate any configuration files beside PAM and nsswitch.conf and it strictly prohibits any manual changes to generated configuration. It provides a set of files called profiles. Each profile describes how the resulting configuration should look like and it can be slightly modified by enabling or disabling certain optional features. If a need arises for a different profile than what authselect ships, the administrator has an option to create a whole new profile and use it with authselect. See authselect-profiles(5) to learn more about profiles.
ca: L'Authselect no fa aquestes coses. No genera cap fitxer de configuració més enllà de PAM i nsswitch.conf i prohibeix estrictament qualsevol canvi manual a la configuració generada. Proporciona un conjunt de fitxers anomenats perfils. Cada perfil descriu com hauria de ser la configuració resultant i es pot modificar lleugerament activant o inhabilitant certes característiques opcionals. Si sorgeix una necessitat d'un perfil diferent del que l'autselect proporciona, l'administrador té l'opció de crear un perfil completament nou i utilitzar-lo amb l'autselect. Vegeu authselect-profiles(5) per a obtenir més informació sobre els perfils.
it: Authselect non fa nulla di tutto ciò. Non genera alcun file di configurazione oltre a PAM e nsswitch.conf e proibisce severamente qualsiasi modifica manuale alla configurazione generata. Fornisce un set di file chiamati profili. Ogni profilo descrive come dovrebbe apparire la configurazione risultante e può essere leggermente modificato abilitando o disabilitando alcune funzionalità opzionali. Se si rende necessario un profilo diverso da quello fornito da authselect, l'amministratore ha la possibilità di creare un profilo completamente nuovo e utilizzarlo con authselect. Consultare authselect-profiles(5) per ulteriori informazioni sui profili.
pt_br: O authselect não faz isso. Ele não gera nenhum arquivo de configuração além do PAM e do nsswitch.conf e proíbe terminantemente qualquer alteração manual na configuração gerada. Ele fornece um conjunto de arquivos chamados perfis. Cada perfil descreve como a configuração resultante deve ser e pode ser ligeiramente modificada habilitando ou desabilitando certos recursos opcionais. Se surgir a necessidade de um perfil diferente do fornecido pelo authselect, o administrador tem a opção de criar um perfil totalmente novo e usá-lo com o authselect. Consulte authselect-profiles(5) para saber mais sobre perfis.

source: This may seem like a big disadvantage but the truth is the opposite. Authconfig is a very old tool and the applications providing required services have changed rapidly over the years. Typically, there is no longer a need to have multiple authentication modules in PAM and nsswitch.conf, because the vast majority of use-cases is covered by SSSD. Therefore there is no need to add or remove them specifically. There are also better tools to generate configuration for system daemons that can help you automate the process of joining to a remote domain such as `realm`. In addition, the shipped profiles give us comprehensive and deterministic system configuration that can be fully tested and is much less error prone. It is also much easier to distribute such configuration across many systems.
ca: Això pot semblar un gran desavantatge, però la veritat és el contrari. Authconfig és una eina molt antiga i les aplicacions que proporcionen els serveis necessaris han canviat ràpidament amb els anys. En general, ja no hi ha necessitat de tenir múltiples mòduls d'autenticació en PAM i nsswitch.conf, perquè la gran majoria dels casos d'ús estan coberts per SSSD. Per tant, no hi ha necessitat d'afegir-les o eliminar-les específicament. També hi ha millors eines per generar configuració per als dimonis del sistema que poden ajudar a automatitzar el procés d'unir-se a un domini remot com `realm`. A més, els perfils proporcionats ens donen una configuració completa i determinista del sistema que es pot provar completament i és molt menys propens a errors. També és molt més fàcil distribuir aquesta configuració a través de molts sistemes.
it: Questo potrebbe sembrare un grosso svantaggio, ma in realtà è l'esatto opposto. Authconfig è uno strumento molto datato e le applicazioni che forniscono i servizi richiesti sono cambiate rapidamente nel corso degli anni. In genere, non è più necessario disporre di più moduli di autenticazione in PAM e nsswitch.conf, poiché la stragrande maggioranza dei casi d'uso è coperta da SSSD. Pertanto, non è necessario aggiungerli o rimuoverli specificamente. Esistono anche strumenti migliori per generare la configurazione per i daemon di sistema, che possono aiutare ad automatizzare il processo di adesione a un dominio remoto come `realm`. Inoltre, i profili forniti forniscono una configurazione di sistema completa e deterministica, che può essere testata in modo completo ed è molto meno soggetta a errori. È anche molto più facile distribuire tale configurazione su più sistemi.
pt_br: Isso pode parecer uma grande desvantagem, mas a verdade é o oposto. O authconfig é uma ferramenta muito antiga e os aplicativos que fornecem os serviços necessários mudaram rapidamente ao longo dos anos. Normalmente, não há mais necessidade de ter vários módulos de autenticação no PAM e no nsswitch.conf, pois a grande maioria dos casos de uso é coberta pelo SSSD. Portanto, não há necessidade de adicioná-los ou removê-los especificamente. Existem também ferramentas melhores para gerar configuração para daemons de sistema que podem ajudar a automatizar o processo de ingresso em um domínio remoto, como `realm`. Além disso, os perfis fornecidos nos fornecem uma configuração de sistema abrangente e determinística que pode ser totalmente testada e é muito menos propensa a erros. Também é muito mais fácil distribuir essa configuração entre vários sistemas.

source: Probably the most controversial change is that authselect only ships profiles for sssd and winbind providers. Those two providers cover all modern use cases from providing local users and legacy LDAP domain to complex configurations with IPA or Active Directory servers. The profiles no longer contain support for nss-pam-ldapd and users are encouraged to switch to sssd.
ca: Probablement el canvi més controvertit és que authselect només proporciona perfils per als proveïdors sssd i winbind. Aquests dos proveïdors cobreixen tots els casos d'ús moderns, des de proveir usuaris locals i dominis LDAP antics fins a configuracions complexes amb servidors IPA o Active Directory. Els perfils ja no contenen suport per nss-pam-ldapd i s'anima als usuaris a canviar a sssd.
it: Probabilmente la modifica più controversa è che authselect fornisce profili solo per i provider sssd e winbind. Questi due provider coprono tutti i casi d'uso moderni, dalla fornitura di utenti locali e domini LDAP legacy a configurazioni complesse con server IPA o Active Directory. I profili non supportano più nss-pam-ldapd e gli utenti sono incoraggiati a passare a sssd.
pt_br: Provavelmente a mudança mais controversa é que o authselect envia apenas perfis para provedores sssd e winbind. Esses dois provedores abrangem todos os casos de uso modernos, desde o fornecimento de usuários locais e domínio LDAP legado até configurações complexas com servidores IPA ou Active Directory. Os perfis não oferecem mais suporte para nss-pam-ldapd e os usuários são incentivados a migrar para sssd.

source: JOINING REMOTE DOMAINS
ca: UNIR-SE A DOMINIS REMOTS
it: UNIRSI A DOMINI REMOTI
pt_br: INGRESSANDO EM DOMÍNIOS REMOTOS

source: You can use either `ipa-client-install` or `realm` to join an IPA domain and `realm` to join an Active Directory domain. These tools will make sure that the correct authselect profile is selected and all daemons and services are properly configured.
ca: Podeu utilitzar tant `ipa-client-install` o `realm` per a unir-vos a un domini IPA i `realm` per a unir-vos a un domini d'Active Directory. Aquestes eines s'asseguraran que se selecciona el perfil correcte d'authselect i que tots els dimonis i serveis estiguin correctament configurats.
it: È possibile utilizzare `ipa-client-install` o `realm` per unirsi a un dominio IPA e `realm` per unirsi a un dominio Active Directory. Questi strumenti garantiranno che sia selezionato il profilo authselect corretto e che tutti i daemon e i servizi siano configurati correttamente.
pt_br: Você pode usar `ipa-client-install` ou `realm` para ingressar em um domínio IPA e `realm` para ingressar em um domínio do Active Directory. Essas ferramentas garantirão que o perfil authselect correto seja selecionado e que todos os daemons e serviços estejam configurados corretamente.

source: CONVERTING YOUR SCRIPTS
ca: CONVERTINT ELS VOSTRES SCRIPTS
it: CONVERSIONE DEI TUOI SCRIPT
pt_br: CONVERTENDO SEUS SCRIPTS

source: If you use `ipa-client-install` or `realm` to join a domain, you can just remove any authconfig call in your scripts. If this is not an option, you need to replace each authconfig call with its equivalent authselect call to select a correct profile with desired features. Then you also need to write configuration file for required services.
ca: Si utilitzeu `ipa-client-install` o `realm` per a unir-vos a un domini, podeu eliminar qualsevol crida d'authconfig en els vostres scripts. Si aquesta no és una opció, heu de reemplaçar cada crida d'authconfig amb la seva crida equivalent authselect per a seleccionar un perfil correcte amb les característiques desitjades. A continuació, també heu d'escriure el fitxer de configuració per als serveis requerits.
it: Se si utilizza `ipa-client-install` o `realm` per unirsi a un dominio, è sufficiente rimuovere qualsiasi chiamata authconfig dagli script. Se questa non è un'opzione, è necessario sostituire ogni chiamata authconfig con la sua equivalente chiamata authselect per selezionare un profilo corretto con le funzionalità desiderate. È quindi necessario scrivere un file di configurazione per i servizi richiesti.
pt_br: Se você usar `ipa-client-install` ou `realm` para ingressar em um domínio, basta remover qualquer chamada authconfig dos seus scripts. Se isso não for possível, você precisará substituir cada chamada authconfig pela chamada authselect equivalente para selecionar o perfil correto com os recursos desejados. Em seguida, você também precisará criar um arquivo de configuração para os serviços necessários.

source: Relation of authconfig options to authselect profiles
ca: Relació de les opcions d'authconfig amb els perfils d'authselect
it: Relazione tra le opzioni authconfig e i profili authselect
pt_br: Relação das opções do authconfig com os perfis do authselect

source: |*Authconfig options* |*Authselect profile* |--enableldap --enableldapauth |sssd |--enablesssd --enablesssdauth |sssd |--enablekrb5 |sssd |--enablewinbind --enablewinbindauth |winbind |--enablenis |nis
ca: |*Opcions d'Authconfig* |*Perfil authselect* |--enableldap --enableldapauth |sssd |--enablesssd --enablesssdauth |sssd |--enablekrb5 |sssd |--enablewinbind --enablewinbindauth |winbind |--enablenis |nis
it: |*Opzioni di Authconfig* |*Profilo Authselect*| \|--enableldap --enableldapauth |sssd | \|--enablesssd --enablesssdauth |sssd | \|--enablekrb5 |sssd | \|--enablewinbind --enablewinbindauth |winbind | \|--enablenis |nis |
pt_br: |*Opções do authconfig* |*Perfil do authselect* |--enableldap --enableldapauth |sssd |--enablesssd --enablesssdauth |sssd |--enablekrb5 |sssd |--enablewinbind --enablewinbindauth |winbind |--enablenis |nis

source: Relation of authconfig options to authselect profile features
ca: Relació de les opcions d'authconfig amb les funcionalitats del perfil d'authselect
it: Relazione tra le opzioni authconfig e le funzionalità del profilo authselect
pt_br: Relação das opções do authconfig com os recursos do perfil do authselect

source: |*Authconfig options* |*Authselect profile feature* |--enablesmartcard |with-smartcard |--enablefingerprint |with-fingerprint |--enableecryptfs |with-ecryptfs |--enablemkhomedir |with-mkhomedir |--enablefaillock |with-faillock |--enablepamaccess |with-pamaccess |--enablewinbindkrb5 |with-krb5 |--enableshadow |_none_ |--passalgo |_none_
ca: |*Opcions d'Authconfig* |*Funcionalitat del perfil authselect* |--enablesmartcard |with-smartcard |--enablefingerprint |with-fingerprint |--enableecryptfs |with-ecryptfs |--enablemkhomedir |with-mkhomedir |--enablefaillock |with-faillock |--enablepamaccess |with-pamaccess |--enablewinbindkrb5 |with-krb5 |--enableshadow |_cap_ |--passalgo |_cap_
it: |*Opzioni di Authconfig* |*Funzionalità del profilo Authselect*| \|--enablesmartcard |con-smartcard | \|--enablefingerprint |con-impronta digitale | \|--enableecryptfs |con-ecryptfs | \|--enablemkhomedir |con-creazione-cartella-home | \|--enablefaillock |con-faillock | \|--enablepamaccess |con-pamaccess | \|--enablewinbindkrb5 |con-krb5 | \|--enableshadow |*nessuno* | \|--passalgo |*nessuno* |
pt_br: |*Opções do authconfig* |*Recurso de perfil do authselect* |--enablesmartcard |with-smartcard |--enablefingerprint |with-fingerprint |--enableecryptfs |with-ecryptfs |--enablemkhomedir |with-mkhomedir |--enablefaillock |with-faillock |--enablepamaccess |with-pamaccess |--enablewinbindkrb5 |with-krb5 |--enableshadow |_none_ |--passalgo |_none_

source: Authconfig options `--enableshadow` and `--passalgo=sha512` were often used to make sure that passwords are stored in `/etc/shadow` using `sha512` algorithm. *The authselect profiles now use the yescrypt hashing method* and it cannot be changed through an option (only by creating a custom profile). You can just omit these options.
ca: Les opcions d'authconfig `--enableshadow` i `--passalgo=sha512` s'utilitzaven sovint per assegurar-se que les contrasenyes s'emmagatzemen a `/etc/shadow` utilitzant l'algorisme `sha512`. *Els perfils d'authselect ara utilitzen el mètode de hashing yescrypt* i no es pot canviar a través d'una opció (només creant un perfil personalitzat). Pots ometre aquestes opcions.
it: Le opzioni di authconfig `--enableshadow` e `--passalgo=sha512` venivano spesso utilizzate per garantire che le password fossero memorizzate in `/etc/shadow` utilizzando l'algoritmo `sha512`. *I profili authselect ora utilizzano il metodo di hashing yescrypt* e non è possibile modificarlo tramite un'opzione (solo creando un profilo personalizzato). È possibile semplicemente omettere queste opzioni.
pt_br: As opções de configuração de autenticação `--enableshadow` e `--passalgo=sha512` eram frequentemente usadas para garantir que as senhas fossem armazenadas em `/etc/shadow` usando o algoritmo `sha512`. *Os perfis authselect agora usam o método de hash yescrypt* e ele não pode ser alterado por meio de uma opção (apenas criando um perfil personalizado). Você pode simplesmente omitir essas opções.

source: Examples
ca: Exemples
it: Esempi
pt_br: Exemplos

source: authconfig --enablewinbind --enablewinbindauth --winbindjoin=Administrator --updateall realm join -U Administrator --client-software=winbind WINBINDDOMAIN
ca: authconfig --enablewinbind --enablewinbindauth --winbindjoin=Administrador --updateall realm join -U Administrador --client-software=winbind WINBINDDOMAIN
pt_br: authconfig --enablewinbind --enablewinbindauth --winbindjoin=Administrador --updateall realm join -U Administrador --client-software=winbind DOMINIOWINBIND

source: CONFIGURATION FILES
ca: FITXERS DE CONFIGURACIÓ
it: FILE DI CONFIGURAZIONE
pt_br: ARQUIVOS DE CONFIGURAÇÕES

source: This section contains snippets for minimal configuration of various services.
ca: Aquesta secció conté fragments per a una configuració mínima de diversos serveis.
it: Questa sezione contiene frammenti per la configurazione minima di vari servizi.
pt_br: Esta seção contém trechos para configuração mínima de vários serviços.

source: Even if LDAP is not directly used through `pam_ldap` and `nss_ldap`, it is still useful to configure ldap.conf to configure openldap-libs and indirectly, e.g. LDAP tools such as `ldapsearch`.
ca: Fins i tot si LDAP no s'utilitza directament a través de `pam_ldap` i `nss_ldap`, encara és útil configurar ldap.conf per a configurar openldap-libs i indirectament, per exemple, eines LDAP com `ldapsearch`.
it: Anche se LDAP non viene utilizzato direttamente tramite `pam_ldap` e `nss_ldap`, è comunque utile configurare ldap.conf per configurare openldap-libs e indirettamente, ad esempio, strumenti LDAP come `ldapsearch`.
pt_br: Mesmo que o LDAP não seja usado diretamente através de `pam_ldap` e `nss_ldap`, ainda é útil configurar o ldap.conf para configurar openldap-libs e indiretamente, por exemplo, ferramentas LDAP como `ldapsearch`.

source: # Set the default base dn BASE dc=example,dc=com
ca: # Estableix el dn base per defecte BASE dc=exemple,dc=com
it: # Imposta il DN base predefinito BASE dc=example,dc=com
pt_br: # Define o dn base padrão BASE dc=example,dc=com

source: # Set the default LDAP server URI ldap://ldap.example.com ldap://ldap-master.example.com:666
ca: # Estableix el servidor LDAP per defecte URI ldap://ldap.exemple.com ldap://ldap-master.exemple.com:666
it: # Imposta l'URI predefinito del server LDAP ldap://ldap.example.com ldap://ldap-master.example.com:666
pt_br: # Define o servidor LDAP padrão URI ldap://ldap.example.com ldap://ldap-master.example.com:666

source: If you use Kerberos, the default Kerberos realm should be configured in order for krb5-libs and therefore tools such as `kinit` to work out of the box.
ca: Si utilitzeu Kerberos, s'hauria de configurar el domini de Kerberos per defecte perquè krb5-libs i, per tant, les eines com `kinit` funcionin immediatament.
it: Se si utilizza Kerberos, è necessario configurare il dominio Kerberos predefinito affinché krb5-libs e quindi strumenti come `kinit` funzionino immediatamente.
pt_br: Se você usa o Kerberos, o domínio padrão do Kerberos deve ser configurado para que o krb5-libs e, portanto, ferramentas como o `kinit` funcionem imediatamente.

source: [libdefaults] default_realm = MYREALM
pt_br: [libdefaults] default_realm = MEUREALM

source: [realms] MYREALM = { kdc = kdc.myrealm.org }
pt_br: [realms] MEUREALM = { kdc = kdc.meurealm.org }

source: [domain_realm] myrealm.org = MYREALM .myrealm.org = MYREALM
pt_br: [domain_realm] meurealm.org = MEUREALM .meurealm.org = MEUREALM

source: Authselect encourages users to use SSSD wherever possible. There are many configuration options, see sssd.conf(5). This is a minimal configuration that creates one LDAP domain called `default`. The LDAP server is auto-discovered through DNS lookups.
ca: Authselect anima els usuaris a utilitzar SSSD sempre que sigui possible. Hi ha moltes opcions de configuració, vegeu sssd.conf(5). Aquesta és una configuració mínima que crea un domini LDAP anomenat `default`. El servidor LDAP es descobreix automàticament a través de cerques DNS.
it: Authselect incoraggia gli utenti a utilizzare SSSD ove possibile. Sono disponibili numerose opzioni di configurazione, vedere sssd.conf(5). Questa è una configurazione minima che crea un dominio LDAP denominato `default`. Il server LDAP viene rilevato automaticamente tramite ricerche DNS.
pt_br: O authselect incentiva os usuários a usar SSSD sempre que possível. Há muitas opções de configuração, consulte sssd.conf(5). Esta é uma configuração mínima que cria um domínio LDAP chamado `default`. O servidor LDAP é descoberto automaticamente por meio de pesquisas de DNS.

source: [domain/default] id_provider = ldap ldap_uri = _srv_ dns_discovery_domain = myrealm
pt_br: [domain/default] id_provider = ldap ldap_uri = _srv_ dns_discovery_domain = meurealm

source: And here is a configuration snippet for the same domain but now the authentication is done over Kerberos. The KDC server is auto-discovered through DNS lookups.
ca: I aquí hi ha un fragment de configuració per al mateix domini però ara l'autenticació es fa sobre Kerberos. El servidor KDC es descobreix automàticament a través de cerques DNS.
it: Ed ecco uno snippet di configurazione per lo stesso dominio, ma ora l'autenticazione avviene tramite Kerberos. Il server KDC viene rilevato automaticamente tramite ricerche DNS.
pt_br: E aqui está um trecho de configuração para o mesmo domínio, mas agora a autenticação é feita via Kerberos. O servidor KDC é descoberto automaticamente por meio de pesquisas de DNS.
