Repository: authselect/authselect
Catalog: src/man/po/authselect.8.adoc.*.po
Languages: ca, es, fi, id, ka, pt_br

source: *{AUTHSELECT_PAM_DIR}/password-auth, smartcard-auth, fingerprint-auth*
fi: *{AUTHSELECT_PAM_DIR}/salasanatodennus, älykorttitodennus, sormenjälkitodennus*

source: *{AUTHSELECT_PAM_DIR}/postlogin*
fi: *{AUTHSELECT_PAM_DIR}/jälkeinen_sisäänkirjautuminen*
