Repository: authselect/authselect
Catalog: src/man/po/authselect-profiles.5.adoc.*.po
Languages: ca, id, it, ka, pt_br

source: The expression syntax consists of feature names (e.g. _"feature"_) which returns _true_ if the feature is defined or _false_ if it is not defined and from the following logical operators: _and_, _or_ and _not_. The expression may also be enclosed in parentheses and contain multiple subexpressions.
ca: La sintaxi d'expressió consisteix en noms de característiques (p. ex. "funció") que retorna cert si la característica està definida o fals si no està definida i dels operadors lògics següents: i, o i no. L'expressió també es pot incloure entre parèntesis i conté múltiples subexpressions.
id: Sintaks ekspresi terdiri dari nama fitur (misalnya _"feature"_) yang mengembalikan _true_ jika fitur tersebut ditentukan atau _false_ jika tidak ditentukan, serta dari operator logika berikut: _and_, _or_, dan _not_. Ekspresi juga dapat diapit dalam tanda kurung dan berisi beberapa sub-ekspresi.
it: La sintassi dell'espressione è costituita da nomi di funzionalità (ad esempio _ "funzione" _) che restituisce _true_ se la funzione è definita o _false_ se non è definita e dai seguenti operatori logici: _and_, _or_ e _not_. L'espressione può anche essere racchiusa tra parentesi e contenere più sottoespressioni.
ka: გამოსახულების სინტაქსი შედგება ფუნქციების სახელებისგან (მაგ. "ფუნქცია"), რაც აბრუნებს მნიშვნელობას true, თუ ფუნქცია აღწერილია, ან false, თუ ის აღწერილი არაა. ის ასევე მოიცავს შემდეგ ლოგიკურ ოპერატორებს: and (და), or (ან) და not (არა). გამოსახულება შეიძლება მოთავსდეს ფრჩხილებში და შეიცავდეს რამდენიმე ქვეგამოსახულებას.
pt_br: A sintaxe da expressão consiste em nomes de recursos (por exemplo, _"recurso"_) que retornam _true_ se o recurso estiver definido ou _false_ se não estiver definido, e nos seguintes operadores lógicos: _and_, _or_ e _not_. A expressão também pode estar entre parênteses e conter várias subexpressões.

source: For example:
ca: Per exemple:
id: Sebagai contoh:
it: Per esempio:
ka: მაგალითად:
pt_br: Por exemplo:

source: *{if "feature1" or "feature2":true}*
it: *{se "feature1" o "feature2":true}*
ka: *{if "თვისება1" or "თვისება2":true}*
pt_br: *{if "recurso1" or "recurso2":true}*

source: If "feature1" or "feature2" is defined, replace this operator with string "true", otherwise with an empty string.
ca: Si es defineix «feature1» o «feature2», substituïu aquest operador amb la cadena «true», en cas contrari amb una cadena buida.
id: Jika "feature1" atau "feature2" ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string kosong.
it: Se è definito "feature1" o "feature2", sostituire questo operatore con stringa "true", altrimenti con una stringa vuota.
ka: თუ აღწერილია "ფუნქცია1", ან "ფუნქცია2", ჩაანაცვლეთ ეს ოპერატორი სტრიქონით "true". თუ არა - ცარიელი სტრიქონით.
pt_br: Se "recurso1" ou "recurso2" for definido, substitua este operador pela string "true", caso contrário, por uma string vazia.

source: *{if not "feature":true|false}*
it: *{se non "feature":true|false}*
ka: *{if not "თვისება":true|false}*
pt_br: *{if not "recurso":true|false}*

source: If "feature" is not defined, replace this operator with string "true", otherwise with string "false".
ca: Si no es defineix «feature», substituïu aquest operador per la cadena «true», en cas contrari amb la cadena «false».
id: Jika "feature" tidak ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string "false".
it: Se "feature" non è definito, sostituire questo operatore con la stringa "true", altrimenti con la stringa "false".
ka: თუ "ფუნქცია" აღწერილი არაა, შეცვალეთ ეს ოპერატორი სტრიქონით "true", თუ არა - სტრიქონით "false".
pt_br: Se "recurso" não estiver definido, substitui este operador pela string "true", caso contrário, pela string "false".

source: *{if not "feature":true}*
it: *{se non "feature":true}*
ka: *{if not "თვისება":true}*
pt_br: *{if not "recurso":true}*

source: If "feature" is not defined, replace this operator with string "true", otherwise with an empty string.
ca: Si «feature» no està definida, substituïu aquest operador amb la cadena «true», en cas contrari amb una cadena buida.
id: Jika "feature" tidak ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string kosong.
it: Se "feature" non è definito, sostituire questo operatore con la stringa "true", altrimenti con una stringa vuota.
ka: თუ "ფუნქცია" აღწერილი არაა, შეცვალეთ ეს ოპერატორი სტრიქონით "true", თუ არა - ცარიელი სტრიქონით.
pt_br: Se "recurso" não estiver definido, substitui este operador pela string "true", caso contrário, por uma string vazia.

source: If "feature1" is defined, and one of "feature2" and "feature3" is defined replace this operator with string "true", otherwise with an empty string.
ca: Si es defineix "feature1", i una de "feature2" i "feature3" es defineix substitueix aquest operador per la cadena «true», en cas contrari amb una cadena buida.
id: Jika "feature1" ditentukan, dan salah satu dari "feature2" dan "feature3" ditentukan, ganti operator ini dengan string "true", jika tidak ganti dengan string kosong.
it: Se è definito "feature1" e uno tra "feature2" e "feature3" è definito, sostituire questo operatore con la stringa "true", altrimenti con una stringa vuota.
ka: თუ "ფუნქცია1" აღწერილია და "ფუნქცია2" ან "ფუნქცია3" აღწერილია, შეცვალეთ ეს ოპერატორი სტრიქონით "true". თუ არა - ცარიელი სტრიქონით.
pt_br: Se "recurso1" for definido, e um de "recurso2" e "recurso3" for definido, substitua este operador pela string "true", caso contrário, por uma string vazia.

source: EXAMPLE
ca: EXEMPLE
id: CONTOH
it: ESEMPIO
ka: მაგალითი
pt_br: EXEMPLO

source: Here is an example of using "if" operator. If "with-sudo" feature is enabled, it will add "sss" to sudoers line.
ca: Heus aquí un exemple d'ús de l'operador "if". Si la característica "with-sudo" està activada, afegirà "sss" a la línia sudoers.
id: Berikut adalah contoh penggunaan operator "if". Jika fitur "with-sudo" diaktifkan, ini akan menambahkan "sss" ke baris sudoers.
it: Ecco un esempio di utilizzo dell'operatore "if". Se la funzione "with-sudo" è abilitata, verrà aggiunto "sss" alla riga "sudoers".
ka: ეს "if" ოპერატორის გამოყენების მაგალითია. თუ ფუნქცია "with-sudo" ჩართულია, ის sudoers-ის ხაზს "sss"-ს დაამატებს.
pt_br: Aqui está um exemplo de uso do operador "if". Se o recurso "with-sudo" estiver habilitado, ele adicionará "sss" à linha do sudoers.

source: Here is an example of "continue-if" and "include-if" operators. The resulting file will be empty unless "with-smartcard" feature is enabled. If it is enabled and also "with-faillock" feature is enabled, it will also enable support for pam_faillock.
ca: Heus aquí un exemple d'operadors "continue-if" i "include-if". El fitxer resultant estarà buit tret que la característica "with-smartcard" estigui activada. Si està habilitat i també està habilitada la característica "with-faillock", també habilitarà el suport per a pam_faillock.
id: Berikut adalah contoh operator "continue-if" dan "include-if". Berkas yang dihasilkan akan kosong kecuali fitur "with-smartcard" diaktifkan. Jika fitur tersebut diaktifkan dan fitur "with-faillock" juga diaktifkan, ini juga akan mengaktifkan dukungan untuk pam_faillock.
it: Ecco un esempio di utilizzo dell'operatore "if". Se la funzione "with-sudo" è abilitata, verrà aggiunto "sss" alla riga "sudoers".
ka: ეს „continue-if“ და „include-if“ ოპერატორების მაგალითია. მიღებული ფაილი ცარიელი იქნება, თუ „with-smartcard“ ფუნქცია ჩართული არაა. თუ ის ჩართულია და ასევე გააქტიურებულია ფუნქცია „with-faillock“, ის ასევე ჩართავს pam_faillock-ის მხარდაჭერას.
pt_br: Aqui está um exemplo dos operadores "continue-if" e "include-if". O arquivo resultante estará vazio, a menos que o recurso "with-smartcard" esteja habilitado. Se ele estiver habilitado e o recurso "with-faillock" também estiver habilitado, o suporte para pam_faillock também será habilitado.

source: {continue if "with-smartcard"} auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth required pam_faillock.so preauth silent deny=4 unlock_time=1200 {include if "with-faillock"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so auth sufficient pam_unix.so nullok auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_faillock.so authfail deny=4 unlock_time=1200 {include if "with-faillock"} auth required pam_deny.so ...
it: {continua se "con-smartcard"} autenticazione richiesta pam_env.so autenticazione richiesta pam_faildelay.so ritardo=2000000 auth obbligatorio pam_faillock.so preauth silent aware=4 sblocca_time=1200 {include if "with-faillock"} auth [default=1 ignore=ignora success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignora success=ok] pam_localuser.so autenticazione sufficiente pam_unix.so nullok requisito di autenticazione pam_succeed_if.so uid >= 1000 quiet_success autenticazione sufficiente pam_sss.so forward_pass auth richiesto pam_faillock.so authfail Denis=4 sblocca_time=1200 {include if "with-faillock"} autenticazione richiesta pam_deny.so ... auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth required pam_faillock.so preauth silent deny=4 unlock_time=1200 {include if "with-faillock"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so auth sufficient pam_unix.so nullok auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_faillock.so authfail deny=4 unlock_time=1200 {include if "with-faillock"} auth required pam_deny.so ...

source: Here is an example of "continue-if" using logical expression. The file will be empty unless "with-smartcard" or "with-smartcard-required" is set. This will simplify the call of _authselect select_ command which does not have to include both features but only "with-smartcard-required" is necessary.
ca: Aquí hi ha un exemple de "continue-if" utilitzant l'expressió lògica. El fitxer estarà buit tret que s'estableixi "with-smartcard" o "with-smartcard-required". Això simplificarà la crida de l'ordre _authselect select_ que no ha d'incloure les dues característiques, sinó que només cal "with-smartcard-required".
id: Berikut adalah contoh "continue-if" menggunakan ekspresi logika. Berkas akan kosong kecuali "with-smartcard" atau "with-smartcard-required" ditetapkan. Ini akan menyederhanakan pemanggilan perintah _authselect select_ yang tidak harus menyertakan kedua fitur tersebut tetapi hanya "with-smartcard-required" saja yang diperlukan.
it: Ecco un esempio di "continue-if" che utilizza un'espressione logica. Il file sarà vuoto a meno che non venga impostato "with-smartcard" o "with-smartcard-required". Questo semplificherà la chiamata del comando _authselect select_, che non deve includere entrambe le funzionalità, ma è necessario solo "with-smartcard-required".
ka: აი „continue-if“-ის მაგალითი ლოგიკური გამოსახულების გამოყენებით. ფაილი ცარიელი იქნება, თუ არ არის მითითებული „with-smartcard“ ან „with-smartcard-required“. ეს გაამარტივებს authselect select ბრძანების გამოძახებას, რადგან აღარ იქნება საჭირო ორივე ფუნქციის მითითება და მხოლოდ „with-smartcard-required“-ის ჩართვაც საკმარისი იქნება.
pt_br: Aqui está um exemplo de "continue-if" usando uma expressão lógica. O arquivo estará vazio, a menos que "with-smartcard" ou "with-smartcard-required" esteja definido. Isso simplificará a chamada do comando _authselect_, que não precisa incluir ambos os recursos, mas apenas "with-smartcard-required".

source: {continue if "with-smartcard" or "with-smartcard-required"} auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth required pam_faillock.so preauth silent deny=4 unlock_time=1200 {include if "with-faillock"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so auth sufficient pam_unix.so nullok auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_faillock.so authfail deny=4 unlock_time=1200 {include if "with-faillock"} auth required pam_deny.so ...
it: {continua se "con-smartcard" o "con-smartcard-obbligatorio"} auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth required pam_faillock.so preauth silent deny=4 unlock_time=1200 {includi se "con-faillock"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so auth sufficient pam_unix.so nullok auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_faillock.so authfail deny=4 unlock_time=1200 {includi se "con-faillock"} auth required pam_deny.so ...

source: Here is an example of "imply-if" operator. Enabling feature "with-smartcard-required" will also enable "with-smartcard" to make sure that all relevant PAM modules are used. This will achieve the same behavior as the previous example.
ca: Aquí hi ha un exemple d'operador "imply-if". Habilitant la característica "with-smartcard-required" també s'habilitarà "with-smartcard" per assegurar-se que s'utilitzen tots els mòduls PAM pertinents. Això aconseguirà el mateix comportament que l'exemple anterior.
id: Berikut adalah contoh operator "imply-if". Mengaktifkan fitur "with-smartcard-required" juga akan mengaktifkan "with-smartcard" untuk memastikan bahwa semua modul PAM yang relevan digunakan. Ini akan menghasilkan perilaku yang sama seperti contoh sebelumnya.
it: Ecco un esempio dell'operatore "imply-if". Abilitando la funzionalità "with-smartcard-required" verrà abilitata anche "with-smartcard" per garantire che vengano utilizzati tutti i moduli PAM pertinenti. Questo otterrà lo stesso comportamento dell'esempio precedente.
ka: ეს"imply-if" ოპერატორის მაგალითია. ფუნქციის „with-smartcard-required“ ჩართვა ასევე გაააქტიურებს ფუნქციას „with-smartcard“, რომ დარწმუნდეთ, რომ ყველა შესაბამისი PAM მოდული გამოყენებულია. ეს იმავე შედეგს მოგვცემს, რასაც წინა მაგალითი.
pt_br: Aqui está um exemplo do operador "imply-if". Habilitar o recurso "with-smartcard-required" também habilitará "with-smartcard" para garantir que todos os módulos PAM relevantes sejam usados. Isso resultará no mesmo comportamento do exemplo anterior.

source: {imply "with-smartcard" if "with-smartcard-required"} auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth [success=1 default=ignore] pam_succeed_if.so service notin login:gdm:xdm:kdm:kde:xscreensaver:gnome-screensaver:kscreensaver quiet use_uid {include if "with-smartcard-required"} auth [success=done ignore=ignore default=die] pam_sss.so require_cert_auth ignore_authinfo_unavail {include if "with-smartcard-required"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so {exclude if "with-smartcard"} auth [default=2 ignore=ignore success=ok] pam_localuser.so {include if "with-smartcard"} auth [success=done authinfo_unavail=ignore user_unknown=ignore ignore=ignore default=die] pam_sss.so try_cert_auth {include if "with-smartcard"} auth sufficient pam_unix.so {if not "without-nullok":nullok} auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_deny.so ...
it: {implica "con-smartcard" se "con-smartcard-obbligatorio"} auth required pam_env.so auth required pam_faildelay.so delay=2000000 auth [success=1 default=ignore] pam_succeed_if.so service non in login:gdm:xdm:kdm:kde:xscreensaver:gnome-screensaver:kscreensaver quiet use_uid {includi se "con-smartcard-obbligatorio"} auth [success=done ignore=ignore default=die] pam_sss.so require_cert_auth ignore_authinfo_unavail {includi se "con-smartcard-obbligatorio"} auth [default=1 ignore=ignore success=ok] pam_succeed_if.so uid >= 1000 quiet auth [default=1 ignore=ignore success=ok] pam_localuser.so {escludi se "con-smartcard"} auth [default=2 ignore=ignore success=ok] pam_localuser.so {includi se "con-smartcard"} auth [success=done authinfo_unavail=ignore user_unknown=ignore ignore=ignore default=die] pam_sss.so try_cert_auth {includi se "con-smartcard"} auth sufficient pam_unix.so {se non "senza-nullok":nullok} auth requisite pam_succeed_if.so uid >= 1000 quiet_success auth sufficient pam_sss.so forward_pass auth required pam_deny.so ...

source: CREATING A NEW PROFILE
ca: CREACIÓ D'UN PERFIL NOU
id: MEMBUAT PROFIL BARU
it: CREAZIONE DI UN NUOVO PROFILO
ka: იქმნება ახალი პროფილი
pt_br: CRIANDO UM NOVO PERFIL

source: To register a new profile within authselect, create a directory in one of the authselect profile locations with the files listed above. Not all of the files must be present, only *README* is mandatory. Other files can be created on per-need basis.
ca: Per a registrar un perfil nou dins d'authselect, creeu un directori en una de les ubicacions del perfil d'authselect amb els fitxers llistats a dalt. No tots els fitxers han d'estar presents, només *README* és obligatori. Es poden crear altres fitxers sobre la base necessària.
id: Untuk mendaftarkan profil baru dalam authselect, buatlah sebuah direktori di salah satu lokasi profil authselect dengan berkas-berkas yang tercantum di atas. Tidak semua berkas harus ada, hanya *README* yang bersifat wajib. Berkas lainnya dapat dibuat sesuai kebutuhan.
it: Per registrare un nuovo profilo in authselect, creare una directory in una delle posizioni dei profili di authselect con i file elencati sopra. Non tutti i file devono essere presenti, solo *README* è obbligatorio. Altri file possono essere creati in base alle esigenze.
ka: authselect-ში ახალი პროფილის დასარეგისტრირებლად შექმენით საქაღალდე authselect-ის პროფილების ერთ-ერთ მდებარეობაზე და მასში მოათავსეთ ზემოთ ჩამოთვლილი ფაილები. ყველა ფაილის არსებობა სავალდებულო არაა. აუცილებელია, მხოლოდ, ფაილი README. სხვა ფაილები შეიძლება საჭიროებისამებრ შეიქმნას.
pt_br: Para registrar um novo perfil no authselect, crie um diretório em um dos locais de perfil do authselect com os arquivos listados acima. Nem todos os arquivos precisam estar presentes, apenas o *README* é obrigatório. Outros arquivos podem ser criados conforme a necessidade.

source: You may find *authselect create-profile* command helpful when creating new profile. See *authselect(8)* manual page or *authselect create-profile --help* for more information.
ca: Podeu trobar l'ordre *authselect create-profile* útil en crear un perfil nou. Vegeu la pàgina del manual *authselect(8)* o *authselect create-profile --help* per a més informació.
id: Anda mungkin akan terbantu dengan perintah *authselect create-profile* saat membuat profil baru. Lihat halaman manual *authselect(8)* atau *authselect create-profile --help* untuk informasi lebih lanjut.
it: Il comando *authselect create-profile* potrebbe essere utile per creare un nuovo profilo. Consulta la pagina del manuale *authselect(8)* o *authselect create-profile --help* per ulteriori informazioni.
ka: ბრძანება "authselect create-profile", შეიძლება, ახალი პროფილის შექმნისას გამოგადგეთ. მეტ ინფორმაციისთვის იხილეთ *authselect(8)*-ის სახელმძღვანელო, ან *authselect create-profile --help*.
pt_br: Você pode achar o comando *authselect create-profile* útil ao criar um novo perfil. Consulte a página de manual *authselect(8)* ou *authselect create-profile --help* para mais informações.

source: SEE ALSO
ca: VEGEU TAMBÉ
id: LIHAT JUGA
it: VEDI ANCHE
ka: ასევე იხილეთ
pt_br: VEJA TAMBÉM

source: *{include if "feature"}*
ka: *{include if "თვისება"}*
pt_br: *{include if "recurso"}*

source: *{exclude if "feature"}*
ka: *{exclude if "თვისება"}*
pt_br: *{exclude if "recurso"}*

source: *{if "feature1" and ("feature2" or "feature3"):true}*
ka: *{if "თვისება1" and ("თვისება2" or "თვისება3"):true}*
pt_br: *{if "recurso1" and ("recurso2" or "recurso3"):true}*

source: Name Service Switch configuration file. Only maps relevant to the profile must be set. Maps that are not specified by the profile are included from {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf.
ka: Name Service Switch-ის კონფიგურაციის ფაილი. უნდა დაყენდეს მხოლოდ პროფილისთვის შესაბამისი ასახვები. ის ასახვები, რომლებიც არ არის მითითებული პროფილში, ჩაისმება ფაილიდან {AUTHSELECT_CONFIG_DIR}/user-nsswitch.conf.
