Repository: authselect/authselect
Catalog: po/*.po
Languages: id

source: Disable feature in currently selected profile
id: Nonaktifkan fitur pada profil yang saat ini dipilih

source: Create new authselect profile
id: Buat profil authselect baru

source: Backup commands:
id: Perintah cadangan:

source: List available backups
id: Daftar cadangan yang tersedia

source: Remove backup
id: Hapus cadangan

source: Restore from backup
id: Pulihkan dari cadangan

source: Uninstall authselect configuration
id: Copot konfigurasi authselect

source: NIS for user information by default
id: NIS untuk informasi pengguna secara bawaan

source: default NIS domain
id: domain NIS bawaan

source: default NIS server
id: server NIS bawaan

source: LDAP for user information by default
id: LDAP untuk informasi pengguna secara bawaan

source: LDAP for authentication by default
id: LDAP untuk autentikasi secara bawaan

source: default LDAP server hostname or URI
id: nama host atau URI server LDAP bawaan

source: default LDAP base DN
id: basis DN LDAP bawaan

source: use of TLS with LDAP (RFC-2830)
id: penggunaan TLS dengan LDAP (RFC-2830).

source: use of TLS for identity lookups with LDAP (RFC-2830)
id: penggunaan TLS untuk pencarian identitas dengan LDAP (RFC-2830).

source: use of RFC-2307bis schema for LDAP user information lookups
id: penggunaan skema RFC-2307bis untuk pencarian informasi pengguna LDAP

source: authentication with smart card by default
id: autentikasi dengan kartu pintar secara bawaan

source: <0=Lock|1=Ignore>
id: <0=Kunci|1=Abaikan>

source: action to be taken on smart card removal
id: aksi yang dilakukan saat kartu pintar dilepas

source: require smart card for authentication by default
id: wajibkan penggunaan kartu pintar untuk autentikasi secara bawaan

source: authentication with fingerprint readers by default
id: autentikasi dengan pembaca sidik jari secara bawaan

source: automatic per-user ecryptfs
id: ecryptfs otomatis per pengguna

source: Kerberos authentication by default
id: autentikasi Kerberos secara bawaan

source: default Kerberos KDC
id: KDC Kerberos bawaan

source: default Kerberos admin server
id: server admin Kerberos bawaan

source: default Kerberos realm
id: realm Kerberos bawaan

source: use of DNS to find Kerberos KDCs
id: penggunaan DNS untuk menemukan KDC Kerberos

source: use of DNS to find Kerberos realms
id: penggunaan DNS untuk menemukan realm Kerberos

source: winbind for user information by default
id: winbind untuk informasi pengguna secara bawaan

source: winbind for authentication by default
id: winbind untuk autentikasi secara bawaan

source: join the winbind domain or ads realm now as this administrator
id: gabungkan domain atau realm ads winbind sekarang sebagai administrator ini

source: Kerberos 5 for authenticate with winbind
id: Kerberos 5 untuk autentikasi dengan winbind.

source: workgroup authentication servers are in
id: server autentikasi yang ada dalam workgroup

source: SSSD for user information by default with manually managed configuration
id: SSSD untuk informasi pengguna secara bawaan dengan konfigurasi yang dikelola manual

source: SSSD for authentication by default with manually managed configuration
id: SSSD untuk autentikasi secara bawaan dengan konfigurasi yang dikelola manual

source: caching of user credentials in SSSD by default
id: penyimpanan sementara (cache) kredensial pengguna di SSSD secara bawaan

source: check of access.conf during account authorization
id: pemeriksaan access.conf selama otorisasi akun

source: creation of home directories for users on their first login
id: pembuatan direktori rumah untuk pengguna pada login pertama mereka

source: account locking in case of too many consecutive authentication failures
id: penguncian akun jika terlalu banyak kegagalan autentikasi berturut-turut

source: minimum length of a password
id: panjang minimum kata sandi

source: minimum number of character classes in a password
id: jumlah minimum kelas karakter dalam kata sandi

source: maximum number of same consecutive characters in a password
id: jumlah maksimum karakter berurutan yang sama dalam kata sandi

source: maximum number of consecutive characters of same class in a password
id: jumlah maksimum karakter berurutan dari kelas yang sama dalam kata sandi

source: require at least one lowercase character in a password
id: wajibkan setidaknya satu huruf kecil dalam kata sandi

source: require at least one uppercase character in a password
id: wajibkan setidaknya satu huruf besar dalam kata sandi

source: require at least one digit in a password
id: wajibkan setidaknya satu angka dalam kata sandi

source: require at least one other character in a password
id: wajibkan setidaknya satu karakter lainnya dalam kata sandi

source: do not start/stop services
id: jangan mulai/hentikan layanan

source: update all configuration files
id: perbarui semua file konfigurasi

source: the same as --updateall
id: sama dengan --updateall

source: These options have a compatibility layer
id: Opsi ini memiliki lapisan kompatibilitas

source: These options are no longer supported and have no effect
id: Opsi-opsi ini tidak lagi didukung dan tidak memiliki efek apa pun

source: Executing: %s
id: Menjalankan: %s

source: Service %s was not found. Please install the service.
id: Layanan %s tidak ditemukan. Silakan instal layanan tersebut.

source: Command [%s] failed with %d, stderr:
id: Perintah [%s] gagal dengan %d, stderr:

source: Removing file: %s
id: Menghapus file: %s

source: %s was not found. Please, install realmd.
id: %s tidak ditemukan. Silakan instal realmd.

source: Running authconfig compatibility tool.
id: Menjalankan alat kompatibilitas authconfig.

source: The purpose of this tool is to enable authentication against chosen services with authselect and minimum configuration. It does not provide all capabilities of authconfig.
id: Tujuan alat ini adalah untuk mengaktifkan autentikasi terhadap layanan yang dipilih menggunakan authselect dengan konfigurasi minimum. Alat ini tidak menyediakan semua kemampuan authconfig.

source: IMPORTANT: authconfig is replaced by authselect, please update your scripts.
id: PENTING: authconfig telah digantikan oleh authselect, harap perbarui skrip Anda.

source: See Fedora 28 Change Page: https://fedoraproject.org/wiki/Changes/AuthselectAsDefault
id: Lihat Halaman Perubahan Fedora 28: https://fedoraproject.org/wiki/Changes/AuthselectAsDefault

source: See man authselect-migration(7) to help you with migration to authselect
id: Lihat manual authselect-migration(7) untuk membantu Anda melakukan migrasi ke authselect

source: Warning: These options are not supported anymore and have no effect:
id: Peringatan: Opsi-opsi ini tidak lagi didukung dan tidak memiliki efek:

source: authconfig can only be run as root
id: authconfig hanya dapat dijalankan sebagai root

source: Error: option --%s is no longer supported and we cannot continue if it is set.
id: Kesalahan: opsi --%s tidak lagi didukung dan proses tidak dapat dilanjutkan jika opsi ini diatur.

source: Error: Both --enablewinbind and --enablewinbindauth must be set.
id: Kesalahan: Kedua opsi --enablewinbind dan --enablewinbindauth harus diatur.

source: Error: Please, provide --updateall option.
id: Kesalahan: Harap berikan opsi --updateall.
