Repository: authselect/authselect
Catalog: po/*.po
Languages: id

source: Unable to obtain supported features
id: Tidak dapat memperoleh fitur yang didukung

source: Unknown profile feature [%s], did you mean [%s]?
id: Fitur profil yang tidak dikenal [%s], apakah maksud Anda [%s]?

source: Unknown profile feature [%s]
id: Fitur profil yang tidak dikenal [%s]

source: Trying to activate profile [%s]
id: Mencoba mengaktifkan profil [%s]

source: Unable to find profile [%s] [%d]: %s
id: Tidak dapat menemukan profil [%s] [%d]: %s

source: Enforcing activation!
id: Menerapkan aktivasi!

source: Unable to check configuration [%d]: %s
id: Tidak dapat memeriksa konfigurasi [%d]: %s

source: Unexpected changes to the configuration were detected.
id: Perubahan tak terduga pada konfigurasi terdeteksi.

source: Refusing to activate profile unless those changes are removed or overwrite is requested.
id: Menolak untuk mengaktifkan profil kecuali perubahan tersebut dihapus atau penimpaan diminta.

source: File that needs to be overwritten was found
id: File yang perlu ditimpa telah ditemukan.

source: Refusing to activate profile unless this file is removed or overwrite is requested.
id: Menolak untuk mengaktifkan profil kecuali file ini dihapus atau penimpaan diminta.

source: Unable to activate profile [%s] [%d]: %s
id: Tidak dapat mengaktifkan profil [%s] [%d]: %s

source: Trying to uninstall authselect configuration
id: Mencoba untuk menghapus konfigurasi authselect

source: Unable to remove symlinks [%d]: %s
id: Tidak dapat menghapus tautan simbolis [%d]: %s

source: Symbolic links were successfully removed
id: Tautan simbolik telah berhasil dihapus

source: Profile feature [%s] is no longer supported, removing it...
id: Fitur profil [%s] tidak lagi didukung, menghapusnya...

source: Unable to create backup directory [%s/%s] [%d]: %s
id: Tidak dapat membuat direktori cadangan [%s/%s] [%d]: %s

source: Unable to create backup directory [%s] [%d]: %s
id: Tidak dapat membuat direktori cadangan [%s] [%d]: %s

source: Creating temporary directory at [%s]
id: Membuat direktori sementara di [%s]

source: There is no filename in [%s]
id: Tidak ada nama berkas di [%s]

source: Copying [%s] to [%s/%s]
id: Menyalin [%s] ke [%s/%s]

source: File [%s] does not exist
id: Berkas [%s] tidak ada

source: Unable to copy [%s] to [%s/%s] [%d]: %s
id: Tidak dapat menyalin [%s] ke [%s/%s] [%d]: %s

source: Trying to backup authselect configuration to [%s]
id: Mencoba untuk membuat cadangan konfigurasi authselect ke [%s]

source: Trying to backup system configuration to [%s]
id: Mencoba untuk membuat cadangan konfigurasi sistem ke [%s]

source: Backup was successfully created at [%s]
id: Cadangan berhasil dibuat di [%s]

source: Unable to create backup [%d]: %s
id: Tidak dapat membuat cadangan [%d]: %s

source: does not exist.
id: tidak ada.

source: Unable to list directory [%s] [%d]: %s
id: Tidak dapat mendaftar direktori [%s] [%d]: %s

source: Removing backup [%s]
id: Menghapus cadangan [%s]

source: Unable to delete directory [%s] [%d]: %s
id: Tidak dapat menghapus direktori [%s] [%d]: %s

source: Unable to copy files [%d]: %s
id: Tidak dapat menyalin berkas [%d]: %s

source: Unable to create symbolic links [%d]: %s
id: Tidak dapat membuat symbolic link [%d]: %s

source: Dconf is not installed on your system
id: Dconf tidak diinstal pada sistem Anda

source: Unable to update dconf database [%d]: %s
id: Tidak dapat memperbarui basis data dconf [%d]: %s

source: Restoring configuration from backup [%s]
id: Memulihkan konfigurasi dari cadangan [%s]

source: Backup [%s] contains authselect configuration
id: Cadangan [%s] berisi konfigurasi authselect

source: Backup [%s] contains non-authselect configuration
id: Cadangan [%s] berisi konfigurasi non-authselect

source: Unable to restore [%s] [%d]: %s
id: Tidak dapat memulihkan [%s] [%d]: %s

source: Unable to generate nsswitch.conf
id: Tidak dapat menghasilkan nsswitch.conf

source: Unable to find nsswitch maps [%d]: %s
id: Tidak dapat menemukan peta nsswitch [%d]: %s

source: Unable to create array (out of memory)
id: Tidak dapat membuat array (kehabisan memori)

source: Unable to obtain feature list (out of memory)
id: Tidak dapat memperoleh daftar fitur (kehabisan memori)

source: Creating empty profile at [%s]
id: Membuat profil kosong di [%s]

source: Unable to make path [%s] [%d]: %s
id: Tidak dapat membuat jalur [%s] [%d]: %s

source: Unable to write to [%s] [%d]: %s
id: Tidak dapat menulis ke [%s] [%d]: %s

source: Omitting [%s] since it does not exist in base profile
id: Menghapus [%s] karena tidak ada dalam profil dasar

source: Unable to check presence of [%s] [%d]: %s
id: Tidak dapat memeriksa keberadaan [%s] [%d]: %s

source: Unable to create symbolic link [%s] to [%s] [%d]: %s
id: Tidak dapat membuat tautan simbolis [%s] ke [%s] [%d]: %s

source: Creating new profile from "%s" at [%s]
id: Membuat profil baru dari “%s” di [%s]

source: Unable to read base profile [%s] [%d]: %s
id: Tidak dapat membaca profil dasar [%s] [%d]: %s

source: Unable to resolve symbolic links names
id: Tidak dapat menyelesaikan nama tautan simbolik

source: Unable to create [%s] [%d]: %s
id: Tidak dapat membuat [%s] [%d]: %s

source: Unknown file name [%s]
id: Nama berkas tidak dikenal [%s]

source: Name can not be empty
id: Nama tidak boleh kosong

source: Default profile can not be created
id: Profil default tidak dapat dibuat

source: Value AUTHSELECT_PROFILE_ANY is invalid in this context
id: Nilai AUTHSELECT_PROFILE_ANY tidak valid dalam konteks ini

source: Unable to create profile path: out of memory
id: Tidak dapat membuat jalur profil: kehabisan memori

source: Profile "%s" already exist at [%s]
id: Profil "%s" sudah ada di [%s].

source: Unable to access [%s] [%d]: %s
id: Tidak dapat mengakses [%s] [%d]: %s

source: Unable to create file name: out of memory
id: Tidak dapat membuat nama berkas: kehabisan memori

source: Unable to create empty profile [%d]: %s
id: Tidak dapat membuat profil kosong [%d]: %s

source: Unable to create profile [%d]: %s
id: Tidak dapat membuat profil [%d]: %s

source: Checking if all required directories are writable.
id: Memastikan bahwa semua direktori yang diperlukan dapat ditulis.

source: Unable to get path to %s parent directory!
id: Tidak dapat memperoleh path ke direktori induk %s!

source: Creating path [%s]
id: Membuat jalur [%s]

source: Unable to create path [%s] [%d]: %s
id: Tidak dapat membuat jalur [%s] [%d]: %s

source: Directory [%s] does not exist, please create it!
id: Direktori [%s] tidak ada, silakan buat!

source: Unable to access directory [%s] in [WX] mode!
id: Tidak dapat mengakses direktori [%s] dalam mode [WX]!

source: Unable to load profile [%s] [%d]: %s
id: Tidak dapat memuat profil [%s] [%d]: %s

source: Creating symbolic link [%s] to [%s]
id: Membuat tautan simbolis [%s] ke [%s]

source: Unable to overwrite file [%s] [%d]: %s
id: Tidak dapat mengganti berkas [%s] [%d]: %s

source: Unable to create symbolic link [%s] [%d]: %s
id: Tidak dapat membuat symbolic link [%s] [%d]: %s

source: Validating link [%s]
id: Memverifikasi tautan [%s]

source: Unable to validate link [%s] [%d]: %s
id: Tidak dapat memvalidasi tautan [%s] [%d]: %s

source: [%s] was not created by authselect!
id: [%s] tidak dibuat oleh authselect!

source: Error while trying to access file [%s] [%d]: %s
id: Kesalahan saat mencoba mengakses berkas [%s] [%d]: %s

source: Unable to check file [%s] [%d]: %s
id: Tidak dapat memeriksa berkas [%s] [%d]: %s

source: Symbolic link [%s] to [%s] still exists!
id: Tautan simbolik [%s] ke [%s] masih ada!

source: File [%s] exists but it needs to be overwritten!
id: Berkas [%s] sudah ada, tetapi perlu ditimpa!

source: Skipping [%s] because it is not an authselect file
id: Melewatkan [%s] karena bukan berkas authselect

source: Reading file [%s/%s]
id: Membaca berkas [%s/%s]

source: Unable to read file [%s/%s] [%d]: %s
id: Tidak dapat membaca berkas [%s/%s] [%d]: %s

source: Unable to compile regular expression: regex error %d
id: Tidak dapat mengompilasi ekspresi reguler: kesalahan regex %d

source: Unable to search string: regex error %d
id: Tidak dapat mencari string: kesalahan regex %d

source: Unable to read [%s] [%d]: %s
id: Tidak bisa membaca [%s] [%d]: %s

source: Unable to generate nsswitch.conf [%d]: %s
id: Tidak dapat menghasilkan nsswitch.conf [%d]: %s

source: Unable to generate files [%d]: %s
id: Tidak dapat menghasilkan berkas [%d]: %s

source: Writing temporary file for [%s]
id: Menulis berkas sementara untuk [%s]

source: Unable to write temporary file [%s] [%d]: %s
id: Tidak dapat menulis berkas sementara [%s] [%d]: %s

source: Temporary file is named [%s]
id: Berkas sementara bernama [%s]

source: Renaming [%s] to [%s]
id: Mengganti nama [%s] menjadi [%s]

source: Unable to rename [%s] to [%s] [%d]: %s
id: Tidak dapat mengganti nama [%s] menjadi [%s] [%d]: %s

source: Validating file [%s]
id: Memvalidasi berkas [%s]

source: [%s] does not exist!
id: [%s] tidak ada!

source: Unable to validate file [%s] [%d]: %s
id: Tidak dapat memvalidasi file [%s] [%d]: %s

source: Comparing content against [%s]
id: Membandingkan konten terhadap [%s].

source: Comparing content against current profile
id: Membandingkan konten terhadap profil saat ini

source: [%s] has unexpected content!
id: [%s] memiliki konten yang tidak terduga!

source: Unable to check file mode of [%s] [%d]: %s
id: Tidak dapat memeriksa mode berkas dari [%s] [%d]: %s

source: File [%s] was modified outside authselect!
id: Berkas [%s] telah diubah di luar authselect!

source: File [%s] is still present
id: Berkas [%s] masih ada

source: %s update failed: %d
id: Pembaruan %s gagal: %d

source: Some directories are not accessible by authselect!
id: Beberapa direktori tidak dapat diakses oleh authselect!

source: Unable to write generated system files [%d]: %s
id: Tidak dapat menulis berkas sistem yang dihasilkan [%d]: %s

source: Unable to write configuration [%d]: %s
id: Tidak dapat membuat konfigurasi [%d]: %s

source: Reading profile directory [%s]
id: Membaca direktori profil [%s]

source: Directory [%s] is missing!
id: Direktori [%s] tidak ditemukan!

source: Found profile [%s]
id: Profil ditemukan [%s]

source: Unable to list profiles [%d]: %s
id: Tidak dapat membuat daftar profil [%d]: %s

source: Unable to open directory [%s] [%d]: %s
id: Tidak dapat membuka direktori [%s] [%d]: %s

source: Looking up profile [%s]
id: Melihat profil [%s]

source: Locations array is NULL
id: Array lokasi adalah NULL

source: Profile [%s] is a custom profile
id: Profil [%s] adalah profil kustom

source: Profile [%s] is a vendor profile
id: Profil [%s] adalah profil vendor

source: Profile [%s] is a default profile
id: Profil [%s] adalah profil bawaan

source: Profile [%s] found at [%s]
id: Profil [%s] ditemukan di [%s]

source: Profile [%s] was not found
id: Profil [%s] tidak ditemukan

source: Profile [%s] does not contain a name in [%s]!
id: Profil [%s] tidak mengandung nama di [%s]!

source: Unable to get basename of [%s]
id: Tidak dapat mendapatkan nama dasar dari [%s]

source: Unable to stat [%s] [%d]: %s
id: Tidak dapat menampilkan [%s] [%d]: %s

source: Unable to stat directory [%d]: %s
id: Tidak dapat mengakses direktori [%d]: %s

source: Removing file [%s/%s]
id: Menghapus berkas [%s/%s]

source: Removing directory [%s]
id: Menghapus direktori [%s]

source: Internal error: stat cannot be NULL!
id: Kesalahan internal: stat tidak boleh NULL!

source: [%s] is not a directory!
id: [%s] bukanlah direktori!

source: [%s] is not a regular file!
id: [%s] bukanlah berkas biasa!

source: [%s] is not a symbolic link!
id: [%s] bukanlah tautan simbolis!

source: [%s] has wrong type [%.7o], expected [%.7o]!
id: [%s] memiliki tipe yang salah [%.7o], diharapkan [%.7o]!

source: [%s] has wrong mode [%.4o], expected [%.4o]!
id: [%s] memiliki mode yang salah [%.4o], diharapkan [%.4o]!

source: [%s] has wrong owner [%u], expected [%u]!
id: [%s] memiliki pemilik yang salah [%u], diharapkan [%u]!

source: [%s] has wrong group [%u], expected [%u]!
id: [%s] memiliki grup yang salah [%u], diharapkan [%u]!

source: Unable to read link destination [%s] [%d]: %s
id: Tidak dapat membaca tujuan tautan [%s] [%d]: %s

source: Link [%s] does not point to [%s]
id: Tautan [%s] tidak mengarah ke [%s]

source: Link [%s] points to [%s]
id: Tautan [%s] mengarah ke [%s]

source: Internal error: filepath cannot be NULL!
id: Kesalahan internal: jalur berkas tidak boleh NULL!

source: Unable to get parent directory of [%s] [%d]: %s
id: Tidak dapat mendapatkan direktori induk dari [%s] [%d]: %s

source: Unable to chmod file [%s] [%d]: %s
id: Tidak dapat mengubah izin berkas [%s] [%d]: %s

source: Unable to chown file [%s] [%d]: %s
id: Tidak dapat mengubah kepemilikan berkas [%s] [%d]: %s

source: Unable to create selabel context [%d]: %s
id: Tidak dapat membuat konteks selabel [%d]: %s

source: Unable to lookup selinux context [%d]: %s
id: Tidak dapat menemukan konteks SELinux [%d]: %s

source: Found default selinux context for [%s]: %s
id: Telah ditemukan konteks SELinux default untuk [%s]: %s

source: Unable to obtain selinux context for [%s] [%d]: %s
id: Tidak dapat memperoleh konteks SELinux untuk [%s] [%d]: %s

source: not set
id: belum diatur

source: Found selinux context for [%s]: %s
id: Kontekst SELinux ditemukan untuk [%s]: %s

source: Unable to get current fscreate selinux context!
id: Tidak dapat mendapatkan konteks SELinux fscreate saat ini!

source: Unable to get default selinux context for [%s] [%d]: %s!
id: Tidak dapat mendapatkan konteks SELinux default untuk [%s] [%d]: %s!

source: Unable to set fscreate selinux context!
id: Tidak dapat menetapkan konteks SELinux fscreate!

source: Unable to restore fscreate selinux context!
id: Tidak dapat memulihkan konteks SELinux fscreate!

source: File [%s] should exist but is missing. It is not safe to delete [%s]. Aborting.
id: Berkas [%s] seharusnya ada tetapi tidak ditemukan. Tidak aman untuk menghapus [%s]. Membatalkan.

source: Removing [%s]
id: Menghapus [%s]

source: Invalid operator!
id: Operator tidak valid!

source: Unable to process match [%d]: %s
id: Tidak dapat memproses pertandingan [%d]: %s

source: Unable to process operator [%d]: %s
id: Tidak dapat memproses operator [%d]: %s

source: Unable to generate template [%d]: %s
id: Tidak dapat menghasilkan templat [%d]: %s

source: Unable to get current time!
id: Tidak dapat mendapatkan waktu saat ini!

source: Unable to create message!
id: Tidak dapat membuat pesan!

source: Unable to find new match: regex error %d
id: Tidak dapat menemukan kecocokan baru: kesalahan regex %d

source: Unable to create temporary file for [%s] [%d]: %s
id: Tidak dapat membuat berkas sementara untuk [%s] [%d]: %s

source: File [%s] is bigger than %uKiB!
id: Berkas [%s] lebih besar dari %uKiB!

source: Unable to read file [%s] [%d]: %s
id: Tidak dapat membaca berkas [%s] [%d]: %s

source: Unable to open file [%s] [%d]: %s
id: Tidak dapat membuka berkas [%s] [%d]: %s

source: Unable to write data [%s] [%d]: %s
id: Tidak dapat menulis data [%s] [%d]: %s

source: Common options:
id: Opsi umum:

source: Print error messages
id: Cetak pesan kesalahan

source: Print trace messages
id: Cetak pesan jejak

source: Print warning messages
id: Cetak pesan peringatan

source: Help options:
id: Opsi bantuan:

source: Show this for a command
id: Tampilkan ini sebagai perintah

source: Show brief usage message for a command
id: Tampilkan pesan penggunaan singkat untuk perintah

source: Usage: %s COMMAND COMMAND-ARGS
id: Penggunaan: %s PERINTAH ARGUMEN-PERINTAH

source: Available commands:
id: Perintah yang tersedia:

source: Authselect command '%s' can only be run as root!
id: Perintah Authselect ‘%s’ hanya dapat dijalankan sebagai root!

source: Bug: commands can't be NULL!
id: Bug: Perintah tidak boleh NULL!

source: Command options:
id: Opsi perintah:

source: Common options:
id: Opsi umum:

source: [OPTIONS...]
id: [OPSI...]

source: Out of memory!
id: Kehabisan memori!

source: Invalid option %s: %s
id: Opsi tidak valid %s: %s

source: Missing option: %s
id: Opsi yang hilang: %s

source: Only one free argument is expected!
id: Hanya satu argumen bebas yang diharapkan!

source: Unexpected parameter: %s
id: Parameter yang tidak terduga: %s

source: At least one option is required!
id: Setidaknya satu opsi harus dipilih!

source: Profile identifier.
id: Identifikasi profil.

source: Unable to parse command arguments
id: Tidak dapat memproses argumen perintah

source: Unable to backup current configuration!
id: Tidak dapat melakukan cadangan konfigurasi saat ini!

source: Backup stored at %s
id: Cadangan disimpan di %s

source: Enforce changes
id: Terapkan perubahan

source: Backup system files before activating profile (generate unique name)
id: Cadangkan berkas sistem sebelum mengaktifkan profil (buat nama unik)

source: Backup system files before activating profile
id: Cadangkan berkas sistem sebelum mengaktifkan profil

source: NAME
id: NAMA

source: Do not backup system files when --force is set
id: Jangan cadangkan berkas sistem saat opsi --force diaktifkan

source: Do not print profile requirements
id: Jangan mencetak persyaratan profil

source: Unable to get profile information [%d]: %s
id: Tidak dapat memperoleh informasi profil [%d]: %s

source: Unable to read profile requirements!
id: Tidak dapat membaca persyaratan profil!

source: Unable to obtain nsswitch maps!
id: Gagal memperoleh peta nsswitch!

source: Some unexpected changes to the configuration were detected. Use --force parameter if you want to overwrite these changes.
id: Beberapa perubahan tak terduga pada konfigurasi telah terdeteksi. Gunakan parameter --force jika Anda ingin mengganti perubahan ini.

source: Unable to activate profile [%d]: %s
id: Tidak dapat mengaktifkan profil [%d]: %s

source: Profile "%s" was selected.
id: Profil “%s” telah dipilih.

source: The following nsswitch maps are overwritten by the profile:
id: Peta nsswitch berikut ini ditimpa oleh profil:

source: Changes were successfully applied.
id: Perubahan telah diterapkan dengan sukses.

source: No existing configuration detected.
id: Tidak ditemukan konfigurasi yang ada.

source: Some unexpected changes to the configuration were detected. Use 'select' command instead.
id: Beberapa perubahan tak terduga pada konfigurasi telah terdeteksi. Gunakan perintah ‘select’ sebagai gantinya.

source: Unable to apply changes [%d]: %s
id: Tidak dapat menerapkan perubahan [%d]: %s

source: Print command parameters instead of formatted output
id: Cetak parameter perintah alih-alih output yang diformat

source: Unable to get current configuration [%d]: %s
id: Tidak dapat mendapatkan konfigurasi saat ini [%d]: %s

source: Profile ID: %s
id: ID Profil: %s

source: Enabled features:
id: Fitur yang diaktifkan:

source: None
id: Tidak ada

source: Unable to test current configuration [%d]: %s
id: Tidak dapat menguji konfigurasi saat ini [%d]: %s

source: Current configuration is not valid. It was probably modified outside authselect.
id: Konfigurasi saat ini tidak valid. Kemungkinan besar konfigurasi ini diubah di luar authselect.

source: Current configuration is valid.
id: Konfigurasi saat ini valid.

source: System was not configured with authselect.
id: Sistem tidak dikonfigurasi dengan authselect.

source: Unable to get profile list!
id: Tidak dapat menampilkan daftar profil!

source: Unable to get profile features [%d]: %s
id: Tidak dapat mengakses fitur profil [%d]: %s

source: Print content of all files
id: Cetak isi semua berkas

source: Print nsswitch.conf content
id: Cetak isi berkas nsswitch.conf

source: Print system-auth content
id: Cetak konten sistem otentikasi

source: Print password-auth content
id: Cetak konten yang dilindungi kata sandi

source: Print smartcard-auth content
id: Cetak konten otentikasi kartu pintar

source: Print fingerprint-auth content
id: Cetak konten otentikasi sidik jari

source: Print postlogin content
id: Cetak konten setelah login

source: Print dconf database content
id: Cetak isi basis data dconf

source: Print dconf lock content
id: Cetak isi kunci dconf

source: Unable to get generated content [%d]: %s
id: Tidak dapat mendapatkan konten yang dihasilkan [%d]: %s

source: File %s: Empty
id: Berkas %s: Kosong

source: File %s: %s
id: Berkas %s: %s

source: Feature to enable.
id: Fitur yang dapat diaktifkan.

source: Unable to backup current configuration [%d]: %s
id: Tidak dapat melakukan cadangan konfigurasi saat ini [%d]: %s

source: Unable to enable feature [%d]: %s
id: Tidak dapat mengaktifkan fitur [%d]: %s

source: Feature to disable.
id: Fitur untuk dinonaktifkan.

source: Unable to disable feature [%d]: %s
id: Tidak dapat menonaktifkan fitur [%d]: %s

source: Create new profile as a vendor profile instead of a custom profile
id: Buat profil baru sebagai profil vendor alih-alih profil kustom

source: ID of a profile that should be used as a base for the new profile
id: ID profil yang harus digunakan sebagai dasar untuk profil baru

source: Base new profile on a default profile even if vendor profile with the same name exists
id: Buat profil baru berdasarkan profil default, meskipun profil vendor dengan nama yang sama sudah ada

source: Symlink meta files from the base profile instead of copying them
id: Gunakan tautan simbolik (symlink) untuk berkas meta dari profil dasar daripada menyalinnya

source: Symlink nsswitch files from the base profile instead of copying them
id: Gunakan tautan simbolis (symlink) untuk berkas nsswitch dari profil dasar daripada menyalinnya

source: Symlink pam files from the base profile instead of copying them
id: Buat tautan simbolik (symlink) untuk berkas pam dari profil dasar daripada menyalinnya

source: Symlink dconf files from the base profile instead of copying them
id: Buat tautan simbolis (symlink) untuk berkas dconf dari profil dasar daripada menyalinnya

source: Symlink specific file (can be set multiple times)
id: Tautan simbolik untuk berkas tertentu (dapat diatur beberapa kali)

source: New profile name.
id: Nama profil baru.

source: Unable to create new profile [%d]: %s
id: Tidak dapat membuat profil baru [%d]: %s

source: New profile was created at %s
id: Profil baru telah dibuat di %s

source: Print backup names without any formatting and additional information
id: Cetak nama cadangan tanpa format apa pun dan informasi tambahan

source: Unable to list available backups!
id: Tidak dapat menampilkan daftar cadangan yang tersedia!

source: %-*s (created at %s)
id: %-*s (dibuat pada %s)

source: Name of the backup to remove.
id: Nama cadangan yang akan dihapus.

source: Unable to remove backup [%s] [%d]: %s
id: Tidak dapat menghapus cadangan [%s] [%d]: %s

source: Name of the backup to restore from.
id: Nama cadangan yang akan dipulihkan.

source: Unable to restore backup [%s] [%d]: %s
id: Tidak dapat memulihkan cadangan [%s] [%d]: %s

source: Unable to uninstall authselect configuration [%d]: %s
id: Tidak dapat menghapus konfigurasi authselect [%d]: %s

source: Select profile
id: Pilih profil

source: Regenerate configuration for currently selected command
id: Memperbarui konfigurasi untuk perintah yang saat ini dipilih

source: List available profiles
id: Daftar profil yang tersedia

source: List available profile features
id: Daftar fitur profil yang tersedia

source: Show profile information
id: Tampilkan informasi profil

source: Print profile requirements
id: Persyaratan profil cetak

source: Get identifier of currently selected profile
id: Dapatkan identifikasi profil yang saat ini dipilih

source: Check if the current configuration is valid
id: Periksa apakah konfigurasi saat ini valid

source: Print changes that would be otherwise written
id: Cetak perubahan yang seharusnya ditulis

source: Enable feature in currently selected profile
id: Aktifkan fitur pada profil yang saat ini dipilih
